{"posts":[{"id":"2018/02/09/About-innovation.md","slug":"2018/02/09/about-innovation","body":"# 关于创新\n\n创新真的很难，踏花归来马蹄急，王希孟能在马蹄上画飞蝶，换做别人指不定要熏香了。\n\n前一阵子，我看到了一个html5实现印章的视频，猜想是forcetouch还是什么新的API，比如能获取到受力面的功能，翻了MDN并没找到什么新API，结果这个例子是拿多点触控实现的。好主意啊，哪怕是只有两点就可以对应到无数个图章了，何况现有设备真的不止两点触控。\n我又想到了任天堂新出的labo，谁也不知道它会拿一堆破纸壳对付别家的精密仪器。\n\n其实，并不是说研发新的设备或者方法，“革”老习惯的命就不是创新了，可是如果能利用现有资源做的创新可比那些革命者灵气多了","collection":"blog","data":{"type":"post","category":"life"}},{"id":"2018/02/17/Two-forbidden-books.md","slug":"2018/02/17/two-forbidden-books","body":"# 两本禁书\n\n这两个月看了两本政治幻想的书，＜建丰二年＞＜黄祸＞．\n去年我就看了本＜巨婴国＞，感觉是为了赢噱头才自称是禁书的．\n这两本则不同，第一本假想解放战争失败，另一本假想六四平反．\n\n## 建丰二年\n\n感觉出名就在这本书的设定上了，不论是情节还是文采，真心一般．\n而且读了一半就感觉作者无法驾驭得了这个设定．弃～\n\n## 黄祸\n\n这本可比前者好看得多，作者的文采和情节确实吸引人．\n作为一个后人重看作者９０年代的寓言，就好像看推背图一样．\n感觉作者过分着重六四了，虽然带入感很强，\n可我总觉得那个平行宇宙也不会总拿一件事来回讲（毕竟作者序里面没说这是部给六四平反的小说）．\n\n## 总结\n\n所以禁书被禁不管是处于啥原因，这年头想出来本＜石头记＞，太难了．\n","collection":"blog","data":{"type":"post","category":"life"}},{"id":"2018/02/25/About.md","slug":"2018/02/25/about","body":"# 关于姥姥\n\n按理说，作为被春节剥夺了一天的周末，我希望这一天能平平静静地度过。\n然而，这一天的信息量远远超过了一个普通的周末。\n别提刷爆朋友圈的取消任期制的政事了，今天我收到了姥姥去世的消息。\n\n---\n\n我出生以来，家里的老人只有一个人，就是姥姥。小的时候，爸妈工作晚，我都是住在姥姥家，每天和表哥表姐一起玩，等到晚上妈妈会接我回家。\n\n我可能并不是姥姥最宠的，至少我曾这么想过。\n印象最深的往事，是一天夜里我拽着我妈往家走，\n边走边喊着要把姥姥家的大锅砸穿。\n我不记得是因为什么，我只记得哥儿仨最皮的肯定不是我，\n但挨打的总有我。\n这件事之所以难忘，还是因为这件事成了每年春节饭桌上大家必提的项目。\n\n跟姥姥有关的记忆基本上和吃有关，\n除了大锅，还有地窖。老时候大连家住一楼的都有个地窖，\n小时候的我进一次地窖的感觉简直鬼吹灯一样的惊险刺激。\n后来地窖被扒了，上面种了无花果树，\n这树被她形容的简直是包治百病，不过这树还真治好了我腿上的瘊子。\n\n姥姥六十大寿的时候，我隐约听到有人说她属虎，难怪了，那么凶，\n谁见了她都敬她三分。\n那时候，姥姥家就像丛林之王的家一样，人丁兴旺，\n有吃不完的饼干和煎饼。\n\n---\n\n后来我上学了，因为在学校附近，中午我会跑去姥姥家蹭饭，\n姥姥家的碗跟脸一样大，就现在来看我真不知道我是怎么吃完那么多饭的。\n\n我的胳膊骨折过一次，挂着绷带的我还得值日，\n那天中午我因为值日回去的晚了些，她察觉到了，\n竟然跑到学校里跟我抢拖布，吓得我的同学都叫她大老虎。\n\n姥姥的关心随着我的日渐疏远而加重，\n每次见到姥姥，她常说的话是“宫健喜欢画画，\n我去银行换了很多一块钱给你坐车上课用”。\n\n后来，随着大姨和大舅一一地去了，\n姥姥家也没有了往日的热闹，\n我听妈妈说姥姥曾哭着给大夫下跪。\n我还从没见过大老虎哭过呢。\n\n---\n\n姥姥和小舅搬到很远的地方了，要一个小时车程，我也再也没有往那些矮矮的赫鲁晓夫楼那里去了，那些童年里融化了的雪人，吹散了的冰花，冻炸的暖气管子，炸飞的可乐瓶子都随着他们搬去了远方。\n\n再见到姥姥的日子，屈指可数，姥姥不跟我们在一个桌子吃饭了，\n可能是觉得桌子小吧。她总是开着电视坐着，坐着坐着就睡着了，\n你要是关了电视她还总能醒过来。\n\n有一年我拿来我到全国各地旅游的照片，我想告诉她，虽然我不能带她去各种地方玩，但我可以把各种地方带给她看，可似乎她并不感兴趣，她关心的和很多中国老人一样，我什么时候搞对象。\n\n前年过年我去姥姥家探望，貌似已经没了年的感觉，中午只是煮了两碗挂面，她带我去看家里的相册，告诉我以前的老邻居谁又去了，基本上和往年一样，她会指着大舅的照片说我和他有多像。话中带有些许哽咽，时而会抬起头静静地盯着没人的方向，一句话也不说。\n\n一代人的芳华，面目全非，即使照片里面笑容依旧，却更显得岁月的无情。\n\n---\n\n每个节日我都会给姥姥打电话，她的嗓音一如丛林之王般洪亮，\n丝毫没有病态。去年中旬，我时常会梦到老房子，有几次我梦到姥姥带着煎饼和饼干来到我北京的房子，说想来见我。我以为是工作压力太大不以为然。\n\n到了去年十一，爸妈才跟我说，姥姥已经是癌症晚期，家人瞒了她很久，爸妈叮嘱我不要急忙回来，怕姥姥会往坏的地方想。\n\n今年元旦，姥姥用老爸的手机第一次和我视频，依然是老虎一般的嗓音，像个小女生照镜子一样端详着小窗里的自己，脸色也比我爸妈形容的好很多。我心想，人活八十了怎么不会遇点坎，况且大老虎发威了，鬼见到也要发抖的啊。\n\n今年春节，很多时间是在姥姥家过的。姥姥瘫坐在床上，像一只病了的老虎。爸爸告诉我她已经不认人了，可我并不这么认为，因当我跟她说我明年就带对象过来的时候，她脸上不屑的表情兼职和往年如出一辙。\n\n刚和爸妈通完话，姥姥初八去世了，明天就火化。\n我不知如何解释我的心情，相比于悲伤，更像是解脱。\n解脱了这一年的猜忌、误会甚至是争吵，\n就像当年带走我的童年一样，这一切都随着她而离去了。\n\n![唯一的一次视频](http://ww1.sinaimg.cn/small/89d0a2e1ly1fot70eiqgoj20u01hct9u.jpg)\n\n---\n\n借CoCo的一段影评。\n\n> 死亡不是永别，忘记才是。有人记得你，你心里也仍有牵挂，这便是生活莫大的幸福和意义。\n\n斯人已去，此情长存。\n\n![斯人已去，此情长存](http://ww1.sinaimg.cn/large/89d0a2e1ly1fot4xsuvysj20u00u0gn4.jpg)\n\n","collection":"blog","data":{"type":"post","category":"life"}}]}