{"posts":[{"id":"2019/01/09/curl-k.md","slug":"2019/01/09/curl-k","body":"# curl有一个k参数是可以不校验证书的！\n\n可能是我后知后觉了，curl -k 可以忽略证书认证\n\n> -k, --insecure\n(SSL) This option explicitly allows curl to  perform  \"insecure\"\nSSL connections and transfers. All SSL connections are attempted\nto be made secure by using the CA certificate  bundle  installed\nby  default.  This  makes  all connections considered \"insecure\"\nfail unless -k, --insecure is used.\nSee this online resource for further details:\n http://curl.haxx.se/docs/sslcerts.html\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2019/01/11/outline.md","slug":"2019/01/11/outline","body":"# 解析outline协议\n\n今天是小三节，祝各位小三都能打倒原配，走上人生巅峰（误）。\n\n谷歌的Outline，如何在linux下面使用呢？\n\nOutline是基于ShadowSocket的，协议是```ss://<base64>@<server>:<port>```所以如果你用的是安卓的客户端，直接把协议转成二维码，用ShadowSocks就能扫码使用了。\n\n上面已经能看出来```server```和```server_port```了，那么一个shadowsocks的配置文件，还差```password```和```method```，解译base64部分，便可以得出```<method>:<password>```。\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2019/01/12/Wanderer.md","slug":"2019/01/12/wanderer","body":"\n# 流浪地球\n\n马上流浪地球就要上映了，反正也是篇中篇小说我大致看一下好了。\n\n故事大概说的是太阳即将变成矮星，人类打算搬离太阳系，但是无法创造一个完全的类地生态系统，所以干脆让地球达到逃逸速度逃离太阳的故事。\n\n科幻故事嘛，总会有瑕疵，详情参考知乎[流浪地球：行星发动机理论可行吗？](https://zhuanlan.zhihu.com/p/51496504)。\n\n整个故事还算合情合理的，起码当我拿它当睡前故事看，晚上睡觉还真梦到地球爆炸了。。。\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2019/01/19/windows.md","slug":"2019/01/19/windows","body":"\r\n# Using Windows to develop\r\n\r\nLast year, I started thingking to switch into Windows rapidly. Back to the years I decided to use Linux. Mostly because I want a faster working environment, the old Vista required more memories and CPU usages that I could't afford. Even in Windows8, gnome-shell run much more fluent.\r\n\r\n## Cons in Linux desktops \r\n\r\nSo, why do I want to switch?\r\n\r\nWell, games are not the problem, I quiet like to play supertuxkart, actually.\r\n\r\nHDPI is a hard chalenge, especially on a touch screen. I admire the effort that the Open Source world took, but it's still not good enough.\r\n\r\nInput bar is an important tool for Chinese users. The latest version of GTK-Chromiumn has a bug, that the input bar cannot get the correct place where the input box is (I was using fcitx). However, if you refer to the old commit of this package, you would see it had been fixed in an earlier version, maybe the bug appeared after some UI refactors.\r\n\r\nthe Input bar problem seems a nofix. gladlly you can use KDE desktop. The great advance of Linux, is the mass amount of desktops. I tried a lot desktops in ArchLinux, KDE, gnome, mint (a fork of gnome) and budgie (another fork of gnome), they all have pretty good support for HIDPI.\r\n\r\nWireless screen sharing, I have a projector. share the screen of my phone to the walls makes me comfortable, but I can't share screen in Linux. Intel holds the driver for screen sharing, and it's not open source.\r\n\r\nBIOS update, dell updates BIOS some time, it makes my laptop more stable. But I can only update it in Windows.","collection":"blog","data":{"type":"post","category":"tech"}}]}