{"posts":[{"id":"2020/09/01/How-to-play-Wanning.md","slug":"2020/09/01/how-to-play-wanning","body":"\n# 万宁怎么玩\n\n3 号晚上要去分界洲学习潜水，所以正好空出 1 天可以在万宁冲一个浪。从海口到万宁高铁 56 元即达，再坐旅游二号线即可到达神州半岛。旅游二号线貌似是新的线路网上还没有信息，乘车和三亚很像上下车都要扫码，分段计算。\n\n神州半岛的海滩是给保利的小区私有的，但是可以趁保安不注意溜进去。可惜今天是中元节，去海边玩太显眼，我们只能晚上去灯塔看看。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/04/Boundaries.md","slug":"2020/09/04/boundaries","body":"\n# 分界洲打卡\n\n从神州半岛乘坐动车 13 元即可到达陵水站，在陵水站旁边停车场可以看到前往分界洲的免费巴士。大概一个小时就能到达分界洲上岛码头乘船上岛了。\n\n此行目的是在分界洲学习水肺潜水，后面会有一篇单独讲潜水的事儿，这篇只讲分界洲玩的感觉。\n\n分界洲号称是平分了海南岛，但我看地图感觉还是偏下了一些。岛上主要是垂钓游泳和爬山，个人感觉沙滩比蜈支洲的要浅，沙子也要粗一些，所以只是游泳，还是蜈支洲好一些（当然，蜈支洲也有点浅）。\n\n从码头沿着小吃街走就能到达网红拍照区域，基本上跟国内大部分景点大同小异了。岛上吃的每家价格不同，想省钱就得多问下。问了下住宿，有 98 元一天的床铺，也有 440 一天的酒店。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/06/OW.md","slug":"2020/09/06/ow","body":"\n# 终于考下来 OW 潜水证书\n\n前面说，我这一程是为了学习水肺潜水。路过抚仙湖的时候就想要潜水，可是抚仙湖潜水太贵了，对比现在能去的 PADI 潜点，分界洲算是比较好的，因为很多国外的教练现在都滞留在国内，而且这是唯一包食宿的潜点（据我调查），三亚又有很多珊瑚礁可以看，干嘛不去呢。\n\nOW 潜水分为理论和实践两部分（废话），理论基本上按照 PADI 的教材来。潜水有两天，第一天大概 3m 左右，水下能看到佛像，还能在水下喂鱼。第一天的学习主要是如何解决二级头以及面镜掉落的问题；第二天潜水就能到 17m（OW 最多是 18m ），水下有沉船，还能看见个五菱宏光。第二天的内容就复杂些，包括中性悬浮和如何使用 CESA 在无潜伴和空气的情况下升到水面。\n\n两天潜水结束，真是筋疲力竭，最后一潜我几乎是像海豹一样上了船。下午考完试，我就成为了一名初级潜水员。\n\n那么我还升级到高级吗？额，可能短时间不会了，反正 6 个月内再潜水一次就不需要复习，so，有 6 个月考虑时间呢。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/07/Great-East-Sea-Surfing-Experience.md","slug":"2020/09/07/great-east-sea-surfing-experience","body":"\n# 大东海冲浪体验\n\n在分界洲学完潜水，正好浪情完美，就急忙赶到大东海冲浪。相比于海棠湾，大东海冲浪要贵很多，100 元每 2 小时，150 元每天。\n\n另外大东海的水要比海棠湾深，基本上踩到水里面半身就进去了，难怪时常听说有人在大东海冲浪淹死的，个人感觉大东海冲浪必须得会游泳了。\n\n饮食上面，大东海周边的选择要比海棠湾多很多，不远就是夏日百货。里面有一家赛百味（竟然是哈尔滨的...）。另外安利三亚的郑阿婆清补凉，定价在三亚里面算良心了。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/08/Rotating-on-the-train,-crossing-the-Qiongzhou-Strait.md","slug":"2020/09/08/rotating-on-the-train-crossing-the-qiongzhou-strait","body":"\n# 火车上轮渡，横穿琼州海峡\n\n从三亚到达湛江的直达专列一天有三班，首先一路到达海口港，我短暂的逛了一下海口港，基本上啥也没有，所以打算在海口港或者海口站周边逛逛的人还是谨慎一点，真的啥也没有...\n\n火车在海口站会停留一个小时左右，紧接着火车会分成几段分别被车头推入轮船里面，可惜不是动力车头，导致车厢没有空调，小百号人挤在海南的夏日里共同忍受着车厢内的高温（以及我旁边座位的高嗓门大爷...）。大概幽闭乐一个小时，重见阳光，就看到湛江港了，没错这就是横穿琼州海峡的感觉，所以有向往的文青还是算了吧 😂。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/09/In-Zhanjiang,-oysters-are-unmanned.md","slug":"2020/09/09/in-zhanjiang-oysters-are-unmanned","body":"\n# 在湛江简直蚝无人性\n\n早就听说湛江生蚝便宜的一绝，反正三亚回上海的机票抢不到，就转道走湛江北上好了。\n\n湛江老城区在赤坎区，这里是「隐秘的角落」的主要拍摄地，强烈推荐这里有一家叫做「土蚝」的高压锅生蚝，53 块钱生蚝吃到爽！\n\n另外赤坎区还有湛江博物馆，很苏联时代的建筑，老实说，能在广东这个地方看见这种建筑我还是很意外的。\n\n湛江机场位于霞山区，是以前的法殖民地，有一些殖民时期遗留建筑，另外海滨广场也在这个区。因为机场也不远，住在霞山区前往机场打车也就二十以内。\n\nBTW，我拿我的吃生蚝的照片给同学看，居然有人说 53 块钱吃贝壳真奢侈...这帮内陆人，不长见识...\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/14/Yinchuan-has-no-McDonald's.md","slug":"2020/09/14/yinchuan-has-no-mcdonalds","body":"\n# 银川没有麦当劳\n\n为什么要去银川呢？这个问题问得好，确实没有什么特别的意义，或许仅仅是为了弥补一下宁夏还没有玩过的缺点，再或者了解一下西夏文字那个方块字的奇葩，再或许仅仅是羊肉。\n\n从湛江去银川的航线，中间要经停潮汕和合肥，在银川的上空观察地面就是一片荒芜的沙漠，经过黄河之后飞机会降落到一片绿色之中，这就是银川。\n\n想象中的银川或许和西宁很像，在西夏团灭之后，忽必烈特别指定这一片土地给回民建成塞上江南，所以觉得应该到处清真寺，这个城市应该时被圆形的白色圆顶包围，并装饰绿色新月图案。然而到达宁夏，别说新月图案了，就算特意去一趟清真寺，也是汉化很多的样子。不过，回民小吃是不变的，烤羊腿、牛肉饼、滩羊，让我这个在广东呆了快两年的人赞不绝口。\n\n## 宁夏省博物馆\n\n宁夏博物馆在人民广场附近，基本上和西北博物馆一样的方形建筑，搭配上西夏的装饰。宁夏省博基本也是罗列历史了，比较有意思的是西夏的佛头，眼睛使用黑釉上色之后和佛身一起烧制，黑釉烧制时会融化，使得佛像会有两道黑色的泪痕。\n\n## 银川当代美术馆\n\n银川当代美术馆在很遥远的郊区，目前有两个展览，中国早期油画展以及地图发展史，很值得一看。\n\n中国早期油画包括两部分，一部分是传教士为了讨好皇室而绘制的画像，另一部分是广东一带海上丝绸之路为销往西方而绘制的中国风油画。\n\n地图发展则是从 17 世纪早期传教士的地图开始，到现代航海测绘的地图结束，展示了多种不同地图，有的地图甚至像是一种全景图而不是目前常见的俯瞰效果。这个展览更有意思的是中国地图，从早期只有沿海一带的长条形逐渐变成现在我国版图的形状竟然过了几百年的时间。\n\n## 宁夏地质博物馆\n\n地质博物馆也在人民广场附近，因为宁夏是我国的稀土产区之一，内部包括我国稀土介绍、宁夏地形介绍、宁夏古生物以及主要矿产介绍。宁夏地形部分可以一看，起码了解到贺兰山中「贺兰」为蒙古语骏马的意思，指贺兰山形像骏马奔腾。\n\n## 总结\n\n感觉银川还是一个没有很大特色的城市（也许是西夏对我的吸引不大），连麦当劳都没有，这还真奇怪，肯德基遍地竟然没有麦当劳。西夏啤酒尝起来也没什么特色，但临走之前在健身房下面的超市试吃了几口哈密瓜，我去，真甜！\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/16/Watch-the-exhibition-in-Hohhot-for-two-days.md","slug":"2020/09/16/watch-the-exhibition-in-hohhot-for-two-days","body":"\n# 在呼和浩特两天都在看展\n\n> 今天一早六点就赶往正定机场差点把笔记本落在候机厅上，好在春秋的空姐帮我找回了，大赞！\n\n下了飞机马上赶往内蒙古博物院，呼和浩特作为内蒙的省会，省会标配地铁，可以直接坐地铁从机场到达博物院。\n\n那么在呼和浩特能看什么馆呢？两个必看，一个是内蒙古博物院，另一个就是内蒙古自然博物馆。博物院基本上就是把汉民族从周开始到清朝初期的所有敌人都详细介绍了一番，而自然博物馆最值得看的就是恐龙了，基本上中国发现的恐龙都在内蒙这儿呢。\n\n## 内蒙古博物院这几个展览就是汉族世仇展啊\n\n内蒙古博物院如果想仔细逛一下基本上要安排一天的时间，一进门先去顶层的远古蒙古，现在回想起来基本上也就记下来一个红山文化。其实这里比较有趣的是夏家店文化，夏家店文化是我国最早使用青铜器的文华，这个夏家店文化分为下层和上层，这两个文化并不属于同一文化分支，可以想象或许就是这一文化借助强大的青铜器技术打倒夏朝并建立商朝（当然这都是我猜的，毕竟商朝号称是从我国东北部打下来的）。\n\n接下来就是周朝，北方主要敌人是胡，后来胡人被匈奴击退到东面成为东胡，再后来又被单于击散，变成乌桓和鲜卑（没事儿，他们还会回来的）。\n\n接下来是匈奴，最主要的是匈奴金冠和王昭君嫁单于的单于和亲瓦当，顺便提一句，原来匈奴并不是一个王，相当于多个部落，当年王昭君嫁单于相当于大汉和北方匈奴一个部落和亲共同抵御更北方更强大的匈奴。当然匈奴没开心一阵子就被汉武帝这个富二代打到西方卖烤肉去了。\n\n后来三国时期曹魏灭了乌桓，让鲜卑异常发达，并参与了五胡乱华，最强大的拓跋鲜卑建立了北魏，当时拓跋鲜卑的敌人是柔然，也就发生了花木兰传说的故事。\n\n可惜没提突厥灭柔然的故事，直接讲唐朝的草原丝绸之路了。然后契丹崛起（嗯，也是鲜卑的后代），建立辽朝，这部分博物馆讲的相当详细，特别开了个展厅介绍，甚至确定一部分契丹后人在云南，另一部分被蒙元挤到中东并建立了短暂的王国。\n\n再后来女真族建立的金朝（毕竟不是本家的民族展馆只介绍它怎么亡的）被蒙古击败，BTW，蒙古也是鲜卑从呼伦贝尔发展过来的，这么来看北面的是少数民族其实都是自己家人打架。\n\n再就是天骄馆，非常详细地介绍了蒙元地发展，但大部分文物都是蒙文，只听见一群蒙古族人看见一个石碑并小声嘟囔「成吉思汗」，估计和在故宫看见康熙提笔差不多吧。\n\n蒙古族后来就是和女真联合建立清朝，清朝投其所好在蒙古搭建藏传佛教黄教寺庙，实际是为了让大量蒙古男性从事喇嘛教而达到降低蒙古族实力的目的（这操作骚啊）。\n\n## 一定要去内蒙古自然博物馆\n\n无缘去澄江自然博物馆看寒武纪生物但这次在内蒙古自然博物馆遇到了二叠纪和三叠纪。\n\n关于恐龙我基本上聊不了多少，内蒙古自然博物馆有两栋楼，一栋介绍内蒙古自然风光和产物，另一栋各种详细介绍恐龙，总之不虚此次行。\n\n## 冰煮羊\n\n强烈推荐呼和浩特的冰煮羊，尽最大可能地保证羊肉鲜嫩，这真算内蒙的美味了。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/18/Ordos-is-the-way-to-open-Inner-Mongolia.md","slug":"2020/09/18/ordos-is-the-way-to-open-inner-mongolia","body":"\n# 鄂尔多斯是打开内蒙古的方式\n\n老实说，呼和浩特给我的感觉并不像内蒙古，毕竟也是个大城市，然而到了鄂尔多斯的东胜西站，下火车的一瞬间就看到碧蓝的天空，几朵貌似触手可及的白云给我的感觉只有「心旷神怡」。\n\n跟本地人聊，对鄂尔多斯大举投资旅游三缄其口，比如特意把鄂尔多斯的主要行政区划都从东胜搬到新区，个人感觉，起码绿化上甩了附近几个城市几条街，从火车站到东胜区中心一路鲜花绿树，让人惊讶这是快要入冬的内蒙。\n\n这次在东胜，主要是来骑马的。在美团上查到这里有一家豪士骑马俱乐部可以去草原野骑，预约好行程，第二天打车到达马场。\n\n这次算是真的骑马，没有人给我拉着缰绳。感觉骑马就是自己和马较劲，刚开始给我一匹厉害的马，以我的魄力根本招架不住，只有它主人的鞭子才能让它动一下。\n\n后来换了匹蒙古马，虽然矮小，但是真的很能跑，松了缰绳就开始狂奔，颠得我猝不及防。但是双脚猛地往前蹬，拽紧缰绳就不怕被甩下来。\n\n东胜还有一个鄂尔多斯青铜馆，乘坐高铁也可以去鄂尔多斯博物馆看看，我的行程时间有限，这两个地方就没去。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/20/Passing-by-Baotou-Museum.md","slug":"2020/09/20/passing-by-baotou-museum","body":"\n# 路过包头博物馆\n\n从鄂尔多斯到包头，就好像又从草原回到城市。包头是一个到处是广场的城市，传说成吉思汗在这里挖出来一棵树根，大呼「鹿角」，蒙语音译过来便是包头，而这个城市也因此成为鹿城。\n\n包头博物馆的基本上算是内蒙古博物馆的缩小版，目前有一个关于印章的特展比较有意思，主要是景教的印章，景教是唐朝基督教的一个分支，马可波罗游记也有提及，可惜后来在国内失传。景教的印章实际是一个十字架纽扣，可以取下来当作印章。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/23/Directly-pounding-Huanglong.md","slug":"2020/09/23/directly-pounding-huanglong","body":"# 直捣黄龙\n\n从虹桥机场出发前往成都，这是我2020年第一次行程的最后一站，这一程比较轻松，基本是跟团游九寨沟，顺便把阿坝周边都逛下来。\n\n过了汶川大概几小时山路就能到达黄龙景区，刚到的时候天气晴朗，远方的山颇有一点优山美地的感觉。景区对高反很强调，基本上比我去拉萨要严格，但个人感觉还可以，起码上山2小时，下山1小时时间刚刚好。\n\n山上都是栈道，和长白山类似，爬起来轻松地多，风景也和长白山类似，只是只有冷泉没有温泉，山上流水清澈见底，大晴天能拍好多照片。","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/24/Jiuzhaigou-watched-water-to-see-Blu-ray-fatigue.md","slug":"2020/09/24/jiuzhaigou-watched-water-to-see-blu-ray-fatigue","body":"\n# 九寨沟看水看到蓝光疲劳\n\n一直想要去九寨沟看看，看一看所谓天下第一的水，然而它比较远，距离成都有将近 200 公里的山路，而且 17 年地震之后去年才恢复开放。\n\n早上七点从川主寺出发，大概中午到达九寨沟的临时入口，临时入口在正在修建的游客大厅旁边，没错游客大厅被毁到现在依然没有恢复，其实在景区里依然能看见很多泥石流未修复的山坡。\n\n九寨沟的水，主要来自于冰川流水，在九寨沟山顶有一处湖泊，长海，通过山中的暗流流到九寨沟 144 处。九寨沟的水及其蓝，所有过来的游客都说他们今生都没见过这么蓝的水（他们好没见识啊）。个人感觉其实和三亚的水差不多，基本上如果水中含盐量比较高，并且存在大量藻类，水会因此吸收阳光中大量长波，使得只有短波会被反射出来。不过九寨沟的水尝起来并没那么咸，因为存在的是钙化盐，算是天然碳酸水吧。\n\n因为水中的金属成分多，所以 80 年代在九寨沟被砍伐落入水中的树木都已经钙化看起来好像不腐一样。\n\n九寨沟景区最后一个景点是一个苯教寺庙，当然我也不是很清楚啦，只知道藏传佛教是汉传佛教和苯教的结合，在这个寺庙里面能看到一些类似南传佛教的建筑和雕塑，但是身材上又不是那么苗条，也算是可以猎奇的一个寺庙了。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/27/nb.md","slug":"2020/09/27/nb","body":"# 在三星堆蹭到了NB的讲解\n\n继上次我到成都玩，我就一直想去三星堆看一看，只是相比于同样是古蜀国的金沙遗址，三星堆并不在成都市区里面。但是从成都搭城际只要17块钱就能到达广汉，在广汉火车站乘坐13路公交到终点站三星堆博物馆即可到达。\n\n在景区内支付10元可以在微信上面听讲解，当然，我也蹭了当地小团的讲解，所以我听了两次😂。\n\n三星堆是民国时期农民意外发现大量玉器而引发的古蜀国遗址开发，在建国后又意外发现两处古祭司器的土堆，包括大量象牙青铜器以及玉器。经过碳14检测竟然有6千到8千多年的历史，当然博物馆保守估计，按照青铜器的样式猜测大概是距今3千年左右的商朝。\n\n另外，在玉器的讲解上面，两次内容也发生分歧，比如被发现的大量玉璧，讲解员猜测应该是某种器械装置，因为当时唯一可用的金属就是软软的青铜，如果做轴承，像这种硬度到8的玉石就能派上用场，或许是这种装置的重要性，后来发展成为了一种象征性的祭祀物品，甚至发展到铜钱，从祭祀品又变成货币。\n\n三星堆有大量青铜器，人眼凸起，被现在看作是一种人眼崇拜。但是具体是为什么依然还需要更多论证，三星堆自开采到这两个遗址之后被要求保护性开采，因为当初挖掘出来的象牙已经全部被氧化，去年重新开始的开采又在目前发现的两个遗址附近又发现了6个遗址坑，可能会有更多发现。\n\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/28/I-only-remember-one-towering-Yuelou-in-Mianyang.md","slug":"2020/09/28/i-only-remember-one-towering-yuelou-in-mianyang","body":"\n# 在绵阳只记住了一座巍峨的越王楼\n\n因为要从绵阳飞回大连，所以我要在绵阳暂住两天，根据同事推荐，我去了趟绵阳的马家巷。\n\n马家巷是绵阳的小吃街，基本上和成都的差不多，只不过自打盲盒火了以后，在成都吃小吃也可以抽盲盒。不过基本上也都是辣的，看来还是在广汉吃的那一顿成都小吃最得我意。\n\n绵阳市博物馆位于城郊富乐山旁边，提到这个富乐山还是刘备给起的名字，据说刘备到了这个地方说此地人民安居乐业生活富乐。博物馆基本上就是民俗生活介绍、历史介绍、自然情况（正在维护），楼上有铜马馆和摇钱树馆，据说全国 19 座汉代摇钱树，绵阳就有五座。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/09/30/Talk-about-fraud-during-travel.md","slug":"2020/09/30/talk-about-fraud-during-travel","body":"\n# 谈谈旅行中的骗术\n\n我个人是拒绝出门买纪念品的，因为大部分纪念品产自中国义乌，就算有很多产品真心喜欢也可以通过邮购寄送回家，也不需要自己背着。其实现在旅行能玩的骗术已经不多了，或者很高深，深到你心服口服，比如一杯咖啡卖你小 50 元的星爸爸。我从没想过那些我小学就已经明晰的骗术，现在还依然存在，尤其是在最近这次旅行中还能看见好多人奋不顾身地往坑里面跳，这大概就是我要写这篇文章的原因了吧。\n\n首先珍珠，碳酸钙，没错最常见的结石了，最简单的制作办法就是把一块异物放到珍珠蚌里面，为了防止自己被割伤，蚌会释放一种物质将异物包裹起来，时间久了就产生了珍珠。话说其实也可以把异物塞到你的关节里面也能产珍珠。\n\n然后是银器，我国就没有那么高的产银量，但是我国的产锡量很高，尤其是西南。看了景区那么多金闪闪的银器，我甚至怀疑他们卖的是铝。销售银器的人往往会拿银器滴墨水，马上墨水就被净化了，在场的人无不欢呼喝彩。冷静下来想想这和以前那些净水器骗局有什么区别？这么迅速的化学反应除了酸碱反应单单依靠水中的银离子能有那么高还原性？那是浓硫酸吗？\n\n再就是玉器，我很怀疑缅甸产的翡翠就叫硬玉，中国产的玉石都是软玉这种说法，毕竟中国那么大的地方，而且和缅甸挨得那么近，怎么就会发生这种类似生物隔离的事情？要看软玉这个名称的由来了，这个词来自于英法联军侵华，人们认为中国是弱的，所以把中国产的玉称之为软玉。当然玉的确有硬度的不同，但软的玉和软玉是两码事儿。其实古代的玉指的是石之美者也，和现代这些放到橱窗里拿钱计价的玉石定义是不同的，所以古人「以玉比德」的玉自然也和现代的不同，没必要拿它当什么道德底线的评价标杆。\n\n最坑人的就是那些清水洗不掉的化妆品小样，先给某个阿姨免费洗半张脸，用透明的洗面奶洗出来很多污渍，然后说这些物资正常清水洗不掉要拿他们专业的水来洗。这...我该怎么说，正常人体排泄出来的，就算是毒素吧，会有水洗不掉的？而且那脸都洗得像涂了一层海藻泥一样，这要是真这么多毒素，这人还活着算是奇迹了吧。\n\n其实和很多销售聊天了解到，其实他们也是蒙在鼓里，把这些骗人手段拿来当销售方式来做...我可以理解贫困山区想找一个出入，但显然骗人不算一个合理的方式吧？我最近喝了一杯沙棘汁，其实我一生喝沙棘的机会也不多，却分外喜欢，因为在众多商品里面，我知道，只有它是真的。\n","collection":"blog","data":{"type":"post","category":"travel"}}]}