{"posts":[{"id":"2020/04/09/Amazon's-anti-drug-drama-zero-zero.md","slug":"2020/04/09/amazons-anti-drug-drama-zero-zero","body":"\n# 亚马逊年度禁毒大戏「零零零」\n\n前几天刷推特，都在传「零零零」这个剧怎么怎么火，说实话，关于黑帮和毒品的剧我还真不敢兴趣，试着抱一抱的心态看了一集，结果一发不可收拾把第一季全看完了，接下来，本文全是剧透！\n\n![截图](./zzz.jpg)\n\n第一集详细介绍了出场人物，分别是买方（buyer）、中间人（broker）以及卖方（seller）。\n\n买方是一对意大利爷孙，暂时称买方爷爷和买方孙子，买方爷爷正在培养孙子处理生意，而孙子则认为爷爷杀死了父亲而暗自结合朋友猪猪仔准备抢下爷爷的生意并复仇。\n\n中间人是美国的一家人，中间人爸爸带着子女两人（中间人姐姐，Emma 和中间人弟弟）相依为命，Emma 帮着父亲处理家庭生意而因为弟弟遗传了母亲的病，中间人爸爸出于保护不愿意给生意交给儿子，而弟弟却一直想出力。\n\n卖方在墨西哥买通缉毒警察，缉毒警察表面在缉毒，暗地里收了卖方的钱偷偷保护卖方，在一次出警时，虽然已经偷偷通知交易双方，但还是在枪战中杀死了中间人爸爸。\n\n中间人爸爸死后，Emma 哄骗弟弟说爸爸同意他们一起接手生意，弟弟很开心并要求自己亲手接管最新的一批可卡因。然而赶到美国参加追悼会的买家孙子认为姐弟俩太弱小，并且想换到自己的中间人手上来架空爷爷，偷偷买通运货的船长，制造船上事故。\n\n在运输中，船长放火打算把弟弟和船一起烧了，然而在船长逃离后，弟弟成功灭火，并一个人把船开到了非洲。Emma 和弟弟在非洲汇合，为了躲开海关检查，姐弟俩选择了一条穿过圣战分子占领的路前往摩洛哥的卡萨布兰卡，中途险些丧命。\n\n同时，卖方缉毒警察清理了自己部队里面的正义分子，完全黑化后和贩毒者发生金钱上的分歧，逐渐壮大之后，干脆干掉原来的卖方自己收钱。\n\n卖方爷爷得知孙子想复仇，来了一出杀猪儆孙（话说爷爷真的很有人格魅力，不愧是意大利黑帮），坦白自己当年杀儿子的原因。爷爷遭到追杀，孙子假装被爷爷打伤放走爷爷，可是因为演技太差被猪猪仔看出来，猪猪仔挟持孙子妻女，让孙子截下停留在卡萨布兰卡的货。\n\n赶到卡萨布兰卡的买方孙子找到中间人弟弟逼迫他说出货的位置，弟弟故意拖延，成功让货物运出，却因此丧了命。Emma 得知弟弟丧命，到意大利找到买方爷爷，买房爷爷为了保全生意，杀死孙子，并解决掉猪猪仔一帮人。\n\nEmma 来到墨西哥交付尾款，发现卖方已经被缉毒警取而代之，交接下一单的要求后，虽然面带微笑带心怀感伤的离开。而远在意大利，买方爷爷重出江湖处理毒品，并准备培养他的曾孙。\n\n所以，千万不要贩毒 😂。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/04/22/Devs.md","slug":"2020/04/22/devs","body":"\n# Devs -配乐很美丽，故事有点虎头蛇尾的剧\n\n![Devs cover](./devs.jpg)\n\n本剧的主角 Lily 和她的男友在一家高端技术公司工作，男友因为项目表现优异被提拔到 Devs 项目中。当天晚上，男友因为帮助俄罗斯特工偷窃 Devs 的代码而被公司的保安男杀害。\n\n第二天 Lily 询问公司高管男友的踪迹被告知男友自杀，Lily 无意间发现男友手机内安装了加密软件，所以找到备胎前男友解锁。备胎前男友本着「当然还是原谅她」的原则帮她解锁并联系上了俄罗斯线人。线人准备拉 Lily 下水，但被 Lily 拒绝，这次联络被保安男发现，保安男解决掉线人，并打算送 Lily 去精神病院。\n\nLily 和备胎前男友发现男友的自杀证据有造假，确定男友是被谋杀，可是 Lily 被保安男胁迫去精神病院。备胎前男友偷偷带 Lily 逃离精神病院，并一同前往公司高管对峙什么是 Devs。\n\n公司高管告诉 Lily，Devs 通过算法用来预测过去与未来，并且这个机器预测到 Lily 和高管一起死亡后就宕机了。\n\n其实 Devs 是公司高管用来复活出车祸女儿的设备，在坚持单一宇宙观多次失败之后，一个工程师加入了多元宇宙的算法，最终能够近似地预测过去和未来，但因为打破 Devs 的初衷，这名工程师也被开除，被设计自杀。\n\nLily 决定不回公司，这样就能打破机器的预测。意外的是保安男将备胎前男友杀死，准备杀 Lily 的时候，被 Lily 家门口的乞丐男杀死。乞丐男是另一个俄罗斯特工，他要求 Lily 回到香港，这样能躲过追责，然而 Lily 最终还是先择走机器预测的路，回到了公司，高管和 Lily 一同看了宕机前得预测，原来 Lily 持枪和高管在电梯对峙，枪击中高管并破坏了电梯，两人跌落而亡。\n\n不过和预测不同的是，Lily 在和高管进入电梯时故意扔掉枪，这样就又打破了机器的预测。高管告诉 Lily，Devs 其实是 Deus，只是 u 设计得太像 v 了（王德发？）。可是电梯还是被认为失控，两人坠落而亡。\n\nLily 醒来，发现男友还在身旁，备胎前男友也活着，到公司发现高管和他的女儿都活着。原来高管将所有人复制到了 Deus 得世界中，所以即使现实两人已经死亡，只要 Deus 不关闭，他们总能生活在这个虚拟的平行空间中，全剧终（王德发？？？？）。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/04/25/Tales.From.the.Loop.md","slug":"2020/04/25/talesfromtheloop","body":"\n# Tales from the Loop-北欧治愈风黑镜\n\n\n八个小故事，但又是发生在同一个小镇中的一群人中。安利[大聪说电影](https://www.bilibili.com/video/BV1Ze411x7sd/) 的解说，最喜欢的就是最后一集，时间转瞬即逝啊，珍惜吧，骚年。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/05/04/Upload.md","slug":"2020/05/04/upload","body":"\n# Upload 科幻喜剧，这个可以\n\n![Tech support!](./2020-05-04-upload.png)\n\nNanthan 在一场车祸之后被自己的白富美女友将自己的意识上传至网上，在虚拟世界 Nanthan 爱上了自己的服务人员，并意识到自己的死亡可能是一场阴谋。\n\n这不是一个烧脑剧，逻辑上有很多纰漏，角色也有点脸谱化，演员可能故意演得很生硬使得这个剧更加轻喜剧化，虽然讲的是谋杀但整个看起来很轻松，值得一看。\n\nMay the 4th be with you.\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/05/05/The-third-season-of-the-Western-World,-which-is-made-up.md","slug":"2020/05/05/the-third-season-of-the-western-world-which-is-made-up","body":"\n# 凑数的西部世界第三季\n\n虽然第三季和很多剧比起来依然优秀，但是烧脑程度和剧情都比不上前两季。可能因为前两季观众都以为 AI 开始覆灭人类了，编剧偏偏不，然后安排了个一季领盒饭的反派拖时间，然后第四季再开始毁灭人类...\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/05/10/Hollywood-A-pot-of-old-duck-soup.md","slug":"2020/05/10/hollywood-a-pot-of-old-duck-soup","body":"\n# 好莱坞——一锅陈年老鸭汤\n\n![hollywood](./2020-05-10-hollywood.png)\n\n本来以为这部电影类似昆汀的「好莱坞往事」，第一集就是男女演员导演编剧卖肉，妥妥的「逐梦演艺圈」大胆北美版。不过第二集剧情就变得有点「歌舞青春」的方向发展，乡村寻梦白人男主和黑人编剧通过卖身养家，白人男主遇到自己将来的女老板，女老板女儿爱上他；黑人编剧接活遇见自己未来男友，未来男友也是来好莱坞寻梦的。同时另一个支线，年轻导演想要导演他自己的处女作，却被要求先导一部已经决定的影片「Peg」，这部影片正好是黑人编剧写的，年轻导演的黑人女友看了剧本，表示如果女主改成黑人会更好。\n\n前面介绍人物的剧情，实在是没啥好说的，感觉更像是以物语换收视。不过后面的剧情变得理想主义化，颇有「新闻编辑室」的感觉，剧情开始讨论女权、种族、同性恋等话题。虽说剧情起伏有点戏剧化，结局奥斯卡获奖以及每个人都有的 happy ending 实在有点 cliche。但今年这个情况，老鸭汤是必须的了。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/05/28/If-the-demon-is-reduced,-the-ghosts-and-gods-after-the-founding-of-the-People's-Republic-of-China-went-to-Hong-Kong.md","slug":"2020/05/28/if-the-demon-is-reduced-the-ghosts-and-gods-after-the-founding-of-the-peoples-republic-of-china-went-to-hong-kong","body":"\n# 降魔的，建国后鬼神都去香港了\n\n去年看过「金宵大厦」后，我就开始关注 TVB 的鬼神片了，最近听说「降魔的 2.0」上映，看了一集没看懂，于是把 2017 年的第一季也看了。这篇文章写在看完 2.0 的第 18 集之后。\n\n![石敢当](./stone.jpg)\n\n「降魔的」主要讲出租司机马季一泡尿解封被封印百年的石精灵「石敢当」，石敢当为报答解封之恩，答应帮马季养母找亲生儿子豪仔的灵魂，不料，在为马季开天眼时能力被马季吸收，马季因此成为降魔人。为了灭掉一个魔，石敢当把自己的全部能量给马季，并和魔同归于尽。第一季结尾，马季终于碰到豪仔的灵魂。\n\n第二季目前讲的是豪仔和海魔做过交易，必须吃人续命，于是找到马季希望能帮忙消灭海魔以解开诅咒。\n\n比较喜欢这部剧环境的设定，比如鬼是人死后为了完成遗愿存在，完成愿望就会去所谓的「目的地」，精灵则是因为被人赋予情感而成形，比如「莉莉」是一个洋娃娃幻化的精灵、「风狮爷」是一个寄予一个爱情故事的石像，魔的存在就更有趣，第一季的大 boss，黑鼠尾草是吸收很多人的血幻化而成，第二季的谎言魔是一幅多年被倒卖的假画幻化而成。\n\n第二季又引入科学解释，搞得这部剧多了些反迷信的色彩（虽然它是鬼片），更加感兴趣它后面的发展了。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/06/30/Hidden-corner.md","slug":"2020/06/30/hidden-corner","body":"\n# 隐秘的角落\n\n「隐秘的角落」是爱奇艺迷雾剧场上的一部 12 集电视剧，主要讲的是单亲男孩朱朝阳暑假偶遇从福利院跑出来的严良和普普，三人去爬山遇到少年宫老师张东升谋杀自己岳父母，并借此事威胁张东升来救助普普的弟弟的故事。\n\n难得好看的国产剧，本来已经对国产剧有些失望，没想到还真有一部好看的。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/07/03/Dark.md","slug":"2020/07/03/dark","body":"\n# 暗黑\n\n这是网飞德国的一部对标「怪奇物语」的电视剧，但是逻辑上绝对比「怪奇物语」复杂得多...也算是德国种族天赋了，能看懂这部剧...总共三季，我超级简单说一下。\n\n第一季是男主角和小伙伴在丛林玩，却遗失了一个男孩。根据自杀的亲生父亲给男主留下的线索，男主找到一个山洞。山洞里面存放着多年来核电站遗弃的核废料，而这些核废料包括阴差阳错生产出来的上帝粒子，导致时空错乱，那个山洞连通了三个时空，未来男主回来就是要毁灭掉这个时空通道，第一季结尾时空通道被毁灭，但是因为方法不对，竟开通了另一条时空隧道。\n\n第二季，男主因为新的时空隧道穿越到未来，意识到自己原来的时空即将发生世界末日。一心想回家的他却回到了核电站建成之前，着这个时空里面他认识了老年的自己，老年的男主自称亚当，欺骗男主利用时空机回到父亲自杀之前，劝服父亲不要自杀，这样就能组织世界末日。然而男主发现父亲本来没打算自杀，而自己的出现却促成这一事件发生。男主希望找回当初遗失的男孩（也就是他父亲），这样虽然他自己就不存在了，依然能拯救世界，认为没有他的世界会更好。但在本季结尾，女主被亚当杀死，世界末日依然发生，来自另一个时空的女主带走了男主。\n\n第三季，男主来到了一个没有他的世界，遇到了这个世界的 boss，夏娃。夏娃说这个世界和原来的世界大体类似，也会有世界末日，两个世界有一个链接保护，亚当的做法会让世界更混乱。男主按照夏娃的指示一步步做，但发现该发生的还是发生了，而另一方面女主被亚当抓走，亚当认为女主怀着另一个世界男主的孩子，这个孩子的力量足以毁灭掉这两个世界，让混乱结束。然而亚当实验之后发现世界并没有结束，受人提示才知道，男主和女主的两个世界本来不该存在。1986 年一个科学家因为儿子离家出走遇到意外，科学家发明时光机想回到过去阻止，不料打开了这两个世界。男女主来到这个本源世界救回科学家儿子阻止了时光机的开发，从此两个世界消失。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/08/15/The-finale-of-SHIES-Agent,-Grandpa-Qinghui.md","slug":"2020/08/15/the-finale-of-shies-agent-grandpa-qinghui","body":"\n# 神盾局特工大结局，爷青回\n\n无需多言，神盾局最后解散了，真的从大学开始追到工作完结的剧。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/12/09/After-skiing,-the-Snail-House-has-finished-watching-the-blade-of-ghosts.md","slug":"2020/12/09/after-skiing-the-snail-house-has-finished-watching-the-blade-of-ghosts","body":"\n# 滑雪之后，蜗居看完鬼灭之刃\n\n本来打算在长春滑雪，但是长春的一日游都要一大早 7 点起床，而沈阳 9 点即可。和客服约好在电报大厦楼下见面，好巧不巧，电报大厦大到一个街区的样子，车停在南面，我在北面，联络了好久才到。\n\n怪坡滑雪场有一个初级道，中级道单双板分开两道，高级道和障碍道还在铺设。说说价钱吧，一日游 84，包括来往车费、滑板、雪靴。上中级道需要花费 30 租一个头盔，柜子 10 元，进雪场需要办卡，走的时候再退。现在滑单板的人真多，一眼望过去双板寥寥无几。\n\n从 10 点一直滑到下午 2 点半，回到市区已经是筋疲力竭，导致第二天基本上是在青旅蹲了一天，把鬼灭之刃的动画和漫画都看完了，期待以后的动画情节。\n","collection":"blog","data":{"type":"post","category":"tv"}}]}