{"posts":[{"id":"2019/11/14/Movie-supplementary-plan-Shawshank's-redemption.md","slug":"2019/11/14/movie-supplementary-plan-shawshanks-redemption","body":"\n# 电影补档计划：肖申克的救赎\n\n这是一个月初的计划，我将从今天起补档豆瓣上 250 个必看的电影中我还没看的电影。\n\n首先「肖申克的救赎」一直在榜单的第一名，以我反对权威的性格，往往第一我是不看的，看了这部剧更加确认了为啥它在中国是第一。\n\n简单讲就是主角 Andy 被误判谋杀入肖申克监狱最后依靠给典狱长洗黑钱换得了假的身份并成功逃离监狱的故事。\n\n故事里面三个人的故事令我印象深刻。\n\n1. Brooke 在监狱呆了 50 年，假释没过多久因为不适应外面的生活自杀了。有一个有趣的点，他救过一只小乌鸦，本来决定乌鸦长好就放生，但是乌鸦一直陪到他假释才被放生。\n2. Andy 入狱后其实就在表面上雕刻石块，实际偷偷越狱。但同时又在帮典狱长偷税，帮自己建立了一个虚构的身份。得知自己是冤枉并向典狱长申诉无果的时候 Andy 通过自己挖出来的地道逃离监狱。\n3. Red 就是电影的讲述人，40 年监狱生涯每次假释都被回绝，但是最后一次他回答的问题和他之前的完全不同竟然通过了假释，并成功和 Andy 汇合。\n\n其实槽点挺多的，细想下来很多点比较戏剧化，就算一个不错的励志故事，毕竟现在的电影都没有在好好讲故事了。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/15/Movie-supplement-plan-Farewell-My-Concubine.md","slug":"2019/11/15/movie-supplement-plan-farewell-my-concubine","body":"\n# 电影补档计划： 霸王别姬\n\n首先吐槽一下优速快递，本来今天打算去南山博物馆然后去游泳，结果等了一天也没来上门取件，最后找了京东快递。\n\n众所周知「霸王别姬」讲的是禁忌之爱 😏，但其实这部剧讲的是主角程蝶衣的人生，而且三个小时的电影期间，我出门取了三次快递...\n\n总体上说，如果国内每部电影都能达到霸王别姬的水平，那么中国还愁没有好电影？\n\n1. 开始小豆子，就是程蝶衣被妓女母亲带到戏班里面学习唱戏，认识了小石头，也就是段小楼。\n\n2. 后来因为演了一出霸王别姬两人唱红，段小楼认识了花满楼的名妓菊仙。\n\n3. 日本人进城，一次后台准备时日本人玩弄戏服被激怒段小楼并导致他被抓，为了救段小楼，程蝶衣为日本人表演了牡丹亭的游园。\n\n4. 日本投降，程彩蝶被判为汉奸，段小楼为救程蝶衣让他撒谎为日本人演戏是被逼迫的，然而程蝶衣没撒谎，但是因为有将领想看程蝶衣表演，他还是被释放了。\n\n5. 北京解放，程彩蝶因为在戏剧上和徒弟的见解发生分歧埋下隐患。\n\n6. 文革，原来的戏院老板和演员都被打倒，程蝶衣被逼说出菊仙是妓女，段小楼被逼表明不爱菊仙，菊仙最终自杀。\n\n这个故事说了什么？理想主义是不可能的，这辈子是不可能的（抱紧我自己）。小癞子为了糖葫芦丧命，这个糖葫芦就是梦想的暗喻，蝶衣也始终没有把京剧发展到他希望的样子。而通过表演霸王别姬赢得的那把剑也暗喻段小楼和程蝶衣的爱情，最后程蝶衣也葬送在了那把剑下面。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/17/Movie-supplementary-plan-A-Gump.md","slug":"2019/11/17/movie-supplementary-plan-a-gump","body":"\n# 电影补档计划：阿甘正传\n\n看完阿甘正传，很惊奇于它竟然能在豆瓣排第三，两个多小时下来，除了平铺直叙阿甘的美国梦顺带着 60~90 年代的美国变化（换了好几任总统，而且好多都是被刺杀的我去），基本上也没啥了，连最起码的起承转合都没有，换成高考作文的话，这篇文章基本也就不及格了。\n\n不过，可以看出，就现在的电影，不少都借鉴了阿甘正传的剪辑手法，相信就 1994 年的观众看到这种蒙太奇还是很新颖的。\n\n1. 阿甘出生在美国南部的乡村里，小的时候只能依靠器械来走路，而且智商低于常人，她母亲通过和校长发生关系让他上公立学校。\n\n2. 读书时阿甘认识并爱上了 Jenny，在一次被霸凌的时候阿甘学会了跑步，于是他去哪儿都跑步。\n\n3. 在一次跑步时，阿甘误入橄榄球场，被教练推荐到大学。\n\n4. 大学毕业，阿甘应征入伍，去越南打越战。\n\n5. 越战返国，阿甘带着去世战友的遗愿做了捕虾船的船长，他的大副是他的残疾的长官。\n\n6. 捕虾发财后，阿甘回家做了免费园丁，重新遇到 Jenny，Jenny 自认为配不上阿甘，一夜情后不辞而别。\n\n7. 阿甘很难过，开始跑步，几年后他徒步穿越了整个美国。\n\n8. 阿甘收到 Jenny 的消息，原来他有了一个儿子，Jenny 重病，和阿甘完婚不久就去世。\n\n我实在是想不出更激荡的剧情了，整个故事真的是平铺直叙，但是随便捡出一个故事都是一个不错的散文故事。\n\n我最喜欢的还是阿甘开始跑步，他的目的就是跑步，而不久开始有很多人开始跟着他跑，他们不相信他只是为了跑步而跑步，就这么随着大流也去跑。等阿甘累了，他停下来，兴尽而返，而跟着他跑的人则一脸茫然「What about us?」。\n\n所以啊，自己有目标，就自己去追。不要把自己的意愿扣到别人的行为上，生活不是高考，不会有人要你推测窗帘是蓝色的表达了作者啥思想感情，没准儿，那窗帘就是蓝的。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/19/Movie-supplementary-plan-This-killer-is-not-too-cold.md","slug":"2019/11/19/movie-supplementary-plan-this-killer-is-not-too-cold","body":"\n# 电影补档计划： 这个杀手不太冷\n\n![这个杀手不太冷](https://img3.doubanio.com/view/photo/s_ratio_poster/public/p511118051.webp)\n\n感觉又是一部分数虚高的电影，不过仔细想想，就是现在，leon 敢对 Mathida 产生感情都会被人当作变态，即便我对这个故事情节不喜欢，但由于演员演技都在线，所以还是可以一看的。\n\n故事情节是杀手 Leon 住在一栋意大利人的公寓里，他的邻居 Mathida 的父亲是名毒贩。一天 Mathida 外出买菜的时候家里遭到恶警灭门，当 Mathida 回家时，她发现家里都是陌生人，只好假装路人躲到了目睹一切的 Leon 家里。\n\n得知 Leon 是杀手后，Mathida 请求 Leon 教他杀人方法，作为交换她教 Leon 读书。久而久之二人产生情愫，Leon 决定偷偷为 Mathida 报仇，而 Mathida 也在偷偷用自己的方式报仇，但是 Mathida 漏出马脚被反派挟持，Leon 单枪匹马救出 Mathida 但是暴露了行迹。最终 Leon 为了救 Mathida 和反派同归于尽。\n\n很温暖的故事，不过还真喜欢反派，怎么会演的那么变态 😄。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/20/Movie-supplement-plan-Beautiful-life.md","slug":"2019/11/20/movie-supplement-plan-beautiful-life","body":"\n# 电影补档计划：美丽人生\n\n![美丽人生](https://img3.doubanio.com/view/photo/l/public/p2525638454.webp)\n\n绝对绝对绝对不能错过的电影，不愧是意大利电影，完全的戏剧化，经典里面的经典。\n\n剧情大概是犹太青年桂托邂逅女教师多拉并生下孩子约书亚，然而好景不长，法西斯将一家子关到集中营，桂托骗孩子他们要去参加一场游戏，如果约书亚能躲好就能得到一架坦克。终于等到法西斯倾覆，在通知妻子的路上桂托被纳粹射杀，约书亚一直等到大街安静才出来看到了美军的坦克并成功和母亲欢聚。\n\n虽然建议 1.5 倍速来看，但我强烈推荐这部剧，整整解释了什么叫做乐观，什么叫做担当。虽然是战争剧，但角色没有一处在演惨，只有纳粹的荒唐和桂托的美丽人生。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/21/Movie-supplement-plan-loyal-dog-Ba-Gong.md","slug":"2019/11/21/movie-supplement-plan-loyal-dog-ba-gong","body":"\n# 电影补档计划：忠犬八公\n\n跨过了泰坦尼克号、千与千寻、辛德勒名单和盗梦空间，并不是说他们不是经典，而是最近看了太多次倒不至于去补档。\n\n![Hachi](https://img9.doubanio.com/view/photo/l/public/p524964016.webp)\n\n忠犬八公的故事应该耳熟能详了，讲的是涉谷区一只秋田每天去车站等逝去的主人的故事。电影把故事改编到了美国，情节还是一条狗每天去车站接主人（😂 别误会，剧情真的很感人，可是故事真是这样的）。\n\n当然我没养过狗，但也许是人本性，对于这种无私会勾起同情心泛滥，所以看这部剧真心要备好纸巾。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/22/Wall-E.md","slug":"2019/11/22/wall-e","body":"\n# 电影补档计划： Wall·E\n\n![机器人总动员](https://img1.doubanio.com/view/photo/l/public/p2498830199.webp)\n\n豆瓣 top250 中第十一名，说实话，我对这种屌丝逆袭白富美的片毫无抵抗力。皮克斯永远能挖掘出人性中最深的渴望，以至于我并不能说出来它到底好在哪儿...\n\n地球被严重污染，人类已经搬离地球。Wall·E 是一个垃圾清理机器人，一直留在地球捡垃圾（注意一下它的开机声音是 Macbook 的启动声音）。突然有一天一个飞船降临地球，留下来一个机器人 Eve。Eve 的工作是在地球上面寻找植物，Wall·E 初见 Eve 就爱上了它，并拿一颗植物向 Eve 示爱，Eve 看到了植物便进入了保护休眠状态。\n\nWall·E 一直关照着休眠中的 Eve，直到飞船再次降临回收 Eve，Wall·E 追 Eve 一起上了飞船。原来人类一直在太空，本来打算离开地球 5 年后就可以返回，没想到地球环境一直恶化，于是人类选择一直保持观察，竟然已经有 700 年了。得知 Eve 带着植物回来，船上的机器人开始尝试阻止，因为它们收到的最后一条来自地球的消息就是永远不要回到地球。最后在人类和少数几台机器人的努力下，飞船成功返航。\n\n这个故事里面没有坏人，也没有严重的冲突，非常适合一看的小品。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/24/Movie-supplementary-plan-The-spring-of-the-cattle-class.md","slug":"2019/11/24/movie-supplementary-plan-the-spring-of-the-cattle-class","body":"\n# 电影补档计划：放牛班的春天\n\n![Les Choristes](https://img3.doubanio.com/view/photo/l/public/p1932466823.webp)\n\n这是一部可以品出来很多人生哲理的电影，我们会遇到偏见，也会被人忽略，但是不要放弃梦想，也许梦想并不在于实现什么，但是仅仅是经历过就已经是美好的了。\n\n故事讲的是代课老师克莱门德去一所男子寄宿学校任课，学校原有的管理非常严厉，孩子们也很顽皮。但是老师发现可以给孩子们组织一个合唱团。\n\n合唱团虽然没得到校长支持，却引起来董事会注意，本来顽皮的皮埃尔在老师的培养下成功挖掘出他的歌唱天赋并被推荐去音乐学校学习。\n\n学校发生火灾，断了校长的官路，校长一气之下把克莱门德开除，离开学校的时候老师收到了学生们折成纸飞机的感谢信。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/25/Movie-supplementary-program-My-Neighbor-Totoro.md","slug":"2019/11/25/movie-supplementary-program-my-neighbor-totoro","body":"\n# 电影补档计划： 龙猫\n\n![Totoro](https://img1.doubanio.com/view/photo/l/public/p537668599.webp)\n\n龙猫讲的是小梅小月两姐妹随父亲搬去乡下工作，为的是能离母亲住院的医院更近。在乡下，两姐妹遇到三只当地的妖怪，龙猫。得知母亲病重，小梅无法接受离家出走并谜路，小月借助龙猫的帮助找到小梅并一同去医院确认母亲没事。\n\n故事是很简单而且很温馨，亮点是龙猫的陀螺飞行器还有猫一样的公交车，真的，这想象力，难以置信是成年人想出来的。\n\n故事原来设定为一个女孩后来改为两个，所以海报里面只有一个人。其实坊间传闻龙猫的故事是个悲剧，对应的是日本的狭山惨案，据说当时有一个小女孩被凶手连捅 16 刀，而寻找她的姐姐备受打击，说了很多见到猫一样的怪物的话。虽然没得到吉卜力的准确回答，但是这个故事和龙猫里面很多情节十分吻合。\n\n即使是个悲伤的故事，龙猫也可以看作一种乐观的表达，毕竟不能给孩子看被捅 16 刀的童话吧？\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/26/Movie-supplement-plan-furnace.md","slug":"2019/11/26/movie-supplement-plan-furnace","body":"\n# 电影补档计划：熔炉\n\n![熔炉](https://img9.doubanio.com/view/photo/l/public/p1363250216.webp)\n\n故事发生在「雾津」这个虚拟化的城市，主角是去残障学校任教的美术老师，男主发现学校里面有校长和老师性侵学生的事情，于是带着三个学生开始检举。最后校长和性侵学生的老师三人只得到了轻微惩罚，被性侵的学生找到性侵他的老师一并卧轨而亡。\n\n熔炉基于真实事件改编，电影上映后推动了韩国“熔炉”法颁布。然而，受到轻微处罚的校长和老师最终竟没得到该有的审判，他们重回学校后又继续性侵了多名学生。\n\n但是除了黑暗面，应该能看到电影里的温暖，帮助孩子的老师，人权组织的工作人员，拍摄这部电影的人以及最后静坐推动熔炉法的韩国人民。如果有一束光，请将它保管好，因为它能在黑夜指明方向。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/27/Movie-supplement-plan-Infernal-Affairs.md","slug":"2019/11/27/movie-supplement-plan-infernal-affairs","body":"\n# 电影补档计划：无间道\n\n![無間道](https://img3.doubanio.com/view/photo/l/public/p2564556863.webp)\n\n陈永仁是被缉毒警察黄志成安排到贩毒集团的卧底，而刘建明则是贩毒集团韩琛安排到警方的卧底。一次执行任务的时候，双方都了解到对方有安插卧底，于是开始安排这两个内鬼互相挖出对方。\n\n没想到韩琛竟然安排杀死了黄志成，刘建明开始想做好人，安排杀死韩琛。陈永仁终于可以不做卧底，找刘建明要身份的时候意识到刘建明就是内鬼，并拿走了证据。\n\n陈永仁约刘建明，用新身份换证据，实际已经联系了警察。下电梯的时候，碰到了贩毒集团的另一个内鬼，陈友仁被杀，刘建明在电梯里杀死内鬼，完全洗白。\n\n无间道这个标题完全是给刘建明的定的，从从安排到警校，刘建明就希望成为一个好人，然而从升迁、调查被安排调查内鬼、黄志成被杀、认识陈永仁再到杀死另一个内鬼，刘建明始终没能成为好人。故事结局，陈永仁被证明清白安葬在黄志成旁边，刘建明依然是警察，以后还要伪装成自己希望成为的好人的样子，这难道不是他的无间道？\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/29/Movie-supplement-plan-When-happiness-comes-to-knock-on-the-door.md","slug":"2019/11/29/movie-supplement-plan-when-happiness-comes-to-knock-on-the-door","body":"\n# 电影补档计划：当幸福来敲门\n\n![The pursuit of happyness](https://img3.doubanio.com/view/photo/l/public/p1312700744.webp)\n\nChris 想通过销售医疗器械发家，没想到器械昂贵很少有人愿意购买，生意上不如意导致家庭不和，加纳决定做股票经理，但是要经过一段时间的无薪实习，而且录用率很低。实习期间 Chris 甚至一度破产，和儿子住在公共厕所里。最终 Chris 成功被录用。\n\n以前看这部片子的时候，没什么感觉。有些事物真的只有经历过才会有共感，一番努力之后，终于成功的那一刻，第一反应不是欢呼，竟是眼含热泪地往人群里面走，即使外界在嘈杂，耳边只有那段交响，去感受阳光洒在身上的感觉。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/11/30/Movie-supplementary-plan.md","slug":"2019/11/30/movie-supplementary-plan","body":"\n# 电影补档计划： 怦然心动\n\n![flipped](https://img3.doubanio.com/view/photo/l/public/p2220734673.webp)\n\n年轻的布莱斯搬到新家遇见了邻居朱莉，朱莉对布莱斯一见钟情，然而布莱斯却在处处躲着朱莉。\n\n朱莉一直喜欢校车停车点的梧桐树，朱莉每天都会爬上这棵树看远处的风景。可惜施工人员要把梧桐树砍断，朱莉坚持一天也没能保住这棵树，朱莉求布莱斯帮忙，然而布莱斯没有。朱丽的事情登上了小镇报纸，得到了布莱斯爷爷的注意。\n\n朱莉参加科学比赛，成功孵出小鸡，获得一等奖。从此朱莉开始靠鸡蛋挣钱，并且每周给布莱斯家里送鸡蛋。布莱斯爸爸觉得朱莉院子很脏，害怕鸡蛋有问题，要布莱斯拒绝朱莉的鸡蛋，布莱斯不敢直说，每次都偷偷扔掉。\n\n朱莉发现布莱斯扔掉的鸡蛋，开始讨厌布莱斯。布莱斯关于鸡蛋的事情后悔，本想道歉但是总遭到朱莉的回绝。朱莉开始修剪她的院子，布莱斯爷爷通过帮助她，得知朱莉家有一个智障的叔叔，为了帮助这个叔叔朱莉家才会贫困潦倒。\n\n得知朱莉家境的布莱斯一家，决定邀请朱莉一家吃饭，晚宴上面，布莱斯的父亲完美表现出来一个白左的偏见。布莱斯觉得可能父亲并不是生气朱莉一家而是他自己。\n\n布莱斯爱上了朱莉，学校组织篮子男孩，由女生选择心仪的男生，朱莉自知能力不够没有选择布莱斯，午餐的时候，布莱斯吻了朱莉，朱莉慌张逃跑，并拒绝见布莱斯。\n\n布莱斯最后靠在朱莉的院子种了一棵梧桐树和朱莉重新和好。\n\n很多时候我会因为一些客观原因而去评判一些人，他的穿着不够时髦，他的房子不够大，以偏见误解别人的好意。就西昂布莱斯的父亲，看到院子杂乱，先想到鸡蛋不干净，看到朱莉两个哥哥搞音乐，一定是黑钱买来的设备。没错，这些偏见大部分出自对自己无能的辩解。\n","collection":"blog","data":{"type":"post","category":"movie"}}]}