{"posts":[{"id":"2020/01/12/Opera-Dance-Dance-Notre-Dame.md","slug":"2020/01/12/opera-dance-dance-notre-dame","body":"# 歌舞剧「巴黎圣母院」\n\n因为朋友过年要出国年会，赶不上这场歌舞剧，我就直接接手了。\n\n故事就是巴黎圣母院，吉普赛人女主在举行于巴黎圣母院外的选丑盛会上跳舞，被愚人王卡西莫多、教堂的主教、护卫队队长看到。女主和护卫队长一见钟情，却不知道护卫队长已经结婚。主教明面安排敲钟人卡西莫多去抓女主，实则为了假装英雄救美把拘捕卡西莫多。\n\n女主本性善良，看到诗人因为传唱嘲讽主教的诗被抓捕，对外宣称诗人是自己的丈夫。卡西莫多被拘捕示众，女主为其送水，卡西莫多因此爱上女主。主教为了得到女主，借助女主和护卫队长幽会的机会暗杀护卫队长。受伤的护卫队长认为这是因为女主的巫术迷惑了她才导致自己受伤。主教趁机抓捕了女主和吉普赛人。\n\n主教威胁女主，女主宁死不从，依然爱着护卫队长。卡西莫多放出吉普赛人救出女主。女主只能白天躲在教堂里，晚上溜出来。主教杀死女主哥哥引她出来，并审判以绞刑。施刑当天，卡西莫多终于搞清主教阴谋，将主教推下教堂摔死。然而为时已晚，女主已死，卡西莫多自杀死在女主身边。\n\n美女与野兽的成人版，护卫队长那个渣男...\n\n全程法语，最后还要法语合唱大教堂啊，好在提前在B站上面预习了一下。","collection":"blog","data":{"type":"post","category":"life"}},{"id":"2020/05/18/Talk-about-my-experience-as-a-idle-fish-seller.md","slug":"2020/05/18/talk-about-my-experience-as-a-idle-fish-seller","body":"\n# 谈谈我当闲鱼卖家的经验\n\n闲鱼是我默认选择卖二手的平台，但是随着用户变多，这个平台开始变得混乱，骗子丛生，这里总结一下我过去一周的闲鱼卖家经验。\n\n## 避开二手贩子\n\n闲鱼上面有很多二手贩子，会以自己手头紧，买给朋友之类的原因和你砍价买到手再以高价倒卖。二手贩子本身我是不反感的，只是这种手段是以骗人实现也就太下三滥了。\n\n这些骗子，自己的主页往往会只有一种产品，比如我卖平衡车时，有一个哥们要送朋友（我很好奇是多铁的朋友才会送二手当礼物），于是看了他的主页，全部都是平衡车，我查了我的机器的同款型号定价，竟是他给我报价的三倍。\n\n再一个，往往他们会以公司名命名，比如买我移动 wifi 的人叫做「仙童科技」，我当时还好奇，仙童不是 Intel 前身么，同一个理由，送朋友。我因为知道我的移动 wifi 成色不好，所以定价 160（原价 375），这哥哥估计也是刚当骗子，没问几句就拍下来了。收到货，他发现成色确实不好，主要是机身有个标签，他想按照原价倒卖，没有标签卖不了。我开始不同意退货，他便开始信息轰炸，顺便也露馅他是骗子的本质，他告诉我他以 200 块多的价格买了很多我的同款，成色都比我的好（废话，我有那么好成色我也卖 200 多），连贴了好几个他的订单。最后烦的我实在受不了就同意了他的退款。\n\n经验就是，二道贩子肯定会以超低价买入你的产品，并高价销售。但是骗人部分实在恶心，如果有人以「送朋友」为目的买你的二手，想想，这么抠的人，最好别和他们打交道。再一个，卖货之前一定要反复询问，并在说明中写上不退不换，以后可以拿来做证据。\n\n## 与到手刀战斗到底\n\n没错，我遇见手刀了。我以 299 卖出了我的 kindle paper white 3（原价 865），这个价位在闲鱼上都买不到 2 代，很简单，就是感觉读书这种东西拿价格衡量有点不雅。万没想到，自己高尚别人小人，来了一个缠着要我拍设备的人，我是白天拍，夜里拍，就差把机子拆开了（其实我很烦，你想买，老子还不想卖呢）。终于被他买下来，到货了骂骂咧咧说有瑕疵，我让他退回来，现在 3 天了，依然不确认到货，也不退货。\n\n这种无赖确实很难对付，我至今也只能苟着。比较烦的是，以前还能看信用分来评价，现在信用分放水太多了，毫无参考价值。反正像这种自己也不太乐意卖的东西，找个下家好比古代下嫁公主。一定要确认对方会及时确认收货，并不会退货。\n\n## 不要一下子卖很多东西\n\n闲鱼号称能利用闲时卖东西，但其实你就成为了 7x24 小时客服，对方可能知道自己买的是二手，但他可能需要比一手还要好的售后服务，并希望你把他当作上帝之余还包邮。我本来打算 6 月卖完我的东西，但后来发现太浪费精力了，而且不知道闲鱼怎么关闭通知，即使写了不讨价还价依然有人来烦你。\n\n## 最好包邮\n\n咸鱼的智能邮费几乎没有准的，当它预估邮费 12 块（跨省默认 12 元，所以蒙这个数只是个高概率事件），其实运费 30 的时候我真是要吐血了。另外我还有一个笔记本支架，25 元+邮费，居然无人问津。然后我改成 45 元包邮，竟来了一堆要买的。\n\n## 最好别用闲鱼\n\n我的意思是宣传，二手产品不出圈很重要，但是闲鱼故意加了个恶心的社交功能。如果你卖个二手车，然后来个油门都找不着的人来买，买了回家出车祸说你车的问题，你真是哭死。闲鱼的社交让二手产品出圈了，就让很多想试一试的人入圈，但是因为有 7 天的收货时间，那这些圈外人就完全可以以「不是我想要的」这种理由白嫖。所以在确认买家详情之后，再通过闲鱼做第三方担保或许是个更好的方法（而且闲鱼被微信禁了，那恶心的体验，真不如抽时间自己写个网站）。\n","collection":"blog","data":{"type":"post","category":"life"}},{"id":"2020/05/20/Record-JD.com's-experience-of-being-deceived-in-the-world-of-Yuexiang-in-the-world.md","slug":"2020/05/20/record-jdcoms-experience-of-being-deceived-in-the-world-of-yuexiang-in-the-world","body":"\n# 记录下京东购买乐行天下被骗经历\n\n大概去年买的乐行天下的平衡车，用了一个月就爆胎了，当时联系售后更换，辗转多次终于一个月后修好。后来骑了几个月，突然有一天又不能开机了，急忙又联系售后，又过了几个月才修好。导致我整个一年里只是用这台机子不到 150km。前面只是质量问题，后面更尴尬。这几天我打算把它以二手卖掉，谈拢价格后我在 APP 解绑了机器，有意思的事情发生了，我的机器在蓝牙里面显示的型号竟然不是原来的 V5D 而是原价便宜一千块的 V5！现在想想不寒而栗，V5D 和 V5 外型基本一致，如果不是特意跑一下性能测试你根本不会意识到被掉包了。而如果只是代码里把这台机器改型号简直太轻松了，真是套路。\n\n现在是，虽然这台机器才跑了 150km，我根本不敢卖，我也不敢自己骑。如此看来，即使京东的服务也未必安全。由此延伸，已经 2020 年了，国内的制造业像乐行天下之流不算少数，显然他们依旧顺风顺水，售后维护等服务始终没有保障，购买产品的消费者依然没有安全感。以后还是以欧美大牌为主吧。\n","collection":"blog","data":{"type":"post","category":"life"}}]}