{"posts":[{"id":"2020/07/01/Hainan-Provincial-Museum.md","slug":"2020/07/01/hainan-provincial-museum","body":"\n# 海南省博物馆\n\n刚到海口的旅店，就发现门口的大树上面生了一颗波罗蜜。\n\n![门口的波罗蜜](./01.jpg)\n\n海南博物馆附近有一家「老姐情怀」，顺便体验一下，芒果肠粉很好吃，糟粕醋就是一种粉，个人感觉不怎么好吃。\n\n![芒果肠粉和糟粕醋](./02.jpg)\n\n海南博物馆很大，貌似是有一部分介绍海南人文饮食和产物的老馆和介绍南海以及南海历史的新馆组成，新老馆的差距很明显，新馆有空调。\n\n老馆关于沉香的制作过程很详细，那么大一棵树，最后只能做那么一点沉香我也是惊了。新馆声电做的很震撼，也很吓人。\n\n![博物馆里的民国街](./03.jpg)\n\n博物馆力荐一种清补凉，叫鸡屎藤。是使用一种鸡失藤的野菜榨汁拧成细条放到椰汁里面，在骑楼街体验了一下，没啥特别的(ˉ▽ˉ；)...\n\n![骑楼街](./04.jpg)\n\n骑楼街是海口第一的景点，是以中山路为中心的东南亚风格的骑楼群。这种建筑在厦门、汕头、广州等都很常见，也基本都叫中山路。\n\n![人民路](./05.jpg)\n\n因为住在美兰，从海口去美兰大概 7 分钟的环岛车程。票价也是 7 块。\n\n![随处可见的椰树牌椰汁的广告](./06.jpg)\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/07/03/Dark.md","slug":"2020/07/03/dark","body":"\n# 暗黑\n\n这是网飞德国的一部对标「怪奇物语」的电视剧，但是逻辑上绝对比「怪奇物语」复杂得多...也算是德国种族天赋了，能看懂这部剧...总共三季，我超级简单说一下。\n\n第一季是男主角和小伙伴在丛林玩，却遗失了一个男孩。根据自杀的亲生父亲给男主留下的线索，男主找到一个山洞。山洞里面存放着多年来核电站遗弃的核废料，而这些核废料包括阴差阳错生产出来的上帝粒子，导致时空错乱，那个山洞连通了三个时空，未来男主回来就是要毁灭掉这个时空通道，第一季结尾时空通道被毁灭，但是因为方法不对，竟开通了另一条时空隧道。\n\n第二季，男主因为新的时空隧道穿越到未来，意识到自己原来的时空即将发生世界末日。一心想回家的他却回到了核电站建成之前，着这个时空里面他认识了老年的自己，老年的男主自称亚当，欺骗男主利用时空机回到父亲自杀之前，劝服父亲不要自杀，这样就能组织世界末日。然而男主发现父亲本来没打算自杀，而自己的出现却促成这一事件发生。男主希望找回当初遗失的男孩（也就是他父亲），这样虽然他自己就不存在了，依然能拯救世界，认为没有他的世界会更好。但在本季结尾，女主被亚当杀死，世界末日依然发生，来自另一个时空的女主带走了男主。\n\n第三季，男主来到了一个没有他的世界，遇到了这个世界的 boss，夏娃。夏娃说这个世界和原来的世界大体类似，也会有世界末日，两个世界有一个链接保护，亚当的做法会让世界更混乱。男主按照夏娃的指示一步步做，但发现该发生的还是发生了，而另一方面女主被亚当抓走，亚当认为女主怀着另一个世界男主的孩子，这个孩子的力量足以毁灭掉这两个世界，让混乱结束。然而亚当实验之后发现世界并没有结束，受人提示才知道，男主和女主的两个世界本来不该存在。1986 年一个科学家因为儿子离家出走遇到意外，科学家发明时光机想回到过去阻止，不料打开了这两个世界。男女主来到这个本源世界救回科学家儿子阻止了时光机的开发，从此两个世界消失。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/07/17/20.md","slug":"2020/07/17/20","body":"\n# 20 年代初的小程序开发浅谈\n\n貌似有两周没怎么更新博客了哈，因为这几天白天就是冲浪游泳晒太阳，晚上就是写代码（啊~惬意），写了一个踏浪 App，用来查看大陆东南沿岸的冲浪浪点情况。\n\n![踏浪小程序码](./2020-07-17.jpg)\n\n## 为什么选择小程序\n\n就国内来说，如果是放到 web 这个纯开放平台上，就是 SEO 做得再好，也要被埋到广告里面；放到酷安和苹果商店...开发者要交钱的...我为爱发电还没这么强。反倒放到小程序里，因为大陆微信普及率很高，基本上说一句「你要是想看看浪情，去微信搜一下踏浪 App」就好了，再一个，微信小程序的云函数也提供了类似于 Google firebase 的前后台 sdk，也不用担心搭建服务器什么的了（毕竟我在旅游，运维的事情还是不想做）。\n\n## 包管理的尴尬\n\n小程序其实就是个优化了的浏览器，但是开发的时候不能搞到浏览器实例（window），这导致大部分 NPM 库里的 JS 都不能不加修改地在小程序中运行（哪怕是 lodash 这样的基础库），甚至是 D3 都跑！不！了！\n\n应该有很多库已经提供解决方案了，毕竟就是个编译就能解决掉的问题，可是像包管理这种东西，小程序上了这么年，一直都很烂，可见它是多不挣钱。\n\n## 云函数\n\n小程序的云函数只能在小程序编辑器里面开发，哪怕是到了腾讯云后台都看不到，这个不知道是不是鹅厂内部的问题。\n\n## SVG\n\n小程序 CSS 中支持 SVG。这点可以有，好多图我都是 figma 里面妥妥拽拽导出 SVG。但是在 Vdom 中直接插入 SVG 还是不行。\n\n## WSL\n\n另外，在 Windows 下面开发小程序是无法使用 WSL 环境的，哪怕是映射过去的文件地址也不行，但是可以把项目放在 Windows 的目录下如`/mnt/c/minprogram`开发。\n","collection":"blog","data":{"type":"post","category":"fe"}},{"id":"2020/07/19/Study-surfing-in-Houhai,-Sanya.md","slug":"2020/07/19/study-surfing-in-houhai-sanya","body":"\n# 在三亚后海学习冲浪\n\n谈到冲浪，其实是国内的一个小众运动（不得不说，国内不管什么运动对比这么大的人口基数都很小众）。大陆的东南沿海都有浪点，尤其是海南岛的东海岸更是冲浪的好地方。\n\n然而有浪点还不足，还需要有租板子的地方，毕竟那家伙一人多高，运起来很不方便。在海南西海岸，接近三亚的地方，海浪常年 1m 左右，很适合初学者学习，另外租金对于清水湾、日月湾来说更便宜。\n\n## 学习冲浪\n\n在后海学习冲浪和租浪板的价格不是很透明，基本上一个店一个价，学习冲浪一节课从 300~600，租用一天冲浪板价格也是从 100~300 不等，所以最好还是货比三家。\n\n往往第一节课的目的是能让你站在板上面，教练在后面推板子，听口令在板子上面蹲下，找到平衡后侧身站起来；第二节课开始教划水，基本上是在板子上做自由泳的动作；第三节，学习怎么抓浪，这一节课教练就不会推你了。\n\n因为家境贫寒，我就学了两节课，好在本身有滑板基础，三节课我两节也能搞定。\n\n另外，感觉课上教的方法虽然普及度很高，但是真的很累啊，首先抓浪起跑，跳到板子上面还要双手划拉，冲完了自己还要推板子回到海里面...其实还有个比较简单的方法，就是走到海水大概没过大腿的位置上，看到浪之后直接起跑，跳到板子上面，不划水直接站起来，这个方法真的要轻松很多。\n\n## 谈谈感受\n\n冲浪真的是一个很上瘾的运动，哪怕无数次试验只有一次成功，那种成就感迸发的肾上腺素就足以让人满足。学习冲浪其实要先查看浪报的，大部分人会上[magicseaweed.com](https://magicseaweed.com/)查看最近是否有好一些的浪，一般将近 1m 的浪对初学者就很合适。\n\n为了方便大家看浪报，我开发了一个踏浪 App 的小程序，直接抓的 magicseaweed 的数据，7 天浪情预报的功能我以后再上。\n\n![踏浪小程序码](../17/2020-07-17.jpg)\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/07/24/2D-svg-3D.md","slug":"2020/07/24/2d-svg-3d","body":"\n# 快速把 2D 的 svg 生成为 3D\n\n[vectary](www.vectary.com)可以把 2D 的 SVG 渲染成 3D，但是免费版导出的图片是有水印的，导出模型的功能也是收费的（但是我发现可以从 network 中扒`*.obj`文件，是，我知道这很 low🤣）\n","collection":"blog","data":{"type":"post","category":"fe","tag":["svg"],"series":{"slug":"tools","name":"利器"}}},{"id":"2020/07/25/The-Changsha-Museum-is-still-worth-going.md","slug":"2020/07/25/the-changsha-museum-is-still-worth-going","body":"\n# 长沙市博物馆还是值得去的\n\n之前我去[湖南省博物馆](/travel/2019/04/07/湘江没有百舸争流倒有汉墓一座.html)看过马王堆女尸，本来及已经很震撼了，但是长沙其实还有一座值得去的博物馆，就是长沙博物馆。\n\n考虑到古时候的长沙是比整个湖南还要大一点的地方，而且长沙是一个历史可以追溯到战国时期，它在唐之前的历史是可以再单独布置一套博物馆用于展示的。长沙博物馆距离北辰三角洲地铁站还有大概一公里的距离。\n\n## 看什么\n\n长沙古时是楚国的属地，楚国的青铜器是一绝，确切的说，我国南方的青铜器都比北方要精致。就我个人看来，应该是北方产铜量比不上南方；铸造技术传到南方的时间比较晚，已经成熟；再加上北方更早进入铸铁阶段，技术更新太快导致艺术上就没那么高追求了。\n\n![青铜剑](./2020-07-25-0.jpg)\n\n![青铜铙](./2020-07-25-2.jpg)\n\n另一个，因为长沙国作为封国的时间比较久（到了东汉时期依然存在），大量的墓葬都按照汉国王室墓制处理而又没有过度盗掘，保留了很多诸如黄肠题凑、金缕玉衣的墓葬制度，可以一饱眼福。\n\n![黄肠题凑](./2020-07-25-3.jpg)\n\n再一个，在近代馆里面看见了「万国图志」的原本。\n\n![万国图志](./2020-07-25-6.jpg)\n\n## 特展：粟特人在大唐\n\n这是洛阳博物馆在长沙的特展，就是一堆唐三彩，里面的一个兽面纹还挺像建国的。\n\n![唐三彩](./2020-07-25-5.jpg)\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/07/26/Wanjiali-can-really-be-a-hard-core-endorsement-of-Changsha.md","slug":"2020/07/26/wanjiali-can-really-be-a-hard-core-endorsement-of-changsha","body":"\n# 万家丽真是可以作为长沙的硬核代言了\n\n长沙有个地铁站叫做万家丽广场，是长沙当地的一个大老板开发的，号称「亚洲第一大单体建筑」的万家丽国际购物中心。所谓「硬核」的地方，是它的 11 层，是一个巨大的空中花园，是一个东西方名人雕塑汇聚的地方。\n\n![弥勒佛和看着希腊裸女笑出了花](./2020-07-26.jpg)\n\n空中花园里，弥勒佛看着希腊裸女笑出了花，毛爷爷的笑容也是异常尴尬，不太明白为什么要在四个方向上面放弥勒佛、毛主席、财神和孔子四尊金像，在他们对面还要摆一个希腊裸女。\n\n花园四周分别是湖南名人展览、万家丽介绍、历代帝王介绍以及名人蜡像馆，这些全部免费！而且历代帝王的每一代都有画像，而且不重样！是不是比人教版的教材都要良心！\n\n没完，乘电梯到 28 楼，还有四个巨大的停机坪，四角又放着四个金塔，金塔上面浮雕着中华传统故事，远远地俯瞰长沙的 CBD，简直不能再良心了。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/07/27/7.md","slug":"2020/07/27/7","body":"\n# 抢了一张光猪圈健身的 7 天健身券\n\n我在长沙这几天，除了是因为大连成为疫区回不去，还有一个就是我在大众点评上面抢到了光猪圈的 7 天健身券。\n\nAPP 注册账号后，会给我一个手环，用于开箱子和打开器械区的设备，所有的运动内容都会被记录到 APP 中。个人并不清楚这些设备的成本如何，不过创新还是可以赞许的。\n\n![器械区](./2020-07-27.jpg)\n","collection":"blog","data":{"type":"post","category":"gym"}},{"id":"2020/07/28/In-addition-to-the-tall,-the-Guizhou-Museum-should-consider-some-connotative-things.md","slug":"2020/07/28/in-addition-to-the-tall-the-guizhou-museum-should-consider-some-connotative-things","body":"\n# 贵州博物馆除了高大上应该考虑一些内涵上的东西\n\n在贵阳坐地铁就可以到位于城郊的会展中心和博物馆，但是稍稍吐槽一下，贵阳的地铁并不支持第三方扫码支付，官方的扫码 APP 还必须绑定贵阳银行以进行支付，好在乘坐地铁的人不多，可以购买单程票。\n\n走了大概一公里的上坡路就能达到贵州省博物馆了，是一个彩色的不规则多边形建筑物，对应的是「多彩贵州」的广告词。参观博物馆需要提前预约，不过就是到现场再预约也不迟。\n\n贵州少数民族多，一进博物馆就是各种少数民族的介绍，包括服饰、产品、生存现状等。但是很快就意识到一个问题，这些介绍不是按照少数民族划分而是按照类别划分，举例说，当介绍服饰时，要分别介绍几个民族的服饰，而当饮食时又会重新分民族介绍，个人感觉整天下来，并不能记下来任何一个民族。\n\n![苗族节庆的巫师服饰](./2020-07-28-1.jpg)\n\n博物馆顶楼是远古化石和贵州历史，贵州历史简单带过夜郎国和土司历史就没了...个人感觉对于贵州还可以介绍一下它的地貌，比如各种形制的喀斯特地貌、再一个，少数民族的特色说的也不是很清楚，空荡荡的博物馆，只有那么多东西，哎。\n\n![博物馆对面会展中心正竖着大大的中指](./2020-07-28-0.jpg)\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/07/28/The-dream-of-red-pepper-and-the-reality-itself-is-very-chaotic.md","slug":"2020/07/28/the-dream-of-red-pepper-and-the-reality-itself-is-very-chaotic","body":"\n# 红辣椒，梦与现实本身就很混乱\n\n一研究院研究出能进入梦境的装置，DC Mini，该设备可以用来治疗精神类疾病。女科学家在院长指示下帮助警长治疗，女科学家在梦境中化名「红辣椒」。然而 DC Mini 还在测试阶段，却被盗走，盗走 DC Mini 的人在使用它操纵别人的梦。\n\n创造 DC Mini 的科学家想找出幕后黑手戴上 DC Mini 不料被人操控，女科学家为了救出他化身红辣椒去救却发现自己被暗恋自己的科学家禁锢在梦里。无数次醒来后红辣椒发现大 boss 是研究所的投资人并吸走了投资人的梦。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2020/07/29/Qianlingshan-Park-watch-monkeys.md","slug":"2020/07/29/qianlingshan-park-watch-monkeys","body":"\n# 黔灵山公园看猴子\n\n按照地图指示坐地铁就能到黔灵山东门了，但是如果是要看猴子的话，一般都是从南门弘福寺进入（我真的是翻了整整一座山才到的）。\n\n![弘福寺的猴子](./2020-07-29.jpg)\n\n基本上在黔灵山是看不见猴子的，需要走到弘福寺附近，显然连猴子都知道去寺庙的人带的东西肯定更好吃。\n\n因为疫情，黔灵山门票免费，在山脚下有一个叫做麒麟洞的天然溶洞，小是小了点，但毕竟免费不去白不去。\n\n弘福寺是要收香火费的，所以我就在门口逛了逛，整个黔灵山其实也不大，大概两到三个小时就逛完了。\n\n## 贵阳附近的小吃\n\n逛完黔灵山后我又到附近的健身房做了一个小时的 CrossFit，全部结束我已经饥肠辘辘了。好在贵阳不大，就算是住在城郊的我离市中心也不过 10km。\n\n在贵阳谈及最多的是肠旺面，就是猪大肠、猪肝做的碱面。另外就是丝娃娃，大概可以理解为京酱肉丝没有肉丝...\n\n在中山西路有一个地下的小吃街，能吃到各种街头小吃，当然基本上可以理解为高油碳水，不过是真好吃啊~附近还有一家安顺小舒冰粉冰浆，点一份黄瓜牛奶冰浆解一解腻。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/07/31/A-scenic-spot-in-Yelanggu's-imagination.md","slug":"2020/07/31/a-scenic-spot-in-yelanggus-imagination","body":"\n# 夜郎谷一个臆想出来的景区\n\n夜郎国是大概西汉时期位于贵州的小国，史记有记载夜郎自大的典故，贵州省博其实就一个展牌有介绍夜郎国，估计除了史记也没什么实际的考古发现来证明它。不过没关系，一个美术家，宋培伦通过二十年直接在贵阳大学城做了个假的夜郎国遗址。\n\n![夜郎谷](./2020-07-31-0.jpg)\n\n前往夜郎谷并不容易，整个贵阳大学城在贵阳的最南端，是个完全鸟不拉屎的地方，因为重要的交通枢纽都在北方，前往夜郎谷至少要转两班公交大概两个小时车程才能到。\n\n尽管旅程很长，但是夜郎谷绝对值得一看。话说毕竟是艺术家，相比于长沙的万家丽，这个夜郎谷虽说没什么依据，审美上是完全超群的。迎合疫情，柱状人面都带上了口罩。话说整个景区有一种隐约的性隐喻。穿过一群人面石柱，藏着一个悬崖，崖面有一个裂缝，裂缝里面是一个溶洞可以走到山坡顶。\n\n![合个影也是很开心的体验](./2020-07-31.jpg)\n\n个人感觉，如果在贵阳，这个景区是绝对值得去的，何况现在还是免费的~\n","collection":"blog","data":{"type":"post","category":"travel"}}]}