{"posts":[{"id":"2020/11/01/There-is-no-heating.md","slug":"2020/11/01/there-is-no-heating","body":"\n# 没有暖气的敦煌\n\n原计划从敦煌出发到兰州中转，这样还能在兰州享受一次免费住宿。然而失策在敦煌老城区还在改造，老城区里面还没有暖气...\n\n记得 2016 年去过一次敦煌，已经把鸣沙山和月牙泉逛了，不过这次敦煌之行并不是没有收获，比如上次没有吃到的正宗的驴肉黄面（上次因为封城只吃到了莫高窟门口的那家），这次吃了一次正宗的顺张驴肉黄面，呃，几乎是一样的口感，就是贵一点...\n\n另外，看到了一截敦煌的老城墙，在沙洲乐园里面。敦煌相比嘉峪关虽然没那么城市化，但是沙洲乐园里面的情景还是比嘉峪关更有人气。\n\n再一个就是 4 年前看到敦煌博物馆前言时就好奇它的中日英写的都不一样（不确定韩语的情况，因为看不懂），比如中文提到了张骞，当时以为是处于改动中，这么多年来看，就不是在改动...\n\n在敦煌必须喝的是杏皮茶，这次发现已经可以在敦煌喝甜胚子奶茶了，大赞。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/11/11/Never-found-that-Shenyang-is-so-prosperous.md","slug":"2020/11/11/never-found-that-shenyang-is-so-prosperous","body":"\n# 从未发现沈阳有这么繁华\n\n发现随心飞从兰州出发能直达沈阳，直接买了票，一来能在沈阳休息一阵子，见一见朋友，二来可以看看完全重建好的辽博。\n\n下了飞机，一如既往的没有地铁，只能大巴到市内，到了市府广场，才发现短短 5 年沈阳发生了很大变化，高楼大厦也多出很多。据朋友说，中街过去半年都在装修，这次我看到中街颇有一点小春熙路的感觉。\n\n回到工大的老校区，现在已经是一片工地，只留下一个综合楼。没想到学校门口的六毛串吧还依然生意兴隆。\n\n在沈阳住了几天 lazyBee 青旅，这家青旅的体验异常的好，每天都有诸如英语角，看电影的活动。附近是沈阳的彩电塔夜市，能吃吃炸串鸡架什么的。安利一个烤冷面卷臭豆腐，很有趣的吃法。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/11/18/20.md","slug":"2020/11/18/20","body":"\n# 在北海体验 20 度的冬天\n\n逛完新疆、甘肃和沈阳，我意识到我确实需要去一次南方体验一下温暖的感觉。正好从沈阳随心飞到哈尔滨可以从北海中转，而且起降的时间刚刚好，既不是清晨也不是半夜，于是我就买了机票。\n\n从沈阳到北海大概有 4 小时飞行时间，飞机上基本上都是东北的大爷大妈，仿佛进入了东北过冬团的现场。\n\n刚抵达北海，正好是阴天，看天气预报表示南面的三亚正在刮台风，可能会有点影响。问了青旅的老板表示刚刚下雨，果然过了几天白天的温度马上回升到 28 度左右了。\n\n北海的几个景点分别在北海的三个位置上，好在这个城市也不大，买几张单车券基本上半小时都可以抵达这个城市的任何地方。\n\n## 北海老街\n\n北海老街位于北海的北面，是一个沿着巷子口看就能看到海岸的南方骑楼群。作为一个北方海边出生的人，还是比较羡慕南方这种紧沿着海岸线的建筑群的。只不过这个海水真心不敢恭维，北海的旅游还在起步阶段，所以海岸的污水被各种灌入大海中，海水看起来很脏。\n\n老街主要卖的小吃是墨鱼丸子和虾饼，因为都是油炸食品很快就会腻，逛了半天也没看见比较解腻的食品...鉴于比较便宜，还是推荐的。\n\n## 北海银滩\n\n银滩在北海的南面，是一片巨大的天然沙滩，不愧是天下第一滩。沙滩就算最窄的地方也有几百米宽，长度看起来也要几十公里的样子，在海滩上看城市就好像在看沙漠里的绿洲。海水漫过的沙滩就好像一面镜子，也不知道有没有人来这儿拍天空之境。\n\n因为是天然沙滩，踩起来比人工沙滩结实得多，甚至觉得有点像水泥。沙滩有很多小螃蟹，螃蟹会咀嚼沙滩上的沙子并卷成各种小球。涨潮的时候会有很多寄居蟹背着贝壳跑上岸钻到沙子里面，退潮的时候沙滩上会留下沙蚕吐出来得沙管。我看到的就只有小鱼小虾小蟹，不过岸上确实有人能赶海挖到好多好吃的。\n\n另外，岸上还有好多人拿金属探测器各种扫描，不知道是不是之前有人在沙滩上埋了什么。\n\n北海银滩总体来说还是推荐去的，不过游泳的话，就是伸手不见五指，这也使得我不打算去涠洲岛，毕竟光门票和路费也要 300（300 够我飞六个城市了）。\n\n## 侨港街\n\n银滩附近有一个侨港，大多是越南回国得侨民，\n\n## 冠头岭\n\n冠头岭在北海的西面\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/11/24/Beautiful-Harbin.md","slug":"2020/11/24/beautiful-harbin","body":"\n# 美丽的哈尔滨\n\n从北海飞到哈尔滨，惊喜的是进入华北之后就开始万里无云。在夜里每经过一个方形的城市，就会好奇下面是个什么样的城市，好在可以收到 GPS 数据。\n\n哈尔滨的第一个感觉就是，身上的温度瞬间被吸走，当时的温度是零下 13 度。从哈尔滨太平机场出发有到中央大街的客车，我也不知道为什么我对哈尔滨的要求这么不高，到达沈阳的时候还希望它能有铁路交通。大概一个小时的客运，我终于抵达中央大街，时间是十点左右，不过大街上已经没有多少人了。\n\n第一天的时间我都花在买衣服上面，虽然照前同事推荐的，在透笼小商品城买了个帽子，但是大部分的东西我还是在迪卡侬搞到的。在哈尔滨，像是迪卡侬家乐福这种大型超市离中央大街还是比较远的，而且在零下十几度的地方等公交绝对是一个糟糕的体验，所以最好是一下子都买全比较好。\n\n黑龙江省博物馆在哈尔滨火车站的对面，相比于各种省级博物馆，这个博物馆算是小的了，据说它会搬到哈尔滨大剧院那里，是一个很遥远很遥远的地方。虽然黑龙江有很多恐龙的资料以及渤海国的内容，但显然博物馆的介绍还是比不上俄侨的部分，非常推荐了解一下这部分，包括很多俄罗斯俄式建筑，博物馆还特别把它们做成水晶球，显得分外浪漫。\n\n然后就是俄餐，中央大街的俄餐很多，美团上面找了一家，就是烤土豆格瓦斯大拌菜套餐，也没什么特殊的，就是比较胀肚。\n\n晚上走到斯大林公园，旁边就是冻上的松花江。哈尔滨的晚上来的特别早，大概 4 点钟天就黑了，所以想去缆车那边看夕阳要赶早。其实这么美的城市赶上这么短暂的白天真是可惜。\n","collection":"blog","data":{"type":"post","category":"travel"}}]}