{"posts":[{"id":"2020/12/01/Beibei-punch-card.md","slug":"2020/12/01/beibei-punch-card","body":"\n# 北陲打卡之行\n\n漠河作为随心飞能够到达的地方，我的目标很简单，就是打卡。所以原计划是飞到了漠河县城，然后坐每天两趟 25 元的北极村大巴再住两天就回。不过巧的是，碰到了再新疆时候认识的驴友，所以我们打算包车转一圈。\n\n## 漠河县城\n\n漠河县城原名西林吉，这个名字是慈禧逃亡时起的。据说当时慈禧逃到林子西侧，正好碰到大屠杀，整个东面都被屠杀掉，而西侧安然无恙，因此起名「西林吉」。而现在的漠河县城则因为漠河火车站而得名，有趣的是，后面旅程碰到的很多地方都会和慈禧有关，慈禧每逃到一个地方休息时都叫做「站」，所以后面的地名都以「二十站」「二十八站」这样起名。\n\n漠河县城并不大，也就方圆五公里的样子。县城中间有一个鼎盛商场，算是最繁华的地方。距离商场几百米处，有一个北极星广场，是当地的打卡处，可以登高远眺整个城市。\n\n漠河曾经发生过重大火灾，在鼎盛广场东侧有一个林子，是当时火灾唯一没被烧到的林子，和清真寺、茅厕和坟地一起被称为当地的「四不烧」。在林子一侧是火灾纪念馆，虽然建筑很漂亮，但建议最后去，因为内部还原的火灾场景十分触目惊心。\n\n## 北红村\n\n中国的最北点位于北红村附近，如果不包车的话，去北红村的客车是每个双号日的下午两点。北红村是一个很小的俄罗斯族村子，如果并不是对中国最北的石碑感兴趣的话，其实可以不看。\n\n## 北极村\n\n北极村是漠河最早开发的旅游村，里面设施相对北红村全面的多，甚至还有学校、邮局等。\n\n到达北极村的时候，当时温度已经零下 20 度了，周围的雪雕已经纷纷的建起来了。相比北红村，北极村非常值得去，当然物价比北红村要贵。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/12/03/I-learned-to-ski.md","slug":"2020/12/03/i-learned-to-ski","body":"\n# 在哈尔滨学会了单板滑雪\n\n从漠河回到哈尔滨，果然就没那么冷了，于是我打算再滑一次雪。在青旅里面普遍都是要去亚布力，个人觉得亚布力太竞技性（还贵），如果是让我去，更加喜欢伏尔加庄园，从城堡上面滑雪还真是神奇的体验。\n\n伏尔加庄园的官方网站已经无人维护了，查了一下飞猪还有账号。原来 12 月 16 号雪场才能开放，我又不能在哈尔滨等到 16 号。其实哈尔滨周边还有很多雪场，在 GoSki 上面还搜到了名都滑雪，公众号上面显示的「准备开放」。于是就像我经常做的，马上去微博看一下，果然有人在滑，询问无果，打算亲自去看看。\n\n从哈尔滨火车站到名都滑雪场，可以坐 338 路直达，到哈尔滨职业技术学院下车，疫情期间要绕过这个学校，在学校后身就是滑雪场了。\n\n雪票很便宜 59 元，另外十元的柜子。目前中级雪道还在铺设中，只可以滑初级雪道。反正我也不会滑单板，就在初级雪道上面练习好了。就按照 B 站上面教的，首先推雪，然后练习单刃，最后再双刃交替，两个小时下来基本就会了。\n\n哈尔滨的日落很快，基本四点就结束了，考虑到如果继续滑下去会很冷，就短暂告别了。本来回去的时候打算乘一下哈尔滨的地铁，但正好碰到 338，地铁也就没坐成。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/12/06/There-is-really-nothing-to-play-in-Changchun.md","slug":"2020/12/06/there-is-really-nothing-to-play-in-changchun","body":"\n# 长春还真没什么玩的\n\n查了一下，哈尔滨到长春的火车也就43元，所以想去长春看看，来长春之前，路上的驴友基本上都是不推荐去。或者说可以路过长春去长白山。\n\n查了下，去长白山还真便宜，70块钱大巴直达，只不过住宿来看是更倾向于家庭游而不是个人旅行。\n\n再看一眼长春附近的滑雪，除了人比较多的北大湖还有天定山和莲花山。只不过大巴都要7点钟出发，出发地周围还没什么住宿（wtf？），仔细考虑之后还是去沈阳滑好了。\n\n## 吉林省博物院\n\n吉林省博离市区很远要坐城轨到长影世纪城，然后再转车或者徒步到达，周边也没什么共享单车。\n\n博物院内部是东北各民族发展，辽博主要看契丹，黑龙江博物馆看馍鞨，吉博就看高句丽了，不过由于高句丽后来迁都到平壤，但展品不是很多，大部分也是复制品。\n\n吉博虽然是新馆，但是展馆比较乱，也没有什么导引，冬天3点就关了，所以感觉也不是需要特别去看。\n\n## 这有山\n\n长春电影厂旧址在这有山商场对面，门票还是比较贵的，要70元。咬咬牙始终还是没去，这有山商场是一个网红商场。商场内被做成山间小路的样子，有一丝洪崖洞的感觉。","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/12/09/After-skiing,-the-Snail-House-has-finished-watching-the-blade-of-ghosts.md","slug":"2020/12/09/after-skiing-the-snail-house-has-finished-watching-the-blade-of-ghosts","body":"\n# 滑雪之后，蜗居看完鬼灭之刃\n\n本来打算在长春滑雪，但是长春的一日游都要一大早 7 点起床，而沈阳 9 点即可。和客服约好在电报大厦楼下见面，好巧不巧，电报大厦大到一个街区的样子，车停在南面，我在北面，联络了好久才到。\n\n怪坡滑雪场有一个初级道，中级道单双板分开两道，高级道和障碍道还在铺设。说说价钱吧，一日游 84，包括来往车费、滑板、雪靴。上中级道需要花费 30 租一个头盔，柜子 10 元，进雪场需要办卡，走的时候再退。现在滑单板的人真多，一眼望过去双板寥寥无几。\n\n从 10 点一直滑到下午 2 点半，回到市区已经是筋疲力竭，导致第二天基本上是在青旅蹲了一天，把鬼灭之刃的动画和漫画都看完了，期待以后的动画情节。\n","collection":"blog","data":{"type":"post","category":"tv"}},{"id":"2020/12/15/CrossFit.md","slug":"2020/12/15/crossfit","body":"\n# 牛首山、鸡鸣寺和南京的 CrossFit\n\n> 感谢南京同学赠送给我的南京两天白吃白喝之旅~\n\n在南京的前两天基本上就是吃吃吃睡睡睡玩玩玩，新街口的网红鸡腿、网红拌面、网红鸡蛋灌饼、像元宵一样的汤圆。\n\n## 牛首山\n\n赶上南京初雪，从夫子庙坐地铁前往城郊的牛首山，薄薄的白雪压在一片秋景之下，给南京城增加了几分肃穆。\n\n牛首山本是南京郊区的一座形似牛头的山，只不过建国初期开采铁矿被挖去了一部分，08 年新建的万佛殿则依照山形将原来的山顶补回。矿坑内的地宫供养的是原来大报恩寺的佛头舍利，万佛殿里面金碧辉煌，地宫更是只能穿鞋套进入，绝对不虚一行。\n\n据称佛祖涅槃之前曾说自己的身体会变成多个舍利可以给后人供奉，后来本是独立的佛头舍利被散落在西域各国，后来在宋朝被进贡埋藏到建初寺下，后来明朝朱棣建造大报恩寺，供养玄奘尸骨。后来大报恩寺在太平天国运动中被毁，在日本侵略时期，日军因为在此地挖到了玄奘尸骨则没有继续挖掘。虽然后面人们说这个佛骨如何吉祥，参考南京近千年的历史，感觉是大相径庭。不过文物上面的确有很多很值得一说的故事。\n\n## 鸡鸣寺\n\n金鸡寺在玄武湖南边，作为南朝第一寺，可游览的地方有点少...10 元一张门票并送三根香可敬。寺中的药师佛塔 1990 年落成，并用于替代当时并没建成的雷峰塔来拍摄「新白娘子传奇」。\n\n## 六朝 CrossFit\n\n今年多了一个爱好，就是练 CrossFit，一般我会参考邢奇辉的 Youtube 视频，他就是在六朝 CrossFit 的应天店，这次正好看见玄武店在新店促销，定了三次票合计 89。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/12/18/Don't-rent-the-interpreter-at-the-Zhenjiang-Museum.md","slug":"2020/12/18/dont-rent-the-interpreter-at-the-zhenjiang-museum","body":"\n# 在镇江博物馆就不要租讲解器了\n\n因为疫情想要绕开上海回家，选择从沈阳飞到南京，再从南京到扬州飞回大连。顺便还可以再逛一逛这几个城市。\n\n镇江市相比于南京要清冷很多，尤其是在这个江南的冬季夜晚，大街上空空寥寥，周边的小店也算是门可罗雀，这个小城给我的第一印象就好像是南京的睡都。毕竟南京到镇江的动车还不到半个小时。\n\n我住在八佰伴商场附近，去镇江博物馆大概有 2 公里左右。因为天气冷，干脆走过去好了。离开八佰伴，基本上就没有多少高楼了，完全进入一种江南小城的感觉。\n\n镇江博物馆是老英国领事馆的一部分，可以免费进入，门口有讲解器可以租用，但是藏品也不多，也没与大量有关镇江历史可听，所以个人觉得没必要去租。一楼是青铜器馆瓷器馆，二楼是书画馆和工艺品馆，另外二楼一半都是玻璃穹顶，颇有哈利波特斯普劳特教授的花圃的感觉。\n\n从博物馆出来，是西津渡景区。这是原来三国时期就有的渡口，现在复建为景区，基本上和很多仿古景区差不多，所以也没有多少稀奇。有一些道路会故意挖出来明清唐到更早的砖路，就像很多多手房都覆盖了多层地板一样，也难怪去这个渡口要爬楼梯了。\n\n这大概就是镇江了，明天我就要坐客运去扬州看看。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/12/20/Yangzhou,-worthy-of-his-city.md","slug":"2020/12/20/yangzhou-worthy-of-his-city","body":"\n# 扬州，不愧是他的城市\n\n> 本来是为了避开浦东疫情绕道南京从扬州回大连，但是既然作为目的地的大连也疫情爆发了，也只好硬着头皮去了。\n\n从镇江到扬州，可以直接乘坐客运前往，相比于城际来说，既便宜也不绕道。镇江和扬州分布于长江南北两岸，向阳的扬州虽然温度一样但体感上绝对比镇江暖和。\n\n## 扬州双博物馆\n\n从客运站乘坐公交到达扬州双博物馆，所谓双博物馆，是一个扬州博物馆和雕版印刷博物馆，扬州博物馆内容绝对比镇江博物馆详细。个人感觉雕版博物馆更像是扬州博物馆的一个展厅，不过是因为扬州目前还存在雕版印刷而存在。更早的时期扬州曾是个沿海城市，北面是黄河出海口、南面是长江出海口，可算是个升级版的上海，但是因为大自然的鬼斧神工，愣是给这个沿海城市填成了内陆城市。\n\n## 东关街\n\n东关街是几乎每个古城都有的小吃一条街，里面包括扬州比较著名的园林。毕竟曾经是个沿海城市，产盐为主业，而盐商又无法从官，多出来的钱只好用来建园子。这和苏杭的园林区别比较大，毕竟那些大部分都是退休养老的园子。比如著名的个园就在东关街，不过我也只是在门口看看，也没有进去。\n\n## 瘦西湖\n\n瘦西湖一定要去！来扬州之前，曾有人不推荐我去，适逢冬季，瘦西湖的风景的确不如往日。但不愧是扬州的代表性景区，刚进景区看到的就是青砖白瓦和杨柳依依，不由得放慢了脚步，这或许就是古代扬州土豪的闲情雅旭吧。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2020/12/24/Haproxy-nginx-SS.md","slug":"2020/12/24/haproxy-nginx-ss","body":"\n# Haproxy 和 nginx 做 SS 中继\n\n隔离在家最痛苦的莫过于家中网络连接 SS 总是断线，参考网上的[方案](https://sjq597.github.io/2018/05/22/ShadowSocks-Haproxy%E4%B8%AD%E7%BB%A7/)，使用国内云服务作为 TCP 转发即可。\n\n## Haproxy 配置\n\n```\nglobal\n    ulimit-n  51200\n\ndefaults\n    log     global\n    mode    tcp\n    option  dontlognull\n    timeout connect 5000\n    timeout client  50000\n    timeout server  50000\n\nfrontend ss-in\n    bind *: 国内云服务的端口\n    default_backend ss-out\n\nbackend ss-out\n    server sserver_name SS的IP:SS的端口 maxconn 20480\n\n```\n\nhaproxy 可以运行在 docker 容器里\n\n```\ndocker pull haproxy:latest\nsudo docker run -d --name haproxy_6 -v 配置文件目录:/usr/local/etc/haproxy/haproxy.cfg --restart=always -p 云服务端口:配置中的端口 haproxy:latest\n```\n\n接下来在国内的云服务安全组里面打开上面的端口即可，实测大部分应用可用，但是推特上面不能显示图片，google play 也没法更新，vmess 协议目前还不支持，这些就看我以后跟进了。\n\n## nginx 配置\n\n相比之下 nginx 更加简单，在 nginx.conf 里面增加如下内容。\n\n```\nstream {\n    server {\n        listen 云服务端口;\n        proxy_pass SS的IP:SS的端口;\n    }\n}\n```\n\n这样连 Vmess 都可以使用了，不过混淆加密功能还不好使，唉，涉及到 TLS 我就跪了。\n\n测试之后 PC 端都没问题，但是移动端配置都用不了。\n","collection":"blog","data":{"type":"post","category":"tech","tag":["haproxy","shadowsocks"]}},{"id":"2020/12/27/Google.md","slug":"2020/12/27/google","body":"\n# 如何做代码评审\n\n这是[谷歌的代码评审标准笔记](https://google.github.io/eng-practices/review/reviewer/)。\n\n## 代码评审标准\n\n代码评审是为了提高整体代码进步而设定的。\n\n首先，要确保代码以后是可以进一步改进的。代码的评审人员也应该是代码的持有者。\n\n**_总体上，评审者应该允许能够提高总体代码健壮性的代码，即使它不够完美。_**\n\n当然也有限制，如果代码增加的特性不是整个系统想要的，尽管它多么好也要拒绝掉。\n\n评审者可以任意留下评论，如果不是很重要，请增加「Nit:」作为前缀。\n\n### 指导\n\n代码评审对开发人员了解一个语言、框架都有所帮助，留下评论是可以的，但是一定记住要留下「Nit:」作为不强制性改动的标记。\n\n### 原则\n\n- 技术事实，有数据否决的建议和个人配置。\n- 代码风格，代码风格应该和原有代码保持一致，如果源代码没有代码风格则允许提交。\n- 没有纯粹的代码风格，基本上就是个人设定。\n- 评审者应该要求提交代码和现有代码保持一致，这样不会使现有代码健康更加恶化。\n\n### 处理冲突\n\n在冲突上，评审员和代码作者应该达成一致，做好要有一次面对面会议或者线上会议。如果不能达成一致，一定记得升级到更高层次人员处理。\n\n## 应该看什么\n\n### 设计\n\n- 代码和原有代码配合如何？\n- 这段改动是基于代码层面还是库层面？\n- 和系统的其他部分结合的如何？\n- 现在是增加这个功能的最好时机吗？\n\n### 功能\n\n这段代码是否符合作者用意？是否对用户有利？此处「用户」同时指端用户和开发者。\n\n有时，如 UI 改动需要评审查看 demo。\n\n### 复杂度\n\n代码的复杂度即代码是否可以被迅速理解，其它工程师是否可以修改这一段代码。\n\n一个特别案例：过度开发。\n\n### 测试\n\n要求单元测试，或适当的端对端测试。除非紧急任务，测试必须伴随代码一并提交。\n\n确保测试正确，明确和有效。\n\n### 命名\n\n确保命名简单易懂。\n\n### 注释\n\n注释应该解释这段代码为什么存在，而不是它做什么。\n\n### 代码风格\n\n谷歌有对大部分语言提供[风格指导](http://google.github.io/styleguide/)。\n\n| 生词         |            |\n| ------------ | ---------- |\n| disincentive | 妨碍活动的 |\n| mandatory    | 强制性的   |\n| overrule     | 否决       |\n| underlying   | 基本的     |\n| consensus    | 一致同意   |\n| interaction  | 配合       |\n| appropriate  | 适当的     |\n| sensible     | 明确的     |\n","collection":"blog","data":{"type":"post","category":"tech","tag":["code-review","translate"]}}]}