{"posts":[{"id":"2023/01/01/2022-Retrospective-Immersed-VR.md","slug":"2023/01/01/2022-retrospective-immersed-vr","body":"\n# 2022 Retrospective\n\nOne hell of a year. This year, the government finally gave up its 2-COVID policy. Russia is invading Ukraine, and I just realized most Chinese are not standing on the justice side. Idiots were running the country, and they will run for the coming decades without the help of elites. Businessmen all over the world are rushing out of the country, fearing that the 0-COVID will happen again. So the future does not look promising. It feels good to discern the situation. I have to make the right choice at the right moment.\n\nThis year I took the postgraduate entrance examination for the second time, and I did pretty well. This September, I decided to cut down some entertainment time and focused on studying. However, the news still brought anxiety. They were always cheerful, that the government protected the people from the virus again, and trade hit another high this year. What did I know? I know that I was forced to stay at home many times to end the spreading of the virus, and eventually got ill and the end of this year, right before the examination.\n\nBefore opening, my neighborhood was under lockdown. Max whites took turns working overnights to guard my block, in case of someone what to get out. That was some cold snowy nights. I watched through the window to know how long they can last. The day they decided to open, a sunny day came. Then everyone got infected making all the work those max whites had done in vain.\n\nThis year a lot of hypocrites showed themselves who they are. These self-claimed experts discuss military, political, medical treatment, and sports. Beaten by reality, it turns out that the experts are so ignorant, selfish, and arrogant. The media shows fake news about the Bucha massacre and shouted about Nancy Pelosi going to Taiwan. Gladly, A local populist named \"Sailei 3min\" got banned, who used to spread conspiracy theories about the west. This time he copied a video with a frame of a Chinese untalkable 64 incident. Self-thinking is becoming a topic of the year, sadly, many people still don't have it.\n\nDuolingo is my favorite APP. But it was banned for a few months in China. Because the youth were using it to learn languages. It still doesn't make any sense. Thankfully, I can use it in the autumn, with a version only for mainland China. The second language became less important, The first US movie on screen was \"the Batman\", and it was in April. On the contrary, it seems that the cultural industry abroad is extremely prosperous. In the middle of the year, whether it is Amazon, HBO, Apple TV, or Disney, excellent works emerged in endlessly. The Snowpiercer, Moon Knight, The Boys, Shining Girls, Severance, The sandman, at the end of this year, The House of Dragon, The Rings of power, Andor, Rick & Morty, and The Crown. Not to mention a lot of Chinese content renowned internationally, Turning Red and Everything Everywhere All At Once.\n\nAfter the two sessions, the virus went on rage, and then the notorious Shanghai lockdown began. Actually, before Shanghai, there are several cities are in lockdown. But they were small cities like Changchun and Xi'an. Ridiculously, though people were unprepared at first. The success of the Xi'an lockdown got praised, and no one remembered the panic. That forced Shanghai to be closed. The pandemic was severe, and China as a host decided to give up the Asian Cup which would be held in 2023 and was prepared for decades. Media shows information about how badly the westerners were handling the virus, the foreigners also had to face monkeypox. At the end of the year, when FIFA began, Everyone realized that was just a lie.\n\nToo much for the plague, This year is an unexpected exciting one for technology. In June, I took up vim, my laptop is two years old. It seems VScode is a heavy burden. The fan keeps telling me that it can not bear it anymore. This July, a blazingly fast Javascript runtime called Bun came out. Brought out a new language called zig. Different from rust, zig wants to build the language as simple as possible. This August, came up with a new JS framework Astro, a framework of frameworks, in Astro, I can use not only React but also Vue, svelte, and a lot of others. In September I learned OpenGL, realizing that I really should get a new ITX to replace my laptop. So I gave up my 3D printer, and after the exam, I'll get one ITX. This October, when I was surfing Youtube, I found some YouTubers working in VR, and I realized what I wrote in my graduation paper is happening. Right now I am using a quest2 to write this. I was banned from Wechat this October because I talked about a bridge in Beijing. From that day, I began to use iMessage, I am a half Apple-guy now. In December, people were talking about chatGPT, a nonsense AI, but truly amazing.\n\n2022 ends, I don't miss it. But I think 2023 is going to be much worse.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/01/01/The-First-Week.md","slug":"2023/01/01/the-first-week","body":"# The First Week\n\nThis is the first week of 2013. A lot of stuff happened. I received Quest2 and started my first metaverse experience in Immersed VR. I have got my first ITX Mac device only for me. I upgraded my laptop and tablet to Windows 10 Pro.\n\nBesides using a lot of time to set up the development environment, I wasted some time adapting to working in VR. It's like living in a place with a telescope on. Since I only have 2K pixels per eye, the resolution of the screen needs to be small, so that I can discern the characters. And, yes, my computer cannot afford too many high-resolution screens. I need to practice blind typing more. Typing in VR is a disaster, even though there's a pass-through feature. I cannot see the keyboard. I always want to see the keyboard through the hole in the nose position. Especially some password occasions.\n\nMore news, I found my passport is not expired, great news, so I can plan some abroad travels this year.\n\nIn the 2nd week, I will start some front-end coding.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/01/15/2th-week-retrospective-Hackintosh.md","slug":"2023/01/15/2th-week-retrospective-hackintosh","body":"\n# 2nd week retrospective\n\nThis week I configured some bugs in my nvim preferences. Next week I will try to use it as my main editor.\n\nStill working in VR, found some shortcoming when I switch devices. Wish there were an Immersed for multiple devices.\n\nI need a better podcast app to synchronize between devices. And a virtual keyboard just show what I typed, yes it is too hard to do blind typing.\n\nA Netflix comic is hilarious, called Inside Job. Tells a story about a company works on conspiracies. Sadly it was cut. \n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/01/24/the-3rd-week-week-of-luna-vim.md","slug":"2023/01/24/the-3rd-week-week-of-luna-vim","body":"\n# The 3rd week in review: week of the LunarVim\n\nHappy Luna/Chinese new year!\n\nfirst week I bought Oculus Quest 2 started my first experience in Immersed VR.\n\nsecond week I built up an ITX started my self-made hackintosh.\n\nThis third week, I tried LunarVim, great nvim config, I finally can be a vim guy! However, this stable version is the last one that supports Packer.vim. It means I have to learn Lazy.vim when the next version comes. I started using LazyGit, too. Like the authors' podcast btw.\n\nI also found out an app called BigScreen, which streams video to the VR headset so that the user can use it to watch movie.\n\nThis week, I compared ImmersedVR and VSpatial, VSpatial supports multiple devices, which is awesome, but only supports Windows. Yes, VR works better in Windows than Mac. I tried to configure Windows in Bootcamp. As I installed WSL2, it went blue screen. Guess I have to use Mac on my ITX for a while.\n\nSomething wrong happened to edge browser, all the chromium browsers occasionally cannot browse the internet. However, I am using firefox now.\n\nI still use TypeClub, I cannot find a better way but to learn touch typing. Although, I found KeyCastr on Mac and Carnac on Windows, which show key strokes on screen. They may be useful when I want to do some streaming.\n\nso next week's plan\n\n- Still need to do more typing class\n- Set up my account in WHV \n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/01/29/the-forth-week-touch-typing.md","slug":"2023/01/29/the-forth-week-touch-typing","body":"\n# The 4th week: touch typing\n\nMost days in this week, I kept practising touch typing on typeclub. Now, I can type the alphabets better, but the symbols are not so good.\n\nI haven't made a WHV account, I will do that this week.\n\nI can't make hyper-V work on my ITX, so I can't run WSL. I can't find out why.\n\nTried Meta workrooms this week, Love the whiteboard.\n\nThis week remember the WHV account!\n","collection":"blog","data":{"type":"post","category":"plan"}}]}