{"posts":[{"id":"2023/02/08/5th-week-Get-a-keyboard.md","slug":"2023/02/08/5th-week-get-a-keyboard","body":"\n# 5th week: Get a keyboard\n\nWell, I bought a K375s. Yes, I've gave up my touch typing plan. And I will keep practising it recently.\n\nThe Chinese WHV will take offer on this August. Right now I have to pick up my English. However, I just found out that China is a high-incidence area of tuberculosis. After what happened in Covid. It's like a joke.\n\nI moved my develop environment to PC this week. The VR experience in Mac was not acceptable. Guess I have to buy a new router or wait for some software update.\n\nI have too many plans this week. My English book is not here yet. Guess I will try some FE frameworks.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/02/14/6th-week-Use-AI-Wifi-direct.md","slug":"2023/02/14/6th-week-use-ai-wifi-direct","body":"\n# 6th week: Use AI & wifi-direct\n\nMy Mac is super lagged this week. After some research, I have to use wifi-direct in Immersed VR. Simple, if you have a PC, you can set up a hotspot and connect your Headset to the hotspot. But in Mac, the hotspot feature is used by airdrop. I can try the ethernet, and share the internet with the headset using wifi. Or I can buy a USB wifi adapter as a Wifi2.\n\nI bought CF-812AC, using an opensource solution on Github written by [chris1111](https://github.com/chris1111/Wireless-USB-Big-Sur-Adapter). The driver emulates the chip as an ethernet cable. It needs to disable SIP in recovery mode. In conclusion, The driver works fine, I can share my internet now, but in 2.4GHz. So the better idea is to add AP feature in the driver. It costs time... Now, I'm using a PC to set hotspot for the Mac and the headset.\n\nAbout AI, I subscribed copilot this week. Yes, it may not replace my job, but someone with an AI will.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/02/19/7th-week-SSDs-are-so-cheap.md","slug":"2023/02/19/7th-week-ssds-are-so-cheap","body":"\n# the 7th week: SSDs are so cheap\n\nI bought an 1TB SSD for 288 yuan. It's so cheap. I'm going to use it as a Windows drive, leaving the 500GB to use Mac OS.\n\nI finished three TV series this week. The first one is The Slow horses. It's a British TV series. The story is about a group of agents working for MI5. When the government made a mistake, they are the ones to take the blame. Good story and good acting. I like it. The second one is The White Lotus, a comedy TV series. It's about the vacasions and murders of hypocritical white upper classes. The third one is an anime called The Bad Batch. I liked it in the first season, but this season, the animation is not so good. Next week I will finish The Clarkson Farm.\n\nI bought a second hand Huawei phone for my father. It will be arrived the next week.\n\nI tried Tailwind this week. Also downloaded T3 project. I may need to figure out how to use prisma and tRPC. I'm trying to make a dashboard using systeminformation.\n\nFixed WSL running in opencore. Don't know how, I just copied some configs from daliansky.\n\nNext week the master entrance exam result will be announced. Not so sure what to do next.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/02/26/8th-week-bigfrontenddev.md","slug":"2023/02/26/8th-week-bigfrontenddev","body":"\n# the 8th week: bigfrontend.dev\n\nI finished The Clarkson Farm this week. It's a comedy TV series. It's about an English TV billionaire who started farming. It's a good story. I like it.\n\nI didn't pass the master entrance exam, such a relief. I can start my plan on migrating abroad.\n\nAfter almost half year, I've never touched one thing about the front end. I think I need to learn more about it. I found a website called bigfrontend.dev. It's a website that teaches front end. I'm going to finish it this week and the following one.\n","collection":"blog","data":{"type":"post","category":"plan"}}]}