{"posts":[{"id":"2023/03/05/9th-week-HoloFit.md","slug":"2023/03/05/9th-week-holofit","body":"# the 9th week: HoloFit\n\nI'm not satisfied with this week's work, I didn't finish the typingclub.com. It gets harder as I push farther. I need to finish it next week, then I can start the BigFrontEnd.dev.\n\nI tried HoloFit this week, a VR fitness app. It supports devices with FTMS bluetooth support which is a small bluetooth beacon that can be attached to a bike. But be careful not all the beacons supports FTMS. The first one I bought only support an App called Yingerjian. Nice App, but not exactly what I wanted. the FTMS bluetooth device also supports Zwift. But as I paddle the App had no response. I checked the documents, it was a mess, but I suppose I will develope an App of it oneday.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/03/13/10th-week-Dev-Containers.md","slug":"2023/03/13/10th-week-dev-containers","body":"\n# 10th week Dev Containers\n\nThis week, I bought Virtual Desktop to try Steam VR. I also tried to use the Dev Container to develop the project. I found that the Dev Container is very useful.\n\nsome pre-build dev containers\n\n[t3](https://github.com/gongbaodd/containers/tree/t3)\n\n[tauri](https://github.com/gongbaodd/containers/tree/tauri)\n\n[cypress](https://github.com/gongbaodd/containers/tree/cypress)\n\n[opengl](https://github.com/gongbaodd/containers/tree/opengl)\n\nI bought Glinet MT3000, it will arrive the next week. Guess it can be an ultimate network solution.\n\nI can use new bing now, perfect AI, free and useful.\n\nI finished the typingclub.com. So the next week I will finish the BigFrontEnd.dev.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/03/20/10th-week-GLinet.md","slug":"2023/03/20/10th-week-glinet","body":"\n# 10th Week: GLinet\n\nThis week I mostly work on BFE.com, finished about 30% questions. Last week I bought GLinet router, a router runs openwrt on it, super useful.\n\nI took Dalian subway line 5, nice new subway line, I like the station design.\n\nAbout AI, I was going to generate 360 degree panorama image from 2D image, using AI to generate the empty part, but I found it's not that easy, it takes a lot token to do outpaint in either stable diffusion nor Dall-E. But I found [Skybox lab](https://skybox.blockadelabs.com/), It fulfills my need, I can use the image in Immersed VR. Hope one day I can set it up using voice commands.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/03/27/11st-week-Ted-Lasso.md","slug":"2023/03/27/11st-week-ted-lasso","body":"\n# 11st Week: Ted Lasso\n\nNothing new, still working on BFE.com. Watched Ted Lasso, Inspiring.\n","collection":"blog","data":{"type":"post","category":"plan"}}]}