{"posts":[{"id":"2023/04/04/12th-week-tetris.md","slug":"2023/04/04/12th-week-tetris","body":"\n# 12nd Week: Tetris\n\nStill working on BFE.com. Watched Tetris, Great story about how an American sales man brought Tetris from Soviet Union to the Nintendo.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/04/16/14th-week-a-shit-load-of-money.md","slug":"2023/04/16/14th-week-a-shit-load-of-money","body":"\n# 14th week: I spent a shit load of money\n\n## About GPU\n\nI bought a GPU this week, first GPU in my life. A computing card Tesla P40. Can read [How to use tesla P40](https://github.com/JingShing/How-to-use-tesla-p40) to make it work as a gaming card. To use it as a display card can try this [document](https://github.com/toAlice/NvidiaTeslaP40forGaming). Because the fan has not been arrived, I cannot use it for some hardwork.\n\n| name                     | price   |\n| ------------------------ | ------- |\n| Tesla P40                | 1062    |\n| TH3P4G3 Thunderbolt Dock | 833.28  |\n| Delta NX450              | 279     |\n| 3D printed Fan           | 78      |\n| USB fan power            | 8.9     |\n| Thunderbold lan 2m       | 79      |\n| ADT R43SG                | 198     |\n| NVME/SATA disk box       | 99      |\n| some lines               | 59.1    |\n| Total                    | 2696.28 |\n\nLearnt a lot. Like the PICe connector actually shares 75W power. A 6pin GPU power source gives away 75W. A 8pin(or 6+2 pin) gives 150W. A GPU like Tesla P40 uses 250W power, means it needs 75W from PCIe, 75W from 6pin, and 100W from 8pin. Since there is not a power supply only for GPUs, I can only buy a PC power supply. Luckily, the Delta NX450 I bought, has one 6pin and a 6+2pin.\n\nI did more research, If I don't have another 6pin, I can use a SATA port as a replacement, a SATA port supplies 54W, only need an adapter, it can support GPUs.\n\nStrongly suggest to read [egpu.io](https://egpu.io/best-egpu-buyers-guide/) before buying. eGPU has cut a lot price, but it is still expensive for thunderbolt devices. TH3PG3 is the cheapest I can find.\n\nSadly, thunderbolt works on my laptop, not my ITX, so I have to buy a NVME dock, say ADT R43SG. Thank god it is a lot cheaper. I bought the disk box to run the OS through USB, sadly hackintosh is not supported, I can only work in Windows when I use the GPU.\n\n## Surface Dial\n\nI want a surface dial the day I saw it. I don't know what I gonna do with it, but I just want it. I have been waiting for a cheap alternative for a long time. I finally found one, a robit dial. It is a cheap alternative for surface dial.\n\nAnd a mushroom shell! Why can it be so cute!\n\n| name      | price |\n| --------- | ----- |\n| RobitDial | 69    |\n\n## betterjoy\n\nThis is like the only thing I got in this week that costs me no money. It is a driver for Joy-cons. I can reuse the Nintendo Joy-cons on PC.\n\nAs I share this APP to others, I got a lot negative responses. Clearly, Switch players despise PC players, and PC players don't use gamepad to play games.\n\n## iPhone Pro Max 12\n\nYes, I am going to use an iphone the next week. The MIX 2s frequently restarted last week. Firstly I thought it was the battery problem, But nothing happend as I changed it. It may be a motherboard's or some buttons' problem. I don't want to waste more time to fix it now. So I bought a second hand iphone 12 pro max.\n\n| name           | price  |\n| -------------- | ------ |\n| MIX 2s battery | 87.65  |\n| iPhone Pro Max | 3196.8 |\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/04/25/15th-week.md","slug":"2023/04/25/15th-week","body":"\n# 15th week\n\nwhole week waiting for the new iPhone, yet got a broken one...\n\nFinished the BFE.com CSS, ts & react part.\n","collection":"blog","data":{"type":"post","category":"plan"}}]}