{"posts":[{"id":"2023/05/01/16th-week-GUIs.md","slug":"2023/05/01/16th-week-guis","body":"\n# 16th week: GUIs\n\nlast week, I tried using different GUI frameworks to build a vcode form.\n\n[AntD](https://ant.design/) is a fully packed react component library. It is easy to use, and satisfies all the needs without picking.\n\n[XState](https://xstate.js.org/) is a state machine/ One thing I like is that it can show the state into a graph. Compared to hooks or redux, this is a nice feature for refactoring.\n\n[Vue](https://vuejs.org/), here are some [challenges](https://vuejs-challenges.netlify.app/) to learn vue. I used [Element+](https://element-plus.org/), which is a lot like AntD. Although many people think Vue is easier than React, I think it harder. to learn Vue you have to learn template syntax, an option style API and a composition API. Feels redundant.\n\n[Svelte](https://svelte.dev/) with [SMUI](https://sveltematerialui.com/), I like material design a lot. Compared to React, Svelte is not so fully prepared. But the code is the simplest in all the frameworks I tried.\n\n[Leptos](https://github.com/leptos-rs/leptos) a Rust GUI framework. With signal based reactive programming. It is like [SolidJs](https://www.solidjs.com/). It makes rust much easier to use. But WASM still a long way to go. The package is big, 2MB. The page needs to load for the whole file to run.\n\n[Flutter](https://flutter.dev/) renders all element into canvas. But the framework is fully made. I might choose Flutter for my next project.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/07/17th-week-stablediffusion.md","slug":"2023/05/07/17th-week-stablediffusion","body":"\n# 17th week stable diffusion\n\nGot My iPhone finally.\n\n- tried Memoji, can't generate one from my photo, sad. I can send it to wechat.\n- iPhone don't have a complete file system, it feels a little different to Android. Meaning most time, I can't open a folder, create a file to edit. I can open an editor to write and then share to the file App.\n- iPhone don't have a back logic, sometimes I want to swipe the side to trigger back logic, which is useful in Android, but it won't work in iOS.\n- I can't capture a 360 panorama photo, the last App, Gogle streetview was removed from App Store.\n\nTried stable diffusion, generated some photo with my face, like it.\n\nDid some research on XR, want to try some in MRTK. try the tutorial on babylonjs. About AR, 8th wall might be a starter choice, or I can try Unity's AR foundation, to make AR work on phones.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/15/19th-week-Google-IO.md","slug":"2023/05/15/19th-week-google-io","body":"# 19th week Google IO\n\nTried AImoji this week, using stable diffusion to generate emoji. Try [this video](https://t.co/IiWIS6MQJY) to learn more about training a picture.\n\nTried MRTK on Hololens, tried some quest demos, building a VR is fun, compiling time is a disaster. Want to try compile MRTK on quest, and learn some babylonjs.\n\nTrie QWERT-learner to remember words, this week I want to finish it.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/21/20th-week-web-BLE.md","slug":"2023/05/21/20th-week-web-ble","body":"# 20th week web BLE\n\nWatched The Long Season, nice story about the life of northeast China.\n\nWatched The Super Mario Movie, funny movie.\n\nTried to build MRTK on quest, quite simple but not as easy as web development.\n\nDid some research to build a [web BLE](https://googlechrome.github.io/samples/web-bluetooth/) project on my indoor biking device. Can use [nRF Connect](https://play.google.com/store/apps/details?id=no.nordicsemi.android.mcp&hl=zh&gl=US) to read what the BLEs send. But the simulator is deprecated, meaning I can't simulate a fake BLE device on my computer. I have to buy a BLE device to test it.I can't using web-BLE on iOS. [Bluefy](https://apps.apple.com/jp/app/bluefy-web-ble-browser/id1492822055) is a free app to test web-BLE on iOS.\n\nDid some research on [WebXR](https://immersiveweb.dev/).\n\nIt's amazing that web can do so much stuff.\n\n[Edge impulse](https://www.edgeimpulse.com/) puts ML into embedded devices, I won't dig it further. It's unbelivably cheap when I realized that a PR2040 board only costs 20CNY.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/29/21st-week-cloudflare-workers-and-graphql-yoga.md","slug":"2023/05/29/21st-week-cloudflare-workers-and-graphql-yoga","body":"# 21st Week: Cloudflare Workers and GraphQL Yoga\n\nI've been working on adding a backend for qwert-learner.\n\nTo keep this App a static site, I decided to ditch the Restful API and use GraphQL instead. Since it only requires one endpoint. A lot schemes can found like Azure functions, AWS Lambda, Google Cloud Functions, DigitalOcean Functions and Cloudflare Workers. MongoDB Atlas is a cheap choice for database. But Cloudflare workers can use KV to store data, which is a better choice for me.\n\nCampared with Apollo Server, [GraphQL Yoga](https://the-guild.dev/graphql/yoga-server) is a lightweight one. Can be simply integrated with a lot providers like cloudflare. Here is the [document](https://the-guild.dev/graphql/yoga-server/docs/integrations/integration-with-cloudflare-workers).\n\nDeveloping cloudfalre workers is much easier with [wrangler](https://developers.cloudflare.com/workers/wrangler/). Can use [miniflare](https://miniflare.dev/testing/vitest) to do unit testing.\n\n","collection":"blog","data":{"type":"post","category":"plan"}}]}