{"posts":[{"id":"2023/09/04/35th-week.md","slug":"2023/09/04/35th-week","body":"\n# The 35th week\n\nkeep everything for IELTS test","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/09/24/38th-week-opencore.md","slug":"2023/09/24/38th-week-opencore","body":"\n# 38th Week - OpenCore\n\n## IELTS\n\nGot a 7 in IELTS test! Hooooray!\n\n## OpenCore\n\nTwo weeks ago, I bought a new laptop, ASUS Pro Art 16. Thus, I decide to sell my old one, which is Dell Inspiron 7391 2in1. Sadly, even as cheap as 2k RMB, it picks no one's interest. So I decide to keep it as a hackintosh machine. And yes, it was sold out in the next day.\n\nMaking a laptop into a hackintosh is not as easy as an ITX. I can not choose the hardware. Gladly, Dell has a good reputation on Linux support. I found a lot configurations on github. However, most of them doesn't work as I expected. So I used almost one week to learn how to configure a opencore config file.\n\n### OCAuxiliaryTool\n\nThis tool is a must-have for hackintosh. Earlier in this year, I have to config opencore with [OpenCore Configurator](https://mackie100projects.altervista.org/download-opencore-configurator/), one of its flaw is that it is a macOS only App. But OCAT is a cross-platform tool, which is very convenient for me.\n\n### Dortania's Guide\n\n[This](https://dortania.github.io/OpenCore-Install-Guide/) is the most important guide for hackintosh. It is very detailed and easy to understand. Beleive me, all the errors I met, they were all finally went to this guide.\n\nHowever, since I'm a Chinese, I also checked [国光](https://apple.sqlsec.com/) and [黑果小兵](https://blog.daliansky.net/) for more information.\n\n### My Config\n\nThis is my [config.plist](https://github.com/gongbaodd/DELL-Inspiron-7391-Hackintosh-EFI), hint it is only available for Ventura. For other versions, you may need to change the Itlwm.\n\n### Hide entries\n\nTo hide some entry, you need to add \".contentVisibility\" to the Boot folder. Check [this](https://www.insanelymac.com/forum/topic/355227-how-to-opencore-087-088-differences/).\n\n","collection":"blog","data":{"type":"post","category":"plan","tag":["hackintosh","opencore","IELTS","OCAuxiliaryTool"]}},{"id":"2023/09/30/39th-week-Apple-Watch.md","slug":"2023/09/30/39th-week-apple-watch","body":"\n# 39th Week - Apple Watch\n\n## Apple Watch\n\nI bought an Apple Watch SE2. Yes, it's been a long time since I used a real smart watch. I used pebble time for a long time. It was still my top 1 smart watch. I want to have a round watch, like Pixel Watch, but it doesn't support iOS. In iOS, the Apple Watch is the only choice. This year, Apple released Watch OS 10, which changed it's user experience. Users can freely switch app view, the notification view and home with a swipe. I like it very much. I have a small wrist, so I choose the 40mm version. Thank god I chose this one, I can't imagine how big an ultra version is.\n\n## Sonoma on VMware\n\nSince I have sold my hackintosh, I have to build a Mac on VMware. I found the mac in VM runs frequently on Nobara OS. I bumped to a kernel problem, fixed following the instruction in the [forum](https://communities.vmware.com/t5/Workstation-2023-Tech-Preview/Linux-Kernel-6-5-rc-vmmon-compile-fails/td-p/2981003). Also a `Could not open /dev/vmmon: No such file or directory.` issue, found solution [here](https://askubuntu.com/questions/1348250/skipping-btf-generation-xxx-due-to-unavailability-of-vmlinux-on-ubuntu-21-04).\n\nAfter Ventura, the Mac in the VM can not connect the network, solution is [here](https://communities.vmware.com/t5/VMware-Fusion-Discussions/macOS-Ventura-guest-has-no-network-connection/td-p/2912933).\n\n## Next week\n\nI will plan my trip to Hong Kong. Finish my CV and plan to Thailand.","collection":"blog","data":{"type":"post","category":"plan"}}]}