{"posts":[{"id":"2023/01/01/2022-Retrospective-Immersed-VR.md","slug":"2023/01/01/2022-retrospective-immersed-vr","body":"\n# 2022 Retrospective\n\nOne hell of a year. This year, the government finally gave up its 2-COVID policy. Russia is invading Ukraine, and I just realized most Chinese are not standing on the justice side. Idiots were running the country, and they will run for the coming decades without the help of elites. Businessmen all over the world are rushing out of the country, fearing that the 0-COVID will happen again. So the future does not look promising. It feels good to discern the situation. I have to make the right choice at the right moment.\n\nThis year I took the postgraduate entrance examination for the second time, and I did pretty well. This September, I decided to cut down some entertainment time and focused on studying. However, the news still brought anxiety. They were always cheerful, that the government protected the people from the virus again, and trade hit another high this year. What did I know? I know that I was forced to stay at home many times to end the spreading of the virus, and eventually got ill and the end of this year, right before the examination.\n\nBefore opening, my neighborhood was under lockdown. Max whites took turns working overnights to guard my block, in case of someone what to get out. That was some cold snowy nights. I watched through the window to know how long they can last. The day they decided to open, a sunny day came. Then everyone got infected making all the work those max whites had done in vain.\n\nThis year a lot of hypocrites showed themselves who they are. These self-claimed experts discuss military, political, medical treatment, and sports. Beaten by reality, it turns out that the experts are so ignorant, selfish, and arrogant. The media shows fake news about the Bucha massacre and shouted about Nancy Pelosi going to Taiwan. Gladly, A local populist named \"Sailei 3min\" got banned, who used to spread conspiracy theories about the west. This time he copied a video with a frame of a Chinese untalkable 64 incident. Self-thinking is becoming a topic of the year, sadly, many people still don't have it.\n\nDuolingo is my favorite APP. But it was banned for a few months in China. Because the youth were using it to learn languages. It still doesn't make any sense. Thankfully, I can use it in the autumn, with a version only for mainland China. The second language became less important, The first US movie on screen was \"the Batman\", and it was in April. On the contrary, it seems that the cultural industry abroad is extremely prosperous. In the middle of the year, whether it is Amazon, HBO, Apple TV, or Disney, excellent works emerged in endlessly. The Snowpiercer, Moon Knight, The Boys, Shining Girls, Severance, The sandman, at the end of this year, The House of Dragon, The Rings of power, Andor, Rick & Morty, and The Crown. Not to mention a lot of Chinese content renowned internationally, Turning Red and Everything Everywhere All At Once.\n\nAfter the two sessions, the virus went on rage, and then the notorious Shanghai lockdown began. Actually, before Shanghai, there are several cities are in lockdown. But they were small cities like Changchun and Xi'an. Ridiculously, though people were unprepared at first. The success of the Xi'an lockdown got praised, and no one remembered the panic. That forced Shanghai to be closed. The pandemic was severe, and China as a host decided to give up the Asian Cup which would be held in 2023 and was prepared for decades. Media shows information about how badly the westerners were handling the virus, the foreigners also had to face monkeypox. At the end of the year, when FIFA began, Everyone realized that was just a lie.\n\nToo much for the plague, This year is an unexpected exciting one for technology. In June, I took up vim, my laptop is two years old. It seems VScode is a heavy burden. The fan keeps telling me that it can not bear it anymore. This July, a blazingly fast Javascript runtime called Bun came out. Brought out a new language called zig. Different from rust, zig wants to build the language as simple as possible. This August, came up with a new JS framework Astro, a framework of frameworks, in Astro, I can use not only React but also Vue, svelte, and a lot of others. In September I learned OpenGL, realizing that I really should get a new ITX to replace my laptop. So I gave up my 3D printer, and after the exam, I'll get one ITX. This October, when I was surfing Youtube, I found some YouTubers working in VR, and I realized what I wrote in my graduation paper is happening. Right now I am using a quest2 to write this. I was banned from Wechat this October because I talked about a bridge in Beijing. From that day, I began to use iMessage, I am a half Apple-guy now. In December, people were talking about chatGPT, a nonsense AI, but truly amazing.\n\n2022 ends, I don't miss it. But I think 2023 is going to be much worse.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/01/01/The-First-Week.md","slug":"2023/01/01/the-first-week","body":"# The First Week\n\nThis is the first week of 2013. A lot of stuff happened. I received Quest2 and started my first metaverse experience in Immersed VR. I have got my first ITX Mac device only for me. I upgraded my laptop and tablet to Windows 10 Pro.\n\nBesides using a lot of time to set up the development environment, I wasted some time adapting to working in VR. It's like living in a place with a telescope on. Since I only have 2K pixels per eye, the resolution of the screen needs to be small, so that I can discern the characters. And, yes, my computer cannot afford too many high-resolution screens. I need to practice blind typing more. Typing in VR is a disaster, even though there's a pass-through feature. I cannot see the keyboard. I always want to see the keyboard through the hole in the nose position. Especially some password occasions.\n\nMore news, I found my passport is not expired, great news, so I can plan some abroad travels this year.\n\nIn the 2nd week, I will start some front-end coding.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/01/09/Install-Clash-On-Mi-Route.md","slug":"2023/01/09/install-clash-on-mi-route","body":"\n# Install Clash on RedMi AX5\n\nI got a Quest 2 this year, that means my router needs to connect Facebook. By following [this URL](https://qust.me/post/hong-mi-ax5xiao-mi-ax1800-jie-suo-sshoran-zhuang-shi-yong-shellclash-jiao-cheng/).\n\n- First, downgrade to v1.0.26, and stop updating.\n- get ssh permission\n- install clash\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/01/15/2th-week-retrospective-Hackintosh.md","slug":"2023/01/15/2th-week-retrospective-hackintosh","body":"\n# 2nd week retrospective\n\nThis week I configured some bugs in my nvim preferences. Next week I will try to use it as my main editor.\n\nStill working in VR, found some shortcoming when I switch devices. Wish there were an Immersed for multiple devices.\n\nI need a better podcast app to synchronize between devices. And a virtual keyboard just show what I typed, yes it is too hard to do blind typing.\n\nA Netflix comic is hilarious, called Inside Job. Tells a story about a company works on conspiracies. Sadly it was cut. \n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/01/24/the-3rd-week-week-of-luna-vim.md","slug":"2023/01/24/the-3rd-week-week-of-luna-vim","body":"\n# The 3rd week in review: week of the LunarVim\n\nHappy Luna/Chinese new year!\n\nfirst week I bought Oculus Quest 2 started my first experience in Immersed VR.\n\nsecond week I built up an ITX started my self-made hackintosh.\n\nThis third week, I tried LunarVim, great nvim config, I finally can be a vim guy! However, this stable version is the last one that supports Packer.vim. It means I have to learn Lazy.vim when the next version comes. I started using LazyGit, too. Like the authors' podcast btw.\n\nI also found out an app called BigScreen, which streams video to the VR headset so that the user can use it to watch movie.\n\nThis week, I compared ImmersedVR and VSpatial, VSpatial supports multiple devices, which is awesome, but only supports Windows. Yes, VR works better in Windows than Mac. I tried to configure Windows in Bootcamp. As I installed WSL2, it went blue screen. Guess I have to use Mac on my ITX for a while.\n\nSomething wrong happened to edge browser, all the chromium browsers occasionally cannot browse the internet. However, I am using firefox now.\n\nI still use TypeClub, I cannot find a better way but to learn touch typing. Although, I found KeyCastr on Mac and Carnac on Windows, which show key strokes on screen. They may be useful when I want to do some streaming.\n\nso next week's plan\n\n- Still need to do more typing class\n- Set up my account in WHV \n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/01/29/the-forth-week-touch-typing.md","slug":"2023/01/29/the-forth-week-touch-typing","body":"\n# The 4th week: touch typing\n\nMost days in this week, I kept practising touch typing on typeclub. Now, I can type the alphabets better, but the symbols are not so good.\n\nI haven't made a WHV account, I will do that this week.\n\nI can't make hyper-V work on my ITX, so I can't run WSL. I can't find out why.\n\nTried Meta workrooms this week, Love the whiteboard.\n\nThis week remember the WHV account!\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/02/08/5th-week-Get-a-keyboard.md","slug":"2023/02/08/5th-week-get-a-keyboard","body":"\n# 5th week: Get a keyboard\n\nWell, I bought a K375s. Yes, I've gave up my touch typing plan. And I will keep practising it recently.\n\nThe Chinese WHV will take offer on this August. Right now I have to pick up my English. However, I just found out that China is a high-incidence area of tuberculosis. After what happened in Covid. It's like a joke.\n\nI moved my develop environment to PC this week. The VR experience in Mac was not acceptable. Guess I have to buy a new router or wait for some software update.\n\nI have too many plans this week. My English book is not here yet. Guess I will try some FE frameworks.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/02/14/6th-week-Use-AI-Wifi-direct.md","slug":"2023/02/14/6th-week-use-ai-wifi-direct","body":"\n# 6th week: Use AI & wifi-direct\n\nMy Mac is super lagged this week. After some research, I have to use wifi-direct in Immersed VR. Simple, if you have a PC, you can set up a hotspot and connect your Headset to the hotspot. But in Mac, the hotspot feature is used by airdrop. I can try the ethernet, and share the internet with the headset using wifi. Or I can buy a USB wifi adapter as a Wifi2.\n\nI bought CF-812AC, using an opensource solution on Github written by [chris1111](https://github.com/chris1111/Wireless-USB-Big-Sur-Adapter). The driver emulates the chip as an ethernet cable. It needs to disable SIP in recovery mode. In conclusion, The driver works fine, I can share my internet now, but in 2.4GHz. So the better idea is to add AP feature in the driver. It costs time... Now, I'm using a PC to set hotspot for the Mac and the headset.\n\nAbout AI, I subscribed copilot this week. Yes, it may not replace my job, but someone with an AI will.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/02/19/7th-week-SSDs-are-so-cheap.md","slug":"2023/02/19/7th-week-ssds-are-so-cheap","body":"\n# the 7th week: SSDs are so cheap\n\nI bought an 1TB SSD for 288 yuan. It's so cheap. I'm going to use it as a Windows drive, leaving the 500GB to use Mac OS.\n\nI finished three TV series this week. The first one is The Slow horses. It's a British TV series. The story is about a group of agents working for MI5. When the government made a mistake, they are the ones to take the blame. Good story and good acting. I like it. The second one is The White Lotus, a comedy TV series. It's about the vacasions and murders of hypocritical white upper classes. The third one is an anime called The Bad Batch. I liked it in the first season, but this season, the animation is not so good. Next week I will finish The Clarkson Farm.\n\nI bought a second hand Huawei phone for my father. It will be arrived the next week.\n\nI tried Tailwind this week. Also downloaded T3 project. I may need to figure out how to use prisma and tRPC. I'm trying to make a dashboard using systeminformation.\n\nFixed WSL running in opencore. Don't know how, I just copied some configs from daliansky.\n\nNext week the master entrance exam result will be announced. Not so sure what to do next.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/02/26/8th-week-bigfrontenddev.md","slug":"2023/02/26/8th-week-bigfrontenddev","body":"\n# the 8th week: bigfrontend.dev\n\nI finished The Clarkson Farm this week. It's a comedy TV series. It's about an English TV billionaire who started farming. It's a good story. I like it.\n\nI didn't pass the master entrance exam, such a relief. I can start my plan on migrating abroad.\n\nAfter almost half year, I've never touched one thing about the front end. I think I need to learn more about it. I found a website called bigfrontend.dev. It's a website that teaches front end. I'm going to finish it this week and the following one.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/02/27/WSA-on-Win10.md","slug":"2023/02/27/wsa-on-win10","body":"\n# WSA on win10\n\nWith the help of [WSAPatch](https://github.com/cinit/WSAPatch), I can install android apps on windows 10. But it still needs 8 physical RAMs.","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/03/05/9th-week-HoloFit.md","slug":"2023/03/05/9th-week-holofit","body":"# the 9th week: HoloFit\n\nI'm not satisfied with this week's work, I didn't finish the typingclub.com. It gets harder as I push farther. I need to finish it next week, then I can start the BigFrontEnd.dev.\n\nI tried HoloFit this week, a VR fitness app. It supports devices with FTMS bluetooth support which is a small bluetooth beacon that can be attached to a bike. But be careful not all the beacons supports FTMS. The first one I bought only support an App called Yingerjian. Nice App, but not exactly what I wanted. the FTMS bluetooth device also supports Zwift. But as I paddle the App had no response. I checked the documents, it was a mess, but I suppose I will develope an App of it oneday.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/03/09/RiftCat-a-cardboard-VR-headset.md","slug":"2023/03/09/riftcat-a-cardboard-vr-headset","body":"# RiftCat: a cardboard VR headset\n\nI used to have a cardboard VR headset. It is always a cheap and fun way to experience VR. I think there should one solution to use it to experience steam VR. By using RiftCat, you can use your phone to experience steam VR. But only for 5min. However, enough for commercial VR experience","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/03/13/10th-week-Dev-Containers.md","slug":"2023/03/13/10th-week-dev-containers","body":"\n# 10th week Dev Containers\n\nThis week, I bought Virtual Desktop to try Steam VR. I also tried to use the Dev Container to develop the project. I found that the Dev Container is very useful.\n\nsome pre-build dev containers\n\n[t3](https://github.com/gongbaodd/containers/tree/t3)\n\n[tauri](https://github.com/gongbaodd/containers/tree/tauri)\n\n[cypress](https://github.com/gongbaodd/containers/tree/cypress)\n\n[opengl](https://github.com/gongbaodd/containers/tree/opengl)\n\nI bought Glinet MT3000, it will arrive the next week. Guess it can be an ultimate network solution.\n\nI can use new bing now, perfect AI, free and useful.\n\nI finished the typingclub.com. So the next week I will finish the BigFrontEnd.dev.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/03/13/Dalian-Subway-Line-5.md","slug":"2023/03/13/dalian-subway-line-5","body":"\n# Dalian Subway Line 5\n\n大连地铁 5 号线试运营了，这不仅是东北的第一条跨海地铁，还是大连近十年头一次用上新车的地铁（大连现有车，站点指示还是 LED 的），还是泉水湾居民自 03 年以来终于可以不出站换乘上班的地铁\n免费试乘主要人群是老年人，这趟线的拥挤程度不亚于上下班的线路\n大连站是我最喜欢的站点，装潢既保留百年车站的历史感又有现代的简约风，不知道是不是为了省钱，但是做得好\n梭鱼湾站看照片以为头顶的海水能动，但其实就是浮雕，\n梭鱼湾南站出站能看到在建的体育场，西边瓦良格公园对面就是大连造船厂，站在这几个庞然巨物下面看这几艘船肃然起敬，离机场不远，所以能看到超低空的飞机，影不影响房价我就不知道了\n青云街，一言难尽...好吧，叔叔阿姨喜欢\n虎滩站头顶有海洋动物的 LED，虽然卡通感高，但是和梭鱼湾站有一种呼应的感觉，怎么不是每一站都有大连站梭鱼湾站和虎滩站的审美\n虎滩新区出来就是渔人码头，以后出来装文青方便了\n\n![](./dalian-subway-5.jpg)\n\n![](./dalian-subway-5-242.jpg)\n\n![](./dalian-subway-5-301.jpg)\n\n![](./dalian-subway-5-533.jpg)\n\n![](./dalian-subway-5-573.jpg)\n\n![](./dalian-subway-5-618.jpg)\n\n![](./dalian-subway-5-682.jpg)\n\n![](./dalian-subway-5-687.jpg)\n\n![](./dalian-subway-5-945.jpg)\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2023/03/20/10th-week-GLinet.md","slug":"2023/03/20/10th-week-glinet","body":"\n# 10th Week: GLinet\n\nThis week I mostly work on BFE.com, finished about 30% questions. Last week I bought GLinet router, a router runs openwrt on it, super useful.\n\nI took Dalian subway line 5, nice new subway line, I like the station design.\n\nAbout AI, I was going to generate 360 degree panorama image from 2D image, using AI to generate the empty part, but I found it's not that easy, it takes a lot token to do outpaint in either stable diffusion nor Dall-E. But I found [Skybox lab](https://skybox.blockadelabs.com/), It fulfills my need, I can use the image in Immersed VR. Hope one day I can set it up using voice commands.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/03/27/11st-week-Ted-Lasso.md","slug":"2023/03/27/11st-week-ted-lasso","body":"\n# 11st Week: Ted Lasso\n\nNothing new, still working on BFE.com. Watched Ted Lasso, Inspiring.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/04/04/12th-week-tetris.md","slug":"2023/04/04/12th-week-tetris","body":"\n# 12nd Week: Tetris\n\nStill working on BFE.com. Watched Tetris, Great story about how an American sales man brought Tetris from Soviet Union to the Nintendo.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/04/10/13th-week-grid-layout.md","slug":"2023/04/10/13th-week-grid-layout","body":"\n# 13th Week: Grid Layout\n\nI finally fineshed the js coding questions in BFE.com. The question about grid-auto-flow is tricky.\n\nThis week I will get a new GPU. A robit dial which is a cheap alternative for surface dial. I guess it is made following [DIY Surface Dial](https://github.com/jfedor2/radial-controller).\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/04/16/14th-week-a-shit-load-of-money.md","slug":"2023/04/16/14th-week-a-shit-load-of-money","body":"\n# 14th week: I spent a shit load of money\n\n## About GPU\n\nI bought a GPU this week, first GPU in my life. A computing card Tesla P40. Can read [How to use tesla P40](https://github.com/JingShing/How-to-use-tesla-p40) to make it work as a gaming card. To use it as a display card can try this [document](https://github.com/toAlice/NvidiaTeslaP40forGaming). Because the fan has not been arrived, I cannot use it for some hardwork.\n\n| name                     | price   |\n| ------------------------ | ------- |\n| Tesla P40                | 1062    |\n| TH3P4G3 Thunderbolt Dock | 833.28  |\n| Delta NX450              | 279     |\n| 3D printed Fan           | 78      |\n| USB fan power            | 8.9     |\n| Thunderbold lan 2m       | 79      |\n| ADT R43SG                | 198     |\n| NVME/SATA disk box       | 99      |\n| some lines               | 59.1    |\n| Total                    | 2696.28 |\n\nLearnt a lot. Like the PICe connector actually shares 75W power. A 6pin GPU power source gives away 75W. A 8pin(or 6+2 pin) gives 150W. A GPU like Tesla P40 uses 250W power, means it needs 75W from PCIe, 75W from 6pin, and 100W from 8pin. Since there is not a power supply only for GPUs, I can only buy a PC power supply. Luckily, the Delta NX450 I bought, has one 6pin and a 6+2pin.\n\nI did more research, If I don't have another 6pin, I can use a SATA port as a replacement, a SATA port supplies 54W, only need an adapter, it can support GPUs.\n\nStrongly suggest to read [egpu.io](https://egpu.io/best-egpu-buyers-guide/) before buying. eGPU has cut a lot price, but it is still expensive for thunderbolt devices. TH3PG3 is the cheapest I can find.\n\nSadly, thunderbolt works on my laptop, not my ITX, so I have to buy a NVME dock, say ADT R43SG. Thank god it is a lot cheaper. I bought the disk box to run the OS through USB, sadly hackintosh is not supported, I can only work in Windows when I use the GPU.\n\n## Surface Dial\n\nI want a surface dial the day I saw it. I don't know what I gonna do with it, but I just want it. I have been waiting for a cheap alternative for a long time. I finally found one, a robit dial. It is a cheap alternative for surface dial.\n\nAnd a mushroom shell! Why can it be so cute!\n\n| name      | price |\n| --------- | ----- |\n| RobitDial | 69    |\n\n## betterjoy\n\nThis is like the only thing I got in this week that costs me no money. It is a driver for Joy-cons. I can reuse the Nintendo Joy-cons on PC.\n\nAs I share this APP to others, I got a lot negative responses. Clearly, Switch players despise PC players, and PC players don't use gamepad to play games.\n\n## iPhone Pro Max 12\n\nYes, I am going to use an iphone the next week. The MIX 2s frequently restarted last week. Firstly I thought it was the battery problem, But nothing happend as I changed it. It may be a motherboard's or some buttons' problem. I don't want to waste more time to fix it now. So I bought a second hand iphone 12 pro max.\n\n| name           | price  |\n| -------------- | ------ |\n| MIX 2s battery | 87.65  |\n| iPhone Pro Max | 3196.8 |\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/04/25/15th-week.md","slug":"2023/04/25/15th-week","body":"\n# 15th week\n\nwhole week waiting for the new iPhone, yet got a broken one...\n\nFinished the BFE.com CSS, ts & react part.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/01/16th-week-GUIs.md","slug":"2023/05/01/16th-week-guis","body":"\n# 16th week: GUIs\n\nlast week, I tried using different GUI frameworks to build a vcode form.\n\n[AntD](https://ant.design/) is a fully packed react component library. It is easy to use, and satisfies all the needs without picking.\n\n[XState](https://xstate.js.org/) is a state machine/ One thing I like is that it can show the state into a graph. Compared to hooks or redux, this is a nice feature for refactoring.\n\n[Vue](https://vuejs.org/), here are some [challenges](https://vuejs-challenges.netlify.app/) to learn vue. I used [Element+](https://element-plus.org/), which is a lot like AntD. Although many people think Vue is easier than React, I think it harder. to learn Vue you have to learn template syntax, an option style API and a composition API. Feels redundant.\n\n[Svelte](https://svelte.dev/) with [SMUI](https://sveltematerialui.com/), I like material design a lot. Compared to React, Svelte is not so fully prepared. But the code is the simplest in all the frameworks I tried.\n\n[Leptos](https://github.com/leptos-rs/leptos) a Rust GUI framework. With signal based reactive programming. It is like [SolidJs](https://www.solidjs.com/). It makes rust much easier to use. But WASM still a long way to go. The package is big, 2MB. The page needs to load for the whole file to run.\n\n[Flutter](https://flutter.dev/) renders all element into canvas. But the framework is fully made. I might choose Flutter for my next project.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/03/reactive-in-GUIs.md","slug":"2023/05/03/reactive-in-guis","body":"\n# Reactive in GUIs\n\n[Jetpack Compose](https://developer.android.com/jetpack/compose/documentation)\n\n```kotlin\nval mutableStateOf = remember { mutableStateOf(default) }\nvar value by remember { mutableStateOf(default) }\nval (value, setValue) = remember { mutableStateOf(default) }\n```\n\nCan use Kotlin's [Flow](https://developer.android.com/kotlin/flow) to build reactive UI.\n\nBTW, there is a [material theme builder](https://m3.material.io/theme-builder#/custom) to build UI theme.\n\n[Flutter](https://docs.flutter.dev/)\n\n```dart\n// in a widget\nclass Home extends StatefulWidget {\n    @override\n    State<Home> createState() => _HomeState();\n}\nclass _HomeState extends State<Home> {\n    int _counter = 0;\n    @override\n    Widget build(BuildContext context) {\n        return Button(\n            onPressed: () => setState(() => _counter++),\n            child: Text('$_counter'),\n    }\n}\n```\n\n```dart\n// communication between widgets\nvoid main() {\n  runApp(\n    ChangeNotifierProvider( // Provider\n      create: (context) => CartModel(),\n      child: const MyApp(),\n    ),\n  );\n}\n\nclass CartModel extends ChangeNotifier {\n  var current = WordPair.random();\n}\n\nclass MyApp extends StatelessWidget {\n  const MyApp({Key? key}) : super(key: key);\n  @override\n  Widget build(BuildContext context) {\n    var appState = context.watch<CartModel>(); // Consumer\n\n    return MaterialApp(\n      home: Scaffold(\n        appBar: AppBar(title: const Text('Provider demo')),\n        body: const MyCart(),\n      ),\n    );\n  }\n}\n\nreturn Consumer<CartModel>( // Consumer\n  builder: (context, cart, child) {\n    return Text('Total price: ${cart.totalPrice}');\n  },\n);\n```\n\n[SwiftUI](https://developer.apple.com/documentation/swiftui)\n\n```swift\n@State private var username = \"\"\n```\n\nshare data between views\n\n```swift\n// Our observable object class\nclass GameSettings: ObservableObject {\n    @Published var score = 0\n}\n\n// A view that expects to find a GameSettings object\n// in the environment, and shows its score.\nstruct ScoreView: View {\n    @EnvironmentObject var settings: GameSettings\n\n    var body: some View {\n        Text(\"Score: \\(settings.score)\")\n    }\n}\n\n// A view that creates the GameSettings object,\n// and places it into the environment for the\n// navigation stack.\nstruct ContentView: View {\n    @StateObject var settings = GameSettings()\n\n    var body: some View {\n        NavigationStack {\n            VStack {\n                // A button that writes to the environment settings\n                Button(\"Increase Score\") {\n                    settings.score += 1\n                }\n\n                NavigationLink {\n                    ScoreView()\n                } label: {\n                    Text(\"Show Detail View\")\n                }\n            }\n            .frame(height: 200)\n        }\n        .environmentObject(settings)\n    }\n}\n```\n\n```swift\n@ObservedObject var user: User\n```\n\n[Blazor](https://learn.microsoft.com/en-us/aspnet/core/blazor/?view=aspnetcore-7.0)\n\nusing Blazor in MAUI is available now, though it is not stable yet.\n\n```shell\ndotnet new install BlazorBindings.Maui.Templates\n```\n\n```razor\n@page \"/bind\"\n\n<p>\n    <input @bind=\"inputValue\" />\n</p>\n\n<p>\n    <input @bind=\"InputValue\" />\n</p>\n\n<ul>\n    <li><code>inputValue</code>: @inputValue</li>\n    <li><code>InputValue</code>: @InputValue</li>\n</ul>\n\n@code {\n    private string? inputValue;\n\n    private string? InputValue { get; set; }\n}\n```\n\nSince it is not stable yet, I did not dig into it.\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/05/05/use-stablediffusion-to-paint-with-specific-face.md","slug":"2023/05/05/use-stablediffusion-to-paint-with-specific-face","body":"\n# use statblediffusion to paint with specific face\n\ninstall python 3.10(not 3.11). clone the project;\n\n```bash\ngit clone https://github.com/AUTOMATIC1111/stable-diffusion-webui.git\n\n./webui.bat --enable-insecure-extension-access\n```\n\ninstall dreambooth extension and use some pictures to train the mode. use [Birme](https://www.birme.net/) to cut image in batch.\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/05/07/17th-week-stablediffusion.md","slug":"2023/05/07/17th-week-stablediffusion","body":"\n# 17th week stable diffusion\n\nGot My iPhone finally.\n\n- tried Memoji, can't generate one from my photo, sad. I can send it to wechat.\n- iPhone don't have a complete file system, it feels a little different to Android. Meaning most time, I can't open a folder, create a file to edit. I can open an editor to write and then share to the file App.\n- iPhone don't have a back logic, sometimes I want to swipe the side to trigger back logic, which is useful in Android, but it won't work in iOS.\n- I can't capture a 360 panorama photo, the last App, Gogle streetview was removed from App Store.\n\nTried stable diffusion, generated some photo with my face, like it.\n\nDid some research on XR, want to try some in MRTK. try the tutorial on babylonjs. About AR, 8th wall might be a starter choice, or I can try Unity's AR foundation, to make AR work on phones.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/09/AImoji.md","slug":"2023/05/09/aimoji","body":"\n# AImoji\n\nyou can download the model of [AImoji](https://civitai.com/models/23111/aimoji-memoji-model), put in stable diffusion's model folder. Using `memoji of xxx` as prompt to generate a memoji.\n\nBut I want to use it generating my photo, I need to merge my old model with it. That means I have to use extra 4GB for the new model. But I can make a Lora. Using [Kohya's GUI](https://github.com/bmaltais/kohya_ss), with the AImoji model, I can simply make one Lora, then put it to the statble diffusion's Lora folder.\n\nusing Lora prompt, now I can combine two model without retraining.\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/05/15/19th-week-Google-IO.md","slug":"2023/05/15/19th-week-google-io","body":"# 19th week Google IO\n\nTried AImoji this week, using stable diffusion to generate emoji. Try [this video](https://t.co/IiWIS6MQJY) to learn more about training a picture.\n\nTried MRTK on Hololens, tried some quest demos, building a VR is fun, compiling time is a disaster. Want to try compile MRTK on quest, and learn some babylonjs.\n\nTrie QWERT-learner to remember words, this week I want to finish it.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/17/MRTK-on-quest.md","slug":"2023/05/17/mrtk-on-quest","body":"# MRTK on quest\n\n1. create a 3D project on Unity Editor\n\n2. switch platform in build settings\n\n3. import XR plugin management from package manager\n\n4. import MRTK example and MRTK foundation from MixedRealityFeatureTool(downloaded from Microsoft)\n\n5. choose scene in MRTK example, change the profile into quest\n\n6. build and run\n\ncheck [this](https://www.youtube.com/watch?v=wSPXTRYxq9A&list=PLQMQNmwN3FvzWQ1Hyb4XRnVncvCmcU8YY&ab_channel=DilmerValecillos) and [this](https://www.youtube.com/watch?v=rb5GZVDREdk&ab_channel=DilmerValecillos) videos for details","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/05/18/ngrok-reverse-proxy-service.md","slug":"2023/05/18/ngrok-reverse-proxy-service","body":"# ngrok: A Reverse Proxy Service\n\nSometimes we need a HTTPs server to develop a web app, surely using mkcert can generate a local certificate. But by using `vite-plugin-mkcert`, I found the server is too easy to breakdown. So I decided to use [ngrok](https://ngrok.com/product) to build a reverse proxy service.\n","collection":"blog","data":{"type":"post","category":"fe"}},{"id":"2023/05/21/20th-week-web-BLE.md","slug":"2023/05/21/20th-week-web-ble","body":"# 20th week web BLE\n\nWatched The Long Season, nice story about the life of northeast China.\n\nWatched The Super Mario Movie, funny movie.\n\nTried to build MRTK on quest, quite simple but not as easy as web development.\n\nDid some research to build a [web BLE](https://googlechrome.github.io/samples/web-bluetooth/) project on my indoor biking device. Can use [nRF Connect](https://play.google.com/store/apps/details?id=no.nordicsemi.android.mcp&hl=zh&gl=US) to read what the BLEs send. But the simulator is deprecated, meaning I can't simulate a fake BLE device on my computer. I have to buy a BLE device to test it.I can't using web-BLE on iOS. [Bluefy](https://apps.apple.com/jp/app/bluefy-web-ble-browser/id1492822055) is a free app to test web-BLE on iOS.\n\nDid some research on [WebXR](https://immersiveweb.dev/).\n\nIt's amazing that web can do so much stuff.\n\n[Edge impulse](https://www.edgeimpulse.com/) puts ML into embedded devices, I won't dig it further. It's unbelivably cheap when I realized that a PR2040 board only costs 20CNY.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/05/26/tRPC.md","slug":"2023/05/26/trpc","body":"# using tRPC\n\n[tRPC](https://trpc.io/) is a RPC framework for TypeScript. A lot people compare it with graphql. After using it, I found out that they are not the same thing. GraphQL is more like Restful API. tRPC is a package to build Restful API with TypeScript.\n\nI suddenly realized that I can use GraphQL in cloud functions. Compared with Restful API, GraphQL can do many work with only one endpoint.\n","collection":"blog","data":{"type":"post","category":"fe"}},{"id":"2023/05/29/21st-week-cloudflare-workers-and-graphql-yoga.md","slug":"2023/05/29/21st-week-cloudflare-workers-and-graphql-yoga","body":"# 21st Week: Cloudflare Workers and GraphQL Yoga\n\nI've been working on adding a backend for qwert-learner.\n\nTo keep this App a static site, I decided to ditch the Restful API and use GraphQL instead. Since it only requires one endpoint. A lot schemes can found like Azure functions, AWS Lambda, Google Cloud Functions, DigitalOcean Functions and Cloudflare Workers. MongoDB Atlas is a cheap choice for database. But Cloudflare workers can use KV to store data, which is a better choice for me.\n\nCampared with Apollo Server, [GraphQL Yoga](https://the-guild.dev/graphql/yoga-server) is a lightweight one. Can be simply integrated with a lot providers like cloudflare. Here is the [document](https://the-guild.dev/graphql/yoga-server/docs/integrations/integration-with-cloudflare-workers).\n\nDeveloping cloudfalre workers is much easier with [wrangler](https://developers.cloudflare.com/workers/wrangler/). Can use [miniflare](https://miniflare.dev/testing/vitest) to do unit testing.\n\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/06/04/22nd-week-use-an-utra-wide-screen.md","slug":"2023/06/04/22nd-week-use-an-utra-wide-screen","body":"# 22nd Week: Use an ultra wide screen\n\nI added web sync on qwerty-learner, it's now available on [this site](https://qwerty-ochre.vercel.app/).\n\nThis week I bought a lot fans to nake sure my devices can survive the summer. I occasionaly found out that with an ultra wide screen can pick up my efficency. I always wanted to split the terminal window from vscode, with an wide screen, that's not a problem any more. So I found [CRU - custom resolution utility](https://www.monitortests.com/forum/Thread-Custom-Resolution-Utility-CRU). It adds new resolution to the graphic settings, like 2880x900.\n\nRarbg was down this week, guess I can not watch many movies for some time.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/06/09/thought-about-wear-os.md","slug":"2023/06/09/thought-about-wear-os","body":"# Thought about Wear OS\n\nRecently I watched [a Youtube video](https://www.youtube.com/watch?v=BUWZJuIqC2I&t=67s) about making a training tracker using Edge Impulse. Surprisingly an ESP32 can do so many ML things. That made me think why not implement it on Wear OS?\n\nI used to wear pebble in 2015, Gz it's been almost 10 years. After pebble ended its service, I stried serveral Chinese smart watches, no app stores. I like round watch, like moto 360. But it was too expensive. Three years ago, I bought it in only 200 yuan. Tried to develop flutter on it. Sadly I the power button was broken, so it's been useless for a long time.\n\nToday, I tried to wake it and using adb to trigger power button, it works!\n\n```shell\nadb shell input keyevent 4\n```\n\nI installed [Hankmi Appstore](https://hankmi.com/), found an APP to use float button as physical power button. Now I can develope a Wear APP on Android 7. Hooray!\n\nSome sad thoughts, Google didn't drop the wearOS support in China. A Chinese company is maintaining. And it is horrible. Most developer are middle school students, and they earn money by donations.\n\nSince I'm using an iPhone, an Apple Watch is the first choice. But I still want a round watch. Like Samsung Galaxy Watch 5. Luckily I have a Samsung tablet. What if I want to connect iPhone to my watch? Maybe adb can help, ha, a great idea!","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/06/11/23rd-week-book-computer-deep-dive.md","slug":"2023/06/11/23rd-week-book-computer-deep-dive","body":"\n# 23rd Week: Book computer deep dive\n\nI read 计算机底层的秘密, it's literally a book like CSAPP, but has more technology and less caculations.\n\nDifferences between processed, threads, coroutins.\n\nCISC and RISC， how CISI using hyper-threading to defeat RISC. That it is actually a RISC with multiple assembly lines in the chip.\n\nHow to use memory especially in multiple cores.\n\nSaturday, I tried to wake up my old moto 360 watch.\n\nSunday, I learnt some swift language grammar from swift 100 days. I also tried kotlin, I doubt that some one can remember so manny language sugars.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/06/19/24th-week-vscode.md","slug":"2023/06/19/24th-week-vscode","body":"# 24th week vscode\n\n## Wheel settings\n\nThis week I tried to make my RabbitDial, a cheap alternative to Surface Dial, work with Visual Studio Code. I learnt a lot about how to make a VScode extension. But it turns out I can just simply add some keyboard bindings on the wheel settings. This [link](https://learn.microsoft.com/en-us/windows/apps/design/input/windows-wheel-interactions) is about these settings. And this [link](https://learn.microsoft.com/en-us/uwp/api/Windows.UI.Input.RadialController?view=winrt-22621) talks about develop an C# APP.\n\n[These](https://github.com/microsoft/vscode-extension-samples) are the samples about making a VSCode extension.\n\nAnd there are some cool surface dial compatible open-source projects. [X-Knob](https://github.com/SmallPond/X-Knob). The [code](https://github.com/SmallPond/X-Knob) about sending Dial BLE signals might be useful.\n\n## TODOs on Rust\n\nThis week I bumped to an idea about graphql over FFI. I found some one published a [post](https://zhuanlan.zhihu.com/p/611516673) on ZhiHu.\n\nFound a document about how to use Rust on Android, [Link](https://google.github.io/comprehensive-rust/android.html).\n\n## Three.js or Babylon.js\n\nI checked a new [tutorial](https://sbcode.net/react-three-fiber/) about R3F. R3F has a component project called [drei](https://github.com/pmndrs/drei). But still, I think babylon.js has more build tools. And more [features](https://doc.babylonjs.com/features).\n\nI has been following a [guide project](https://doc.babylonjs.com/guidedLearning/createAGame\n), it's pretty old. I want to use react to refactor it.\n\nFound a [blog](http://louardongames.blogspot.com/search/label/Lessons%20from%20Suzy%20Cube) about game develop.\n\n## SwiftUI and RN\n\nAfter WWDC, I think it's time to learn some SwiftUI. I watched a [playlist](https://www.youtube.com/watch?v=OvLxxV7X1Is&list=PLuoeXyslFTubw4NtepDCis5tTqK37zT3Q&ab_channel=PaulHudson) from Paul Hudson. Swift is an interesting language, I will dig further.\n\nAlso I checked out a tutorial about [React Native](https://www.youtube.com/watch?v=ur6I5m2nTvk&list=PL4cUxeGkcC9ixPU-QkScoRBVxtPPzVjrQ&pp=iAQB), pretty simple.\n\n## The LAN does not work on Mac\n\nI found my LAN driver can not work on Mac OS.\n\n## ssh login WSL2\n\nThis is a [link](https://jmmv.dev/2022/02/wsl-ssh-access.html) about how to remotely login WSL2.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/06/24/25th-week-babylonjs.md","slug":"2023/06/24/25th-week-babylonjs","body":"\n# 25th week - BabylonJS\n\nThis week is all about BabylonJS. I was trying to refactor [Summer Festival](https://github.com/BabylonJS/SummerFestival) using [react-babylonjs](https://github.com/brianzinn/react-babylonjs) and [@preact/signals-react](https://www.npmjs.com/package/@preact/signals-react).\n\nGame developing is little different with UI developing. Since the canvas repaints in every frame. I don't need to care too much about the reactive system. In every frame, there is a pre-render function to pull state from the store.\n\nUnity can be used to export BabylonJS App. Using [Scene exporter](https://doc.babylonjs.com/communityExtensions/Unity/Exporter), it is a paid tool, can find a free alpha version on github. After using it, I found it can export gltf file, the code part is not helpful. Same situation in [needle engine](https://engine.needle.tools/docs/getting-started). (BTW, needle engine only works on node v16)\n\n[cannon](https://schteppe.github.io/cannon.js/) is deprecated now, it's been rewritten to [cannon.es](https://github.com/pmndrs/cannon-es). I strongly suggest to read these [code](https://github.com/brianzinn/react-babylonjs/blob/master/packages/static/content/examples/physics/BouncySphere.tsx\nhttp://grideasy.github.io/tutorials/Using_The_Physics_Engine\n) to use a physical engine in react-babylonjs.\n\n## Custom Resolution on Mac\n\n[betterdisplay](https://github.com/waydabber/BetterDisplay) is a paid extension to make dummy screens on Mac OS with a 7 days free trail.\n\n## WebXR\n\nThere are some CSS specs like `transform-style: detached;` is used in MR environment. [DOM-overlays](https://github.com/immersive-web/dom-overlays), I am not sure if it can show DOM in dual screen. If it can't, maybe using [html2canvas](https://github.com/niklasvh/html2canvas) can help? Then canvas UI framework like Flutter can have better performance, I guess.\n\nIn react-babylonjs, attach an HTML element to a mesh is simple, just use `Html` tag.\n\n## Faas\n\nI was thinking about run serverless functions on a local machine. I found [knative](https://cloud.google.com/knative/) and [openfaas](https://docs.openfaas.com/cli/build/ ). I didn't dig further.\n\n## FydeOS\n\nThis Friday, I tried FydeOS on my Cube tablet. rotation not working, camera was off. The camera can not work on Ubuntu either. It's an Intel AV Camera 2500, I found a surface [repository](https://github.com/linux-surface/linux-surface) trying to crack it. I think I will try Ubuntu on my machines this weekend, running Windows is too hot in this summer.\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/06/29/FNL-23.md","slug":"2023/06/29/fnl-23","body":"# Friday Night Live 6-23\n\nWelcome to the News quiz, recorded this week at the Hay Festival and with the Chelsea Flower Show also taking place this week, we hope finally to have a conclusive answer to the question, which is better, books or shrubs?\n\n欢迎来到本周在干草节上录制的新闻测验，本周还将举行切尔西花卉展，我们希望最终对这个问题有一个决定性的答案，书籍还是灌木哪个更好？\n\nWhat do you think, Hay? Well the final definitive verdict will be revealed at the end of this week's News quiz. Hello, I'm Andy Zotsam.\n\n你怎么看，海伊？那么最终的最终裁决将在本周的新闻测验结束时揭晓。你好，我是安迪·佐察姆。\n\nThis show is taking place under the wachful fist of the new BBC Verify service, which alerts listeners to when something less than 100% true might be being broadcast, under the new system, as long as what I say is completely true, the sound of a mooing cow will be audible.\n\n这个节目是在新的BBC Verify服务的拳头下进行的，该服务提醒听众，当播放的内容可能低于100%真实时，在新系统下，只要我说的是完全真实的，哞哞牛的声音就会被听到。\n\nPoint proved.\n\n证明了。\n\nIn this Hay versus Chelsea week, pitting literature, some of which is very sad against gardening, our two teams this week, our team, Readed and Weep, against Team We didn't Read.\n\n在这个海伊对切尔西的一周里，把文学，其中一些是非常悲伤的，对抗园艺，我们这周的两个团队，我们的团队，里德和哭泣，对抗团队，除草和收割。\n\nOn Team Reeded, we have Lucy Porter and from the spectator Kate Andrews. On Team Weeded, it's Simon Evans and Robin Morgan.\n\n在里德队，我们有露西·波特和观众凯特·安德鲁斯。 Team Weeded 的成员是西蒙·埃文斯 (Simon Evans) 和罗宾·摩根 (Robin Morgan)。\n\nAnd to fit in with all the book-bothering novel-nuzzling literature lovers here in Hay, we are converting some of this week's news stories into different literary styles.\n\n为了适应这里的所有书籍打扰小说蠕动文学爱好者，我们将本周的一些新闻故事转化为不同的文学风格。\n\nI'll read a passage from a made-up novel. Our panelists then have to tell me what factual news stories are the fictional bits of fiction about.\n\n我会读一段虚构的小说。然后我们的嘉宾要告诉我，哪些事实新闻故事是虚构的小说。\n\nNow, to begin with, Kate and Lucy, your chosen literary style that I've chosen for you is detective story.\n\n现在，首先，凯特和露西，我为你们选择的文学风格是侦探小说。\n\nSo, tell me, what is this excerpt about? What we have here, my dear Watson, said Holmes, is something that is going up and down at the same time.\n\n那么，告诉我，这段摘录是关于什么的？我们在这里有什么，亲爱的沃森，福尔摩斯说，是一些在同一时间上下起伏的东西。\n\nBut Holmes, I replied, how can that be unless it's a donkey on a pogo stick? So, what is that story about?\n\n但是，福尔摩斯，我回答说，除非它是一个在跳跃棒上的驴子，否则怎么可能呢？那么，这个故事是关于什么的？\n\nSpeaker2: Well, I suppose it's inflation, which is going up, only slower than it used to, like me getting out of a bath. Or what a big jagger's erections.\n\n说话者2: 嗯，我想这是通货膨胀，通货膨胀正在上升，只是比以前慢，就像我从浴缸里出来一样。或者一个大的杰格的勃起。\n\nHow much empirical research have you done? I can't get no satisfaction, I mean. So, inflation, It's still absolutely nuts.\n\n你做了多少实证研究？我不能得到满足，我的意思是。所以，通货膨胀，仍然是绝对的疯狂。\n\nSome of the inflation statistics cheese is 39% more expensive than it was 12 months ago. Milk, 33% more than 12 months ago.\n\n一些通货膨胀统计数据显示，奶酪比12个月前贵39%。牛奶比12个月前贵33%。\n\nGranulated sugar, 47%, which is terrible news for me because all I ever eat is sweet, cheesy milkshakes.\n粒状糖，47%，这对我来说是个可怕的消息，因为我吃的都是甜的，奶酪奶昔。\n\nThat's what makes jagger cosy as well as that.\n\n这也是杰格舒适的原因。\n\nSpeaker1: Family show, everyone.\n\n演讲者1: 全家秀，每个人。\n\nSpeaker3: Inflation is the one thing that arguably isn't the government's fault right now because the tools top control it are held by the Band of England.'\n\n说话者3: 通货膨胀是唯一一件现在不是政府的错的事情，因为控制它的工具是由英格兰银行持有的。\n\nAnd it's the one thing where Rishi Sunak and Jeremy Hunter, like we're going to make videos, we're going to make TikToks, and we're going to convince them that this is our fault.\n\n这是唯一一件里希·苏纳克和杰里米·亨特都要做的事情，就像我们要制作视频，我们要制作TikToks，我们要说服他们，这是我们的错。\n\nThe rate of inflation is coming down. Do not be fooled. That means that prices are going up just at a slower pace. Your costs are not coming down.\n\n通货膨胀率正在下降。不要被愚弄了。这意味着价格上涨的速度只是放缓了。你的成本没有下降。\n\nInterest rates are going up to try to get people to save a bit more money, to try to take some demand out of the economy.\n\n为了让人们多存一些钱，为了从经济中抽出一些需求，利率正在上升。\n\nIt's not going well. And everyone's just feeling that pinch from higher prices and higher interest rates.\n\n这不是很好。每个人都感觉到了高物价和高利率带来的压力。\n\nBut great news is that the International Monetary Fund thinks we might not have a recession.\n\n但是好消息是，国际货币基金组织认为我们可能不会陷入衰退。\n\nTo be very clear, the economy is not going to grow, but we might not have a recession. You are welcome.\n\n非常清楚，经济不会增长，但我们可能不会陷入衰退。不客气。\n\nSpeaker2: I feel certainly a little bit sorry for the government if they are trying to do it, or even the Bank of England.\n\n说话者2: 如果他们试图这样做，甚至是英格兰银行，我确实有点同情政府。\n\nIf you say they have the tools but it amounts to interest rate rise, you have to put interest rates up quite high for me to pause in front of the cheese counter and consider investing instead.\n\n如果你说他们有工具，但这相当于利率上涨，你必须把利率提高到相当高的水平，我才会在奶酪柜台前停下来，考虑投资。\n\nSpeaker 4  4:40  \nGrowth is now predicted at 0.4%. Hold on to your hats everyone. Things are about to get wild. So are we seeing the benefits in this growth because it's now proved to be a bit better than Germany's? we've seen the benefits of having crashed our economy harder than other countries. So we can get statistically better on the rebound.\n\n增长预计为0.4%。大家都认为我们即将疯狂。我们是否看到了这种增长的好处，因为现在它被证明比德国好一点，我们看到了比其他国家更严重地破坏我们的经济的好处。所以我们可以在反弹时统计上变得更好。\n\nSpeaker 1  4:58  \nThat was one of the best things about The announcement, wasn't it, we're no longer at the bottom. That's like Eurovision. Because the bottom is Germany like Eurovision.\n\n这是答案中最好的事情之一，不是吗？我们不再处于最低点。这就像你的视觉。因为底部是德国，就像你有视觉一样。\n\nSpeaker 6  5:08  \nThat might as well be how the forecasts work given how wrong they've been for so long now,\n\n考虑到他们现在已经错了这么久，这可能就是预测的工作方式。\n\nSpeaker 7  5:12  \nGermany has literally gone into recession today, right, which is obviously due to Brexit. We knew it Katam on the RC eventually.\n\n德国今天确实陷入了衰退，对吧，这显然是由于英国脱欧。我们知道这一点，最终会被OS抓住并运行。\n\n\nSpeaker 4  5:23  \nYes, I don't remember the bus was the let's drag them all downwards.\n\n是的，我记得公共汽车是让我们把他们都拖下水的。\n\nSpeaker 1  5:28  \nEverything is way more expensive. Last week, I accidentally did the big shop in Tesco and forgot my club card and I've had to file for bankruptcy.\n\n那里的一切都要贵得多。上周，我在乐购超市不小心买了很多东西，忘了我的俱乐部卡，我不得不申请破产。\n\nSpeaker 7  5:37  \nI don't know if this is a universal thing. So forgive me if this is something not available in hay. But I work a couple of nights a week near to an m&s food hall, which shuts at 9pm and I generally arrive around 8pm and everything has got yellow stickers on it. Now I don't know if that was always the case. But things in m&s that previously cost five pounds 80 coming down to one pound 48 is like way more exciting when in a time of peak inflation. It's like they've managed to bring the excitement of shopping at TK Maxx into the delicatessen totally on board with that really happy to be paying an extra 500 quid a month on my mortgage\n\n我不知道这是不是一个普遍的事情。所以如果这是一些干草中没有的东西，请原谅我。但是我一周工作几个晚上，离m&s食品大厅很近，那里在晚上9点关门，我通常在晚上8点左右到达，所有的东西都贴着黄色的标签。现在我不知道以前是否总是这样。但是在m&s中，以前花费5英镑80的东西降到1英镑48，这在通货膨胀高峰期更加令人兴奋。就像他们设法把在TK Maxx购物的兴奋带到了熟食店里，完全赞成这一点，很高兴每个月多付500英镑的抵押贷款\n\nUnknown Speaker  6:15  \nIt's a plain middle class supermarket suite.\n\n玩中产阶级超市甜蜜。\n\nSpeaker 4  6:18  \nAnything else jumped out at you recently, Kate from the state of economy, and then how we interpret them, the numbers around it cause him to look at it in a very sort of short term way, as you were saying that, you know, inflation has come down. But in the broad picture, it's still very\n\n最近还有什么事情让你印象深刻，凯特从经济状况以及我们如何解读它们的数字中，因为他们看待它的方式非常短期，正如你所说，你知道，通货膨胀已经下降。但在广泛的图片中，它仍然是非常\n\nSpeaker 6  6:32  \nhigh. Well, this is the thing, you're just getting different voices at different times, virtually saying the same thing. Just depends on the headlines. So when the IMF was predicting that the UK would be at the bottom and we would be in recession, you know, you had half of the population being like, look at how atrocious this , things are going so poorly. They haven't revised their figures very much. They're still in the margin of error. But those people are quiet now now that we're into  0.4% Exciting. You have the other side of the population. Very excited saying what a great news story. The truth is, it's just very bad. It's been very bad for a long time. And it looks like it's going to be a rough rest of the year. Sorry.\n\n高。这就是问题所在，你只是在不同的时间得到不同的声音，几乎在说同样的话。只取决于标题。所以当国际货币基金组织预测英国将处于最低点，我们将陷入衰退时，你知道，你有一半的人口在说，看看这是多么可怕，事情进展得如此糟糕。他们没有对自己的数字进行很大的修正。他们仍然处于误差范围之内。但是这些人现在很安静，现在我们进入了0.4%的激动人心的时刻。你有人口的另一面。非常兴奋地说这是一个很好的新闻故事。事实是，这很糟糕。很长一段时间以来一直很糟糕。看起来今年剩下的日子会很艰难。对不起。\n\nSpeaker 7  7:11  \nI would imagine that Sunak is in Fen hunt. Inflicting more pain on us now than is strictly necessary in order to be able to relieve a little bit of that pain in the run up to the general election next year. They kind of go, oh, look, everything's super rosy in the garden. And we can afford to lower interest rates again, and we can afford to introduce I don't know special loans or windows for school or something I don't know just like some kind of little bonus. Well, they\n\n我想萨纳克在芬亨特。现在对我们造成的痛苦比严格必要的要多，以便能够在明年大选前减轻一点痛苦。他们会说，哦，看，花园里的一切都很美好。我们可以再次降低利率，我们可以负担得起引入我不知道的特殊贷款或学校窗户之类的东西，我不知道，就像某种小奖金一样。好吧，他们\n\nSpeaker 6  7:37  \nhave managed to bring the tax burden to a 70 year high basically a post war high and the idea is that we'll get some tax cuts going into the next election. We'll probably then be at like a 72 year high somehow but the idea is yeah, maybe something superficial is coming our way. I think they're just gonna\n\n他们设法将税收负担提高到了70年来的最高水平，基本上是战后的最高水平，而且这个想法是，我们将在下一次选举中获得一些减税。我们可能会达到72年的高峰，但是想法是，是的，也许有些肤浅的东西正朝我们走来。我想他们只是要\n\nUnknown Speaker  7:53  \nyellow sticker the economy.\n\n黄色的标签经济。\n\nSpeaker 4  7:57  \nInflation is coming down, but food prices remain worryingly high growth is set to be much better than expected at just pretty rubbish. Interest rates are rising, the number of people interested is falling and the number of facts in the world is at an all time high. Unfortunately, so is the proportion of those facts that are in fact false. \nThe IMF has therefore described Britain's outlook as subdued, which is a step up on its previous official status of curled up on the sofa quietly weeping. \nAnother political story and your literary genre Simon and Robin for this is sci fi. The captain stood eagerly awaiting the figures, the screen bleeped futuristically. What's the reading Lieutenant 606 and heading up Captain. What Weren't we aiming for? Like 100 Max and going down? Not up? Sorry, Captain. It's out of control. Don't say that Lieutenant. Even if it's obviously true. What's the story?\n\n通货膨胀正在下降，但食品价格仍然令人担忧，增长预期将比预期的要好得多，只是相当垃圾。利率上升，感兴趣的人数下降，世界上的事实数量达到了历史最高水平。不幸的是，事实上，这些事实的比例也是如此。因此，国际货币基金组织将英国的前景描述为低迷，这是对其先前的官方地位的一种提升，即在沙发上安静地哭泣。另一个政治故事，你的文学体裁西蒙和罗宾，这是科幻小说。船长急切地等待着数字，屏幕发出了未来主义的蜂鸣声。中尉606，船长上升。什么？我们不是要瞄准吗？像100 Max一样，下降？不是上升？对不起，船长。它失去了控制。不要说那个中尉。即使显然是真的。这是怎么回事？\n\nSpeaker 7  8:48  \n606 rings a bell 606,000 with the immigration requisition. historically high though, I do think we've been prepped for them by being warned they could go as high as a million. So you go 606,000 That's barely your Drupal. Is it really, you know, that's just easily dispersed across Herefordshire. I listen, it's a very obviously, it's an extraordinarily complex issue, immigration, whether it's good and bad. There are some examples that are good. There are some examples that are bad. It's obviously an ongoing worldwide concern, blah, blah, blah. However, Sunak did promise to get it under control. And when he was asked whether the fact that it was six times the level he promised meant that it was out of control. He said No, it's not out of control. It's just some external factors that have I got a feeling if I was caught doing 180 miles per hour in a 30 zone and was accused of my car being out of control and either no no, no, no, not out of control. There was some external factors. I don't think that would play well. So I think they have to take the L on this\n\n606响起了606,000与移民征用有关。历史上最高的，但我认为我们已经被警告过，他们可能会高达一百万。所以你去606,000，那几乎是你的Drupal。真的吗，你知道，这很容易分散在赫里福德郡。我听着，这显然是一个非常复杂的问题，移民，无论是好是坏。有一些例子是好的。有一些例子是坏的。显然，这是一个全球性的持续关注，等等。然而，萨纳克确实承诺要控制它。当被问及他承诺的水平是六倍时，他是否意味着失控时，他说不，它没有失控。只是一些外部因素，我有一种感觉，如果我在30区域以每小时180英里的速度被抓住，并被指控我的车失控，要么��\n\nUnknown Speaker  9:51  \none you could apply for a personal speed awareness course.\n\n你可以申请个人速度意识课程。\n\nSpeaker 4  9:59  \nBlame me on X Total factors basically saying, Oh, yes, it is out of control. Yeah, that's what control.\n\n基本上是怪我，说，哦，是的，它失去了控制。是的，那就是控制。\n\nSpeaker 7  10:04  \nI mean, you know, yeah, there is Ukraine. There is Hong Kong. I mean, they're trying to deal with this student visa business at the moment which they've introduced some legislation to stop any student coming over bringing their entire extended family, which possibly, I mean, it sounds like that's been abused. \nI don't know. \nWhat annoys me is we have to put up with Gary Lineker, scolding us about the 30 style fascist rhetoric. And we still have to put up with absolutely extraordinary levels of immigration as well. You think the government would either be proper working fascist? Or what did that their rhetoric to the reality of what they're delivering, you know, one or the other, but I feel like we're getting the worst of both worlds at the moment. To be honest, it's not on on radio for you got an outright call for fascism.\n\n我的意思是，你知道，是的，有乌克兰。有香港镜子。我的意思是，他们正在试图处理这个学生签证业务，他们目前已经引入了一些立法，以阻止任何学生过来带来他们的整个扩展家庭，这可能，我是说，听起来像是被滥用了。我不知道。让我恼火的是，我们必须忍受加里·莱内克（Gary Lineker）对我们进行30种风格的法西斯主义言论的斥责。我们仍然不得不忍受绝对非凡的移民水平。你认为政府要么是合法的法西斯主义者？或者他们的言论与他们所提供的现实相符，你知道，一个或另一个，但我觉得我们现在正处于两难境地。老实说，这不是在广播上，你为法西斯主义直接呼吁。\n\nI don't know you and yours every day.\n\n我不认识你，你每天都在。\n\nSpeaker 1  10:50  \nNot only went on the radio today, he also went on ITV this morning to sort of say he's gonna get numbers down, I think just to get advice, because in the last week, ITV have cut the numbers of Phil and Holly by 50%.\n\n他今天不仅上了广播，而且今天早上还上了ITV，以便说他要把数字降下来，我认为只是为了得到建议，因为在过去的一周里，ITV已经把菲尔和霍利的数字减少了50%。\n\nSpeaker 5  11:01  \nBut yeah, he's sticking to migration to the UK is still too high. He says, and he's gonna have a word with the person responsible next time he passes a mirror.\n\n但是是的，他坚持认为移民到英国的人数仍然太高。他说，下次他经过镜子时，他会和负责人说话。\n\nSpeaker 6  11:11  \nThe difficulty for the government is not only did they revise the system back in January 2020, and Boris Johnson with the ultimate Brexit to revise the system and, and made it into one where it's actually easier for non EU migrants to come in. The difficulty is when you break these figures down, in particular, for 2022. A huge part of this influx was the refugee program, especially with Ukraine, which, you know, virtually everybody is positive about. You also had a big influx of health and social care workers at a time where the NHS is virtually on its knees. And so everyone's looking at these figures saying, oh, gosh, they're way too high. But the difficulty is, who do you want to get rid of? Who do you want to get rid of?\n\n政府的困难不仅在于他们在2020年1月修改了系统，而且鲍里斯·约翰逊（Boris Johnson）最终修订了系统，使其成为非欧盟移民进入的更容易的系统。困难在于，当您分解这些数字时，特别是2022年。这种涌入的巨大部分是难民计划，尤其是乌克兰，几乎每个人都对此持肯定态度。您还有大量的卫生和社会保健工作者涌入，而此时NHS几乎处于崩溃边缘。因此，每个人都在看着这些数字说，哦，天哪，他们太高了。但是困难在于，您想要摆脱谁？你想摆脱谁？\n\nSpeaker 4  11:55  \nWell, that's, that sounds like a very promising pitch for a new reality show. Do you know else tonight called this morning? He made a shocking admission. I'm gonna share this with people of high on why at the literary festival of something that he liked. Does anyone know what it was?\n\n好吧，这听起来像是一个非常有前途的新真人秀节目。你知道今晚还叫今天早上吗？他做出了令人震惊的承认。我要与高人分享这个，为什么在文学节上他喜欢的东西。有人知道是什么吗？\n\nSpeaker 6  12:12  \nIt was Julie Cooper, wasn't it? Yes. Yep. Wow fan of those novels.\n\n是朱莉·库珀（Julie Cooper），不是吗？是的。是的。哇，那些小说的粉丝。\n\nSpeaker 7  12:16  \nIs she here this week. Julie Cooper was like the JK Rowling of her generation she got so many young men into reading back in the day.\n\n她这周在这里吗。朱莉·库珀（Julie Cooper）就像她那一代的JK罗琳（JK Rowling），她在当时吸引了很多年轻人阅读。\n\nSpeaker 4  12:27  \nIts net migration figures are out this week. 606,000 weigh up on pre Brexit additional numbers. Government Solutions suggested currently include standing on the White Cliffs of Dover growling. Pumping a psychotropic drug into the water system that makes people yearn to pick fruit for subtle money.\nI suggested this week by the government stopping relatives of overseas students coming here. So still letting most of the people come here, but make them less happy whilst they're here, which might work but at least we've taken back control after Brexit. And we've used that control to choose to lose that control again. on our own terms, this is our British chaos, our British failure. And in many ways when you think about it, Brexit has proven to be that rarest of political beasts the perfect compromise those who wanted it, got it. And those who thought it would be a terrible Hi,\n\n本周的净移民人数为606,000，比英国脱欧前的额外人数高。政府目前提出的解决方案包括站在多佛尔白崖上咆哮。将一种精神药物注入水系统，使人们渴望为微妙的钱摘水果。政府本周建议停止海外学生的亲属来到这里。因此，仍然让大多数人来到这里，但让他们在这里的时候不那么开心，这可能有效，但至少在英国脱欧后，我们已经重新控制了局面。我们已经使用了该控制来选择再次失去该控制。在我们自己的条件下，这是我们英国的混乱，我们英国的失败。从许多方面来看，当您考虑它时，英国脱欧已被证明是政治上最罕见的完美妥协，那些想要它的人得到了它。那些认为这将是可怕的人\n\nUnknown Speaker  13:20  \nI'm Pat Kelly. And I'm Peter roll dring\n\n我是帕特·凯利（Pat Kelly）。我是彼得·罗尔·德林（Peter roll dring）\n\nSpeaker 8  13:23  \nand we're the hosts of this is that are you kidding? For over a decade we were radios go to source for completely fabricated news. You must be kidding me and now we're back in podcast form.\n\n我们是这是你在开玩笑吗？十多年来，我们一直是广播电台的主要来源，用于完全捏造的新闻。你一定在和我开玩笑，现在我们以播客形式回来了。\n\nSpeaker 9  13:34  \nWe've selected some of our favorite stories from over the years and put them in one convenient location in the\n\n我们从多年来的一些最喜欢的故事中挑选出来，并将它们放在一个方便的位置\n\nSpeaker 8  13:42  \ndog park charging to see wildlife This is that coming soon on CBC listen and everywhere you get your podcasts idea, I've seen those fears justify. Everyone has got something of what they want it. Okay, Lucy and Kate you can choose on next literary genre. What would you like? You pick?\n\n狗公园收费观看野生动物这是即将在CBC听到的地方，以及您获得播客的地方的想法，我已经看到了那些恐惧的正当理由。每个人都得到了他们想要的东西。好的，露西和凯特，您可以选择下一个文学体裁。你想要什么？你挑？\n\nUnknown Speaker  14:04  \nWell, Julie Cooper, some sort of horsey bonk buster.\n\n好吧，朱莉·库珀（Julie Cooper），某种马背上的邦克·巴斯特（bonk buster）。\n\nSpeaker 4  14:09  \nSorry, you're getting zombie story. Here we go. What story is this about early morning 7:59am. They swept around the corner howling and they're desperate definitely multitude ignoring the living they rampage down the street until they reached the GP surgery. It was 8am on the nose. The angry receptionist emerged. I've told you a lot before you have to ring for an appointment. And it's 801 now so you're too late. What story is this? Milan might have laid it slightly too clearly on the table.\n\n抱歉，您会得到僵尸故事。我们来看看这个故事是关于早上7:59。他们大声喊叫，他们绝望地忽略了生活，他们在街上肆虐，直到他们到达了GP手术室。现在是准时的8点。愤怒的接待员出现了。我以前告诉过你很多次，你必须打电话预约。现在是801，所以你太晚了。这是什么故事？米兰可能已经将其放在桌子上了。\n\n\nSpeaker 6  14:42  \nDare I say this is about patients seeking out more private health care? Yes, correct because they cannot see a GP on the NHS. We have record numbers of people now paying for private health care. It has jumped up to 272,000 That's up from just under two 100,000 Before the pandemic hit, and this is really a pandemic story, because the NHS told us to stay home and they have never asked us to come back out really. And so unfortunately, patients have had to go seek health care elsewhere. And the waiting list on NHS Wales alone is over 700,000 appointments. You know, there's very little good news story here, I suppose, apart from the fact that, you know, if you really support this idea of universal access, you can be confident that universally at the moment, people cannot access health care.\n\n我敢说这是关于患者寻求更多私人医疗保健的故事吗？是的，正确的，因为他们无法在NHS上看到GP。我们现在有创纪录的人数为私人医疗保健付费。这已经从疫情爆发前的不到20万跃升至272,000，这实际上是一项大流行的故事，因为NHS告诉我们要呆在家里，他们从未要求我们真正回来。因此，不幸的是，患者不得不去其他地方寻求医疗保健。仅在威尔士NHS的等候名单上就有70万多个预约。我想，除了事实之外，你知道，如果你真的支持这种普遍接触的想法，你可以相信，目前人们无法普遍接触医疗保健，这里几乎没有什么好消息。\n\nSpeaker 5  15:30  \nI was thinking when they say, oh, people are going private for their operations, I just go well, I want my operation privately. I don't want anyone whipping something out when I'm in Tescos is better I had my eyebrows waxed once in Superdrug and she had to stop because I was crying so much. And it's the prices are extraordinary. So, a new hip privately, which loads of people in desperation are turning to very trendy 15,075 pounds, which I don't know what the 75 pounds is for it. But if you don't pay the 75 pounds and you get one that squeaks every time you've paid 75 credits for the WD 40 I mean, it is shocking and terrifying, isn't it? My dad had his hip replaced shortly before he passed and I'm wondering if I can dig him up in habit.\n\n我想当他们说，哦，人们正在私下进行手术时，我只是说，好吧，我想私下进行手术。我不想在我在特斯科斯（Tescos）时有人拿出东西，这是我在超级药店（Superdrug）中脱毛的时候，我想过一次，她不得不停下来，因为我哭得很厉害。价格是非常出色的。因此，私下进行新的髋关节手术，许多绝望的人都在转向非常时尚的15,075英镑，我不知道75英镑是什么。但是，如果您不支付75英镑，而且每次支付75英镑，您都会发出吱吱声，那么您将获得75英镑的WD 40，这是令人震惊和令人恐惧的，不是吗？我爸爸在去世前不久换了髋关节，我想知道我是否可以挖掘他并习惯他。\n\nUnknown Speaker  16:28  \nOnce again, we find ourselves in the moral right to dig up relatives and use their body.\n\n我们再次发现自己在道德上有权挖掘亲戚并使用他们的身体。\n\nSpeaker 1  16:37  \nI'm glad you've asked me. And just a slight word of warning. Obviously we are in Wales and I think you should know if we do say private to healthcare three times the ghost of an Ireland Bevin will turn it behind. And he will give you an appendectomy\n\n\n我很高兴你问我。显然，我们在威尔士，我认为你应该知道，如果我们确实说私人医疗保健三次，爱尔兰·贝文（Ireland Bevin）的幽灵就会转身。他会给你切除阑尾\n\nUnknown Speaker  16:52  \nbecause it's quite the situation is quite bad in Wales. Yeah, it's a strange one. I think obviously, obviously, we're a poor nation, I think we have an older generation. So obviously, we're going to need more health care. But I think the Welsh Government are sort of quite defensive about it, because they've obviously got these huge waiting list figures sort of to come out defend themselves. They said, if you exclude seven specialties, which were exceptionally challenging, the numbers dropped by 86%. And those specialties include orthopedics, dermatology, general surgery, ophthalmology, and Ear, Nose and Throat. So to put that into context, if you exclude every area of the body, it drops by 100%. You can't argue with those numbers.\n\n因为威尔士的情况很糟糕。是的，这是一个奇怪的情况。我认为显然，我们是一个贫穷的国家，我认为我们有一个老一代。显然，我们需要更多的医疗保健。但是我认为威尔士政府对此有些防御性，因为他们显然有这些巨大的等待名单数字，以便为自己辩护。他们说，如果您排除了七个特殊的专业，这些专业非常具有挑战性，那么数字将下降86％。这些专业包括骨科，皮肤科，普外科，眼科和耳鼻喉科。因此，为了将其放入上下文中，如果您排除身体的每个部位，它将下降100％。您无法与这些数字争论。\n\nSpeaker 5  17:27  \nIf you want to get your hair cut, you're fine.\n\n如果您想剪头发，那就没问题了。\n\nSpeaker 7  17:31  \nI think they we have to recognize that some of the decisions made during COVID were catastrophic that they were wrong, we should have avoided up the long term consequences. These huge waiting lists to people are still waiting to see serious life threatening diseases canceled and so on. And also it's created in a huge number of people long COVID which is rendering the civil service inoperable. Now, I'm not saying long COVID doesn't exist, I absolutely believe it is very much a very real condition and my sympathy goes to people who have it but let's be honest, it's never very hard to guess who's going to get it is what I mean.\n\n我认为他们必须认识到，COVID期间做出的一些决定是灾难性的，他们是错误的，我们应该避免长期后果。这些巨大的等待名单，人们仍在等待看到严重的生命威胁性疾病被取消等等。而且，它还为大量的人创造了长期的COVID，这使公务员无法运作。现在，我并不是说长期的COVID不存在，我绝对相信这是一种非常真实的疾病，我对患有此病的人表示同情，但是让我们诚实地说，很难猜出谁会得到它是我所指的。\n\nUnknown Speaker  18:07  \nIf you'd like to tweet in, you can use that they won't be able to tweet, they're too tired.Simon just thinks you should if you need to hit replace, just walk it off love.\n\n如果您想发推文，可以使用它们无法发推文，他们太累了。西蒙（Simon）只是认为，如果您需要击中替换，只需走开就可以了。\n\nSpeaker 4  18:24  \nIn terms of the future, the future the NHS do, we think was the way it's going to end up is like a three strikes and you're out. You get three goes on the NHS in your lifetime. And if you've blown them, then you're on your own.\n\n就未来而言，我们认为NHS的未来是三次罢工，您就会被解雇。您一生中有三次机会在NHS上。如果您吹了它们，那么您就是自己。\n\nSpeaker 1  18:36  \nI mean, it doesn't make sense I think in some aspects of it if you can afford to and you want to then go for prime I had a vasectomy 18 months ago and I have mine with a Groupon.\n\n我的意思是，在某些方面，这是没有意义的，如果您有能力并且想要，那么就去做吧。我18个月前做了结扎手术，我和Groupon一起做了。\n\nSpeaker 4  18:49  \nAs the old saying goes we can't take the heat get out of the kitchen and buy heat I mean agonizing wait for treatment and by kitchen I mean the NHS waiting list. As a result of the problems getting NHS treatment more and more people are now taking surgery into their own hands. Many people just saying are without professional supervision. Some are conducting preliminary exorcisms on themselves the NHS waiting lists for that is terrible these days. And also there's been a significant increase in home trepanning please, if you're going to do that, do invest in an electric drill. The scores at the end of that round are four points all moving on to politics now this is for Robin and Simon a ghost story. And just to remind you some of the characters in these made up excerpt from novels have had their names fictionalized. So here's your ghost story. Reenact sushi. Work with a star in his heavily braided gold crusted pajamas. The familiar apparitions aperitive before his eyes why will they not leave me be welp the frightened but fun size 43 year old Prime Minister why Do they never go away? What is that about?\n\n正如老话所说，我们不能承受热量，离开厨房并购买热量，我的意思是痛苦的等待治疗，而厨房的意思是NHS等待名单。由于在NHS治疗方面存在问题，越来越多的人现在正在自己动手进行手术。许多人只是说没有专业监督。有些人在自己身上进行初步的驱魔。这些天，NHS的等待名单很糟糕。此外，家庭开颅术的数量也大幅增加，请务必购买电钻。这一轮结束时的得分是四分，现在转向政治，这是罗宾和西蒙的鬼故事。只是提醒您，这些虚构小说摘录中的一些人物已经被虚构了。因此，这是您的鬼故事。重新演绎寿司。与他的重度编织的金色镶边睡衣一起工作。熟悉的幽灵在他眼前出现了，为什么他们不会离开我？为什么他们永远不会消失？这是怎么回事？\n\nSpeaker 7  20:04  \nThis is a believer and attempt I don't know exactly where it's coming from to reintroduce the notion of Boris Johnson and his lax approach to after hours drinking culture in Westminster back into the agenda. We feel like we're coming to the end of a long Tory government and it is very similar for those of you remember when we came to the end of the major administration, building up to Tony Blair, they're just kind of pulling limbs off and gnawing on them in front of us now. You attempt to make suella Braverman One minute she's a Nazi the next minute she's like, tried to get a single service portion of a speed awareness was I don't maybe that was an artsy thing to maybe Hitler's whole autobarn project was to help gorilla evade a speeding fine, I don't know. It just feels like they're just constantly pulling lumps of flesh off the last administration now and just holding it up for your delectation.\n\n这是一个信徒和尝试，我不知道它来自哪里，以重新引入鲍里斯·约翰逊（Boris Johnson）和他对威斯敏斯特（Westminster）的工作时间饮酒文化的放松的观点。我们感觉自己即将结束长期的托利党政府，对于那些记得我们结束了梅杰（major）政府的人来说，这是非常相似的，建立在托尼·布莱尔（Tony Blair）的基础上，他们只是在我们面前把四肢拔下来并咬下来。现在，您尝试使suella Braverman一分钟成为纳粹，下一分钟她就像是，试图获得单一服务部分的速度意识，我不知道也许那是一个艺术家的事情，也许希特勒的整个汽车项目是为了帮助大猩猩逃避超速罚款，我不知道。现在，他们似乎只是不断地从上届政府中拔下肉块，然后将其举起来供您享用。\n\nSpeaker 5  20:51  \nBut I think when you set your stall out is professionalism, integrity and accountability. And we're being constantly reminded that Braverman thing I think it's extraordinary that she was caught speeding, heard someone being caught speeding, you do think Michael Gove immediately but it was the very real value she was speeding and veering to the extreme right was why they pulled over but yeah, yeah, it's just with Boris Johnson and Sorella Braverman is, you know, she said, Oh, nothing untoward happened was her way of candidate which is this kind of thing. nothing untoward happened. It's the kind of thing you'd hear said by a sort of middle aged man coming back from the Christmas party smeared with lipstick, missing his trousers or Boris Johnson every day. But the problem at the moment is that it's personal between Boris Johnson and Rishi Sunak. So whenever things are looking a little shaky for the current Prime Minister, the ghost of the former one shows up and he likes to pop up and make things harder. And we have to go back with the story because Sunak was the second person to resign and Boris Johnson's cabinet, which ultimately led to him resigning. And you know, this could in theory be like a tale of scorn lovers. It could be a family feud. It's so intense. But even this gets rumors swirling that letters of no confidence are going in against what you see now from Boris Johnson's allies. Now, I suspect that these are seriously overhyped, because the only thing more difficult for the Tory party than the situation they're in now is the situation they were in then. But it's pretty psychodrama in there. Well, I mean, when it comes to suella, Braverman there was some talk that she might be fired again this week. In fact, we just received some breaking news that suella Braverman was in fact sacked as Home Secretary by Rishi Sunak before being reappointed, 12.8 seconds later. even quicker than the record six days sacking she enjoyed last year and from now on, she will be ceremonially sacked every morning at 7:30am and reappointed at 7:32am. A quick Boris Johnson question, what is the most appropriate genre for a Boris Johnson question? Literally? Erotic thriller Correct? Yes. So specifically, what is this about? I want to see them show me them now. Putting them on the table. Let's have a look.\n\n但我认为，当你摆出摊位时，就是专业精神、诚信和责任感。 我们不断被提醒，布雷弗曼的事情，我认为她超速被抓，这是非同寻常的，听到有人超速被抓，你确实会立即想到迈克尔戈夫，但这是她超速行驶并转向极右的真正价值，这就是为什么 他们把车停在了路边，但是，是的，是的，这只是鲍里斯·约翰逊和索雷拉·布雷弗曼，你知道，她说，哦，她的候选人方式没有发生任何意外，就是这样的事情。 没有发生任何不愉快的事情。 这是一种你会听到一位中年男人说的话，他从圣诞晚会回来，身上涂满了口红，每天都想念他的裤子或鲍里斯·约翰逊。 但目前的问题是鲍里斯·约翰逊和里希·苏纳克之间存在私人问题。 因此，每当现任总理的情况看起来有点不稳定时，前任总理的幽灵就会出现，他喜欢突然出现，让事情变得更加困难。 我们必须回顾这个故事，因为苏纳克是第二个辞职的人，也是鲍里斯·约翰逊的内阁，最终导致他辞职。 你知道，从理论上讲，这可能就像一个蔑视爱好者的故事。 这可能是家庭不和。 太激烈了。 但即便如此，仍有传言称不信任信与你现在从鲍里斯·约翰逊的盟友那里看到的情况背道而驰。 现在，我怀疑这些被严重夸大了，因为对保守党来说，唯一比他们现在所处的情况更困难的就是他们当时所处的情况。 但里面确实有心理剧。 嗯，我的意思是，当谈到苏埃拉时，布雷弗曼有一些传言称她本周可能会再次被解雇。 事实上，我们刚刚收到一些突发消息，苏埃拉·布雷弗曼 (Suella Braverman) 实际上被里希·苏纳克 (Rishi Sunak) 解雇，12.8 秒后又被重新任命。 甚至比去年她创下的六天被解雇记录还要快，从现在开始，她将在每天早上 7:30 被正式解雇，并在早上 7:32 重新被任命。 鲍里斯·约翰逊的一个简短问题，鲍里斯·约翰逊问题最合适的类型是什么？ 字面上地？ 色情惊悚片 对吗？ 是的。 那么具体来说，这是关于什么的？ 我现在想看到他们向我展示。 将它们放在桌子上。 我们来看一下。\n\nUnknown Speaker  23:11  \nHis parliamentary diary. Yes.\n\nUnknown Speaker  23:13  \nCorrect. Yes, it is about the parliamentary diaries. Yes, thank God. Yeah, so the Cabinet Office, lawyers have handed over to police and he's furious about that, because he's been it's a political stitch up by his own actions. And he's, he's fired the cabinet lawyers, which were funded by the taxpayer and he's hired his own lawyers, which are also funded by the taxpayer. But I think it's the right idea because the lawyer that he's got is the hologram of Robert Kardashian. And skipping the photos couldn't have a BJ\n\n正确的。 是的，是关于议会日记的。 是的，感谢上帝。 是的，所以内阁办公室、律师已经将此事移交给警方，他对此感到愤怒，因为他一直认为这是他自己的行为造成的政治缝补。 他解雇了内阁律师，这些律师是由纳税人资助的，他还聘请了自己的律师，这些律师也是由纳税人资助的。 但我认为这是正确的想法，因为他的律师是罗伯特·卡戴珊的全息图。 跳过照片就不可能有 BJ\n\nSpeaker 4  23:45  \nYes, Rishi Sunak has once again been haunted by suella. Braverman and Boris Johnson, the ghosts of scandals, past scandals present and scandals yet to come sooner clear the home sector and recurring political nightmare Brafman of breaking ministerial codes. After a speeding fine I guess the questions are, why did suella Braverman consult with civil servants over a speeding fine, but not It seems over whether jetting people we don't have space for to a country with twice our population density and a fraction of our resources is at least one sensible, affordable, practical or morally non abominable. Conservative MP William Wragge recently claimed that when in a meeting with the parliamentary standards bodies a new MP Bradman asked if speeding tickets could be claimed as a work expense. And it is that kind of legal insight that explains her rapid elevation on the helium bubble of Brexit spaciousness that took her to the powers of attorney general and the Home Secretary. Boris Johnson a politician who above all else will be remembered for being the politician who above all else wanted to be remembered. What once again Donald has Mario Balotelli why always Misha and claimed he was being stitched up the former prime minister and self-styled Beethoven have been ovation, who has sadly been ruled out injured from politics for the last nine months while he recovers from a ruptured ego was triggered this week after party Gator woke from its uneasy slumbers, please are looking into potential COVID Air law breaking at Chequers, the PMs backup house where Johnson used to go to rest, recuperate to Winston Churchill speeches on a karaoke machine and gaze into the mirror seductively singing is your turn. Finally, this is now a financial thriller. Tell me what story this is about. With all the suave assurance of someone who was once a government minister and a large North African nation, he slapped a 5 million pound note on the table and took a big nibble of his carrot. Yes, he missed cigars, but he also loved carrots. What story is that about?\n\n是的，Rishi Sunak 再次受到了suella 的困扰。 布拉夫曼和鲍里斯·约翰逊是丑闻的幽灵，过去的丑闻和即将到来的丑闻很快就清除了家庭部门以及布拉夫曼违反部长守则的反复出现的政治噩梦。 超速罚款后，我想问题是，为什么苏埃拉·布雷弗曼（Suella Braverman）就超速罚款与公务员协商，而不是是否将我们没有空间容纳的人飞往一个人口密度是我们两倍、人口密度只有我们一小部分的国家？ 我们的资源至少是一种合理的、负担得起的、实用的或道德上不可憎恶的资源。 保守党议员威廉·拉格(William Wragge)最近声称，在与议会标准机构举行的会议上，新任议员布拉德曼(Bradman)询问超速罚单是否可以作为工作费用申报。 正是这种法律洞察力解释了她对英国脱欧空间的高度重视，并让她获得了总检察长和内政大臣的权力。 鲍里斯·约翰逊（Boris Johnson）是一位政治家，他首先会因为他是一位希望被记住的政治家而被人们记住。 唐纳德再次对马里奥·巴洛特利（Mario Balotelli）为什么总是米沙（Misha）并声称他正在将前总理和自封的贝多芬（Beethoven）缝合起来表示热烈的掌声，可悲的是，在过去的九个月里，他因受伤而无法从政治中恢复，而他正在从破裂中恢复过来。 本周，Gator 从不安的睡眠中醒来后，自我意识被触发，请调查 Chequers 可能违反新冠航空法的情况。Chequers 是首相的后备屋，约翰逊曾在那里休息，在卡拉 OK 机上聆听温斯顿·丘吉尔 (Winston Churchill) 的演讲，休养生息，并凝视着周围的一切。 镜子妖娆地唱着歌，轮到你了。 最后，这是一部金融惊悚片。 告诉我这讲的是一个什么故事。 他带着曾经担任过政府部长和北非大国的温和保证，将一张 500 万英镑的钞票拍在桌子上，然后咬了一大口胡萝卜。 是的，他想念雪茄，但他也喜欢胡萝卜。 那是关于什么故事的？\n\nSpeaker 7  25:45  \nI know that I think his name is man saw mentor who is a veteran of Hosni Mubarak's administration in Egypt, which was overthrown during the briefly optimistic Arab Spring about 12 years ago, and is now part of the the conservative infrastructure and has been found to be their biggest donor since Getty, I think about 20 years ago, with 5 million quid I find it interesting that they're bringing in Egyptian know how into the government, I think we have to assume that they recognize that the British economy is past saving, and it is now time for magnification.\n\n我知道我认为他的名字是曼·索·门托尔，他是埃及胡斯尼·穆巴拉克政府的老将，该政府在大约12年前的短暂乐观的阿拉伯之春中被推翻，现在是保守党基础设施的一部分，自从盖蒂（Getty）以来，他们已经发现是他们最大的捐赠者，我想大约20年前，有500万英镑，我发现他们将埃及的专业知识引入政府很有趣，我认为我们必须假设他们认识到英国经济已经过去了，现在是放大的时候了。\n\nSpeaker 4  26:25  \nI think we can do with few pyramids to commemorate our political leaders.\n\n我认为我们可以用几座金字塔来纪念我们的政治领袖。\n\nSpeaker 6  26:29  \nIt would be great if this country would build anything I mean, a house a pyramid I really don't care what it is just build something\n\n如果这个国家能建造任何东西就太好了，我的意思是，一座房子，一座金字塔，我真的不在乎它是什么，只要建造一些东西。\n\nSpeaker 4  26:38  \nI want to get it's just an issue. Kate, do you think resonates with the public labor will also find this week for declaring donations late do people care?\n\n我想知道这只是一个问题。 凯特，你认为这对公众有共鸣，工党也会在本周宣布捐款晚了，人们在乎吗？\n\nSpeaker 6  26:47  \nI think some people care. It just feels messy doesn't it feels like the finances aren't in order. And the finances aren't in order in terms of the country in terms of the parties, but it's funny to look at the different numbers. We're talking about 5 million within the Tory party and labour had been fined 200 pounds each for their Late reports in terms of their donations. So we're dealing with slightly different figures there. But yeah, I'm sure it riles people up all the same. It is always funny when you see the breakdown of donations and the Tories. It's like 5 million from a captain of industry in labor. It's like 75 P from a fun run in Hackney.\n\n我认为有些人在乎。 它只是感觉混乱，感觉财务没有秩序。 而且财务没有秩序，就是国家的财务，就是政党的财务，但是看看不同的数字很有趣。 我们在谈论保守党内的500万，而工党每人被罚款200英镑，因为他们的捐款报告晚了。 所以我们在那里处理稍微不同的数字。 但是，是的，我敢肯定，它仍然会激怒人们。 当你看到捐款的细目时，总是很有趣的。 保守党。 它来自工业界的一位船长，而工党。 它来自哈克尼（Hackney）的一次有趣的竞赛，每次只有75便士。\n\nSpeaker 4  27:24  \nThis week it emerged that Egyptian Wellston Muhammad man saw became the Tories treasurer after donating 600,000 pounds is now bound the mayhem addicted political body of cool 5 million. Obviously the Conservative Party rejected that donation that they do not like people relying on handouts. I don't know exactly what the 5 million donation gets you obviously you do get the standard donors package of a game of tennis with a prime minister of your choosing Cova influence with a cabinet a title a free sports hold on and a commemorative talking Jacob Riis, mog action doll but on top of that 5 million I think you also get 10 free rides in the Royal Gold cart and they get hologram of any former Tory leader and you get to make Jeremy Hunt squat on all fours and ride him like a donkey shouting giddy up budget boy. Right on that note, that is the end of this week's news quiz. Our winners Kate and Lucy with 12 points Simon and Robin have eight. The other final scores, books are better than shrubs. And they will play the winner of next month's showdown between music and painting as Glastonbury clashes with the Royal Academy summer exhibition. So it's been great being here at the hay festival this week next week. We are back here in fact for the AI festival of literature in which all the books have been written by online bots. Thank you very much for listening to the news quiz. I've been at his Ultimen goodbye.\n\n本周有消息称，埃及人韦尔斯顿·穆罕默德 (Wellston Muhammad) 在捐赠 60 万英镑后成为保守党财务主管，现在绑定了拥有 500 万民众的混乱政治团体。 显然，保守党拒绝了这笔捐款，因为他们不喜欢人们依赖施舍。 我不知道这 500 万美元的捐款到底能给你带来什么，显然你确实得到了标准的捐助者套餐，包括与你选择的总理一起打一场网球比赛、科瓦的影响力、内阁、一个头衔、一个自由体育赛事和一个会说话的纪念雅各布 Riis，莫格动作娃娃，但除了 500 万之外，我想你还可以免费乘坐皇家金车 10 次，他们会得到任何前保守党领袖的全息图，你可以让杰里米·亨特蹲下来，像骑乘者一样骑着他 驴喊得头晕目眩的预算男孩。 就在那一刻，本周的新闻测验就结束了。 我们的冠军凯特和露西得了 12 分，西蒙和罗宾得了 8 分。 其他最终成绩，书籍都比灌木好。 他们将在下个月的格拉斯顿伯里音乐与绘画对决中与皇家学院夏季展览的对决中获胜。 所以下周参加干草节真是太棒了。 事实上，我们回到这里是为了参加人工智能文学节，其中所有的书籍都是由在线机器人编写的。 非常感谢您收听新闻问答节目。 我一直在他的乌尔蒂门告别。\n\n\n","collection":"blog","data":{"type":"post","category":"English"}},{"id":"2023/07/01/26tn-week-Using-Ubuntu.md","slug":"2023/07/01/26tn-week-using-ubuntu","body":"# 26th week: Using Ubuntu\n\n## Babylon tutorial plan\n\nThis week，I've finished the [babylon tutorial](https://doc.babylonjs.com/guidedLearning/createAGame). Collected a lot courses.\n\n- About using a physical engine, can read [this document](https://doc.babylonjs.com/legacy/physics/usingPhysicsEngine).\n\n- About using HDR image, can read [this document](https://doc.babylonjs.com/features/featuresDeepDive/materials/using/HDREnvironment).\n\n- About playing music, can read [this document](https://doc.babylonjs.com/features/featuresDeepDive/audio/playingSoundsMusic).\n\n- How to make a game into 60 fps, can read [this document](https://spector.babylonjs.com/#thirdpartydemossection).\n\n- [Royal Skies](https://www.youtube.com/watch?v=f6vgICNCVxQ&list=PLZpDYt0cyiuu-sxJKbuYh8OjtgmXNacCV&ab_channel=RoyalSkies) provides a series of tutorial about blender 2.8.\n\n- [Grant Abbitt](https://www.youtube.com/user/mediagabbitt) also provides a blender 2.8 course.\n\n- [3D Animation Hub](https://www.youtube.com/watch?v=VvTEovuTCgA&ab_channel=3DAnimationHub) provides a series of making 3D player animation.\n\n- [Jayanam](https://www.youtube.com/watch?v=0PkBq9NW7K8&ab_channel=Jayanam) also provides an animation tutorial.\n\n- [MortMort](https://www.youtube.com/watch?v=uOyiZaioX1U&t=19s&ab_channel=MortMort) provides a pixel art tutorial.\n\nThe following links are about game resources.\n\n- [open game art](https://opengameart.org/), including models and audios.\n\n- [freesound](https://freesound.org/), provides free audios.\n\n- [earslap](https://earslap.com/page/circuli.html), provides music game ideas.\n\n- [a nice 3D Chinese art](https://sketchfab.com/3d-models/the-vast-land-733b802f5a4743ef99ad574279d49920)\n\n## Ubuntu\n\nThis week I went back from PC to linux, because the weather is getting hotter, causing my PC to overheat.\n\nImmersedVR is compitable with Linux, just need to install libfuse2, and \n[v4l2loopback-dkms](https://installati.one/install-v4l2loopback-dkms-ubuntu-20-04/) for virtual camera. This is an [article](https://linux.how2shout.com/how-to-create-desktop-shortcut-for-an-appimage/) about add AppImage pacakge to favorite bar.\n\nThe input method, iBus, needs restart after installed.\n\nCan use piper to config logitech mouse.\n\nKeep using Xorg as display server is a good choice, most Apps, like xrandr are based on Xorg. Only Waydroid is not compitable with Xorg.\n\n## ultra-copier\n\nWhen copying files, some devices can be overheat.[ultra-copier](https://ultracopier.herman-brule.com/) can be used as a stable and fast copy tool.\n\n## Text to speech\n\nI'm using [OtterAI](https://otter.ai/home) to transpile podcasts to content. Using these scripts to practice English.\n\n## Nx\n\nI'm starting learning [react-babylon](https://brianzinn.github.io/react-babylonjs/) in a deep dive. Using Nx as a monorepo utility. I suggest this [tutorial](https://nx.dev/core-tutorial/01-create-blog).\n\nkeep remembering to add `package.json` and a name a version to the lib.\n\n## JS animation library\n\n[react spring](https://www.react-spring.dev/) supports react and threejs.\n\n[framer motion](https://www.framer.com/motion/) seems only support react.\n\nBabylon has it's own animation system.\n\n## ORM\n\n[Drizzle](https://orm.drizzle.team/), suggested by Syntax FM. Haven't tried.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/07/08/27th-week-AUS-462.md","slug":"2023/07/08/27th-week-aus-462","body":"\n# 27th week: AUS 462\n\nThis week I applied AUS 462 visa, wish I can get it soon.\n\n## React-BabylonJS\n\nI finished the basic part. In the tutorial, position in terrain is no longer supported. And EngineView, which renders viewport on different canvases, is not supported. Snippet is a way to call shader from babylon server, but I don't want to use that.\n\n## VSCode extension\n\n[Import Cost](https://citw.medium.com/keep-your-bundle-size-under-control-with-import-cost-vscode-extension-5d476b3c5a76#:~:text=Enter%20Import-Cost%20Import-Cost%20is%20a%20Visual%20Studio%20Code,for%20that%2C%20some%20of%20them%20are%20stated%20above.) calculates the size of imported packages.\n\n## Some git errors\n\nI bumped into a git error, some corrupted files in .git/objects. A simple way is just delete them.\n\n```shell\nfind .git/objects/ -size 0 -delete\n```\n\nDangling objects are tricky, [this](https://mirrors.edge.kernel.org/pub/software/scm/git/docs/user-manual.html#recovering-from-repository-corruption) is the official solution.\n\n## SwiftUI\n\nI learnt some basic knowledge about SwiftUI. Still don't know why people say it's elegant.\n\n## CSS3DRenderer\n\nThreeJS can use CSS as it's renderer. These are some examples:\n\n- [3D Youtube](https://threejs.org/examples/#css3d_youtube)\n- [CSS sprites](https://threejs.org/examples/?q=CSS#css3d_sprites)\n\n## Video Tutorials\n\nFinished [The Net Ninja's Flutter Tutorial](https://www.youtube.com/watch?v=1ukSR1GRtMU&list=PL4cUxeGkcC9jLYyp2Aoh6hcWuxFDX6PBJ&pp=iAQB)\n\nWatching [The Net Ninja's GraphQL Tutorial](https://www.youtube.com/watch?v=xMCnDesBggM&list=PL4cUxeGkcC9gUxtblNUahcsg0WLxmrK_y&pp=iAQB) now.\n\nplaning to watch [TensorFlow 2.0 Course in Free Code Campus](https://www.youtube.com/watch?v=tPYj3fFJGjk&t=114s)\n\nand [Rafa Tec XR's web XR tutorial](https://www.youtube.com/watch?v=uJ2ikVUXKBw) is in planing too.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/07/15/28th-week-MRTK3-on-web.md","slug":"2023/07/15/28th-week-mrtk3-on-web","body":"# 28th week: MRTK3 on web\n\n## Tensorflow\n\nThis week I tried to reuse tensorflow using [the MNIST tutorial](https://codelabs.developers.google.com/codelabs/tfjs-training-classfication). It is much useful than years before. So I'm starting to watch this [freeCodeCamp](https://www.youtube.com/watch?v=tPYj3fFJGjk&t=4090s&pp=ygUTdGVuc29yZmxvdyB0dXRvcmlhbA%3D%3D) to get a structured knowledge. It will be done this week.\n\n## Web3\n\nI don't know too much about web3, just watched [fireship's video](https://www.youtube.com/watch?v=meTpMP0J5E8&pp=ygUMZmlyZXNoaXAgTkZU). There's [a series of videos](https://www.youtube.com/watch?v=9SzWQq2ejZ4&list=PL2fGiugrNooj0nya96-BEGnQAzZnKy04m&ab_channel=01Coder) about solidity. Maybe I will use it one day.\n\n- [NFT Art Generator](https://nft-generator.art/) is a tool to generate NFT art.\n- [Waffle](https://ethereum-waffle.readthedocs.io/en/latest/) is a testing framework for solidity.\n- [Pinata](https://www.pinata.cloud/) puts your NFT on IPFS. This is a [tutorial](https://blog.ipfs.tech/2021-07-15-building-web-3-pinata/).\n- [HardHat](https://hardhat.org/) is a development environment for Ethereum. It's a replacement of Truffle.Building a bridge between JS and solidity.\n- [chain-link](https://chain.link/) is a decentralized oracle network.\n- [OpenZeppelin](https://www.openzeppelin.com/) is a library for smart contract development.\n\n## Tailwind\n\nTailwind is a utility first CSS framework. But the templates on the site are not free. These are some free component templates:\n\n- [float UI](https://www.floatui.com/components)\n- [a17t](https://a17t.miles.land/)\n- [ko Meta](https://kitwind.io/products/kometa)\n- [headless UI](https://headlessui.com/)\n- [tailwind UI Kit](https://tailwinduikit.com/components)\n- [daisy UI](https://daisyui.com/)\n- [tailwind kit](https://www.tailwind-kit.com/)\n- [tailwind Starter Kit](https://www.creative-tim.com/learning-lab/tailwind-starter-kit/presentation)\n- [kutty](https://kutty.netlify.app/)\n- [post src](https://postsrc.com/components)\n- [tail blocks](https://tailblocks.cc/)\n- [hyper UI](https://www.hyperui.dev/)\n- [meraki UI](https://merakiui.com/)\n- [mamba UI](https://mambaui.com/)\n\nThese are page templates:\n\n- [tailwind tool box](https://www.tailwindtoolbox.com/)\n- [CUIP](https://codepen.io/cruip)\n- [tailwind awesome](https://www.tailwindawesome.com/)\n- [tailwind components](https://tailwindcomponents.com/)\n- [tReact](https://treact.owaiskhan.me/)\n- [unlight tailwind components](https://github.com/unlight/tailwind-components)\n\n## FBX files\n\nsome FBX files can not be read on Windows 3D viewer. Can use [Autodesk FBX Review](https://www.autodesk.com/products/fbx/fbx-review) to check the file.\n\nThese are some free FBX [emojis](https://3moji.org/)\n\n## UI for webXR\n\nUI on canvas is quiet different from UI on DOM. Babylon.js has it's own UI toolkit both 2D and 3D. And one can make the UI using the [UI editor](https://gui.babylonjs.com/). [Space.js](https://github.com/alienkitty/space.js) is a 3rd party UI for Three.js.\n\nBabylon.js treats UI as materials, so I can's add Gizmo on it. But I can attach it to a mesh. \n\nWith the SVG's foreignObject tag, I can insert an HTML into SVG. This is how [html-to-image](https://github.com/bubkoo/html-to-image#readme) works. I think I can implement an HTML Control for babylon.js. \n\nfurthermore, I can use [height-map](https://doc.babylonjs.com/features/featuresDeepDive/mesh/creation/set/height_map) to add 3D effect for a 2D GUI.\n\n## Babylon.js\n\nBabylon.js now supports [MRTK3](https://doc.babylonjs.com/features/featuresDeepDive/gui/mrtk) on web. But right now, only a button is supported. The full MRTK3 components can be found in [github](https://github.com/microsoft/MixedRealityToolkit-Unity/tree/mrtk3). checkout the mrtk3 branch. You can build it on Unity.\n\nBabylon.js has an [editor](https://editor.babylonjs.com/), Three.js also has [one](https://rogueengine.io/download). I have to say babylon.js is better. But to integrate it with react-babylon still need some work. It exports scene as a `.babylon` [file](https://doc.babylonjs.com/setup/support/.babylonFileFormat). I am trying to import it to react-babylon.\n\nSnippets is a babylon material server. You can build your own with [this](https://doc.babylonjs.com/toolsAndResources/thePlayground/yourOwnSnippetServer). Also you can use [node-editor](https://nme.babylonjs.com/) to generate one.\n\n## WebXR\n\nI found [a tutorial of WebXR](https://medium.com/youngsphere/1-introduction-to-webxr-53c293b4bfb5) on medium. I will check it out next week.\n\n## Swipe keyboard\n\nThis is a [document](\nhttps://www.fleksy.com/blog/how-swipe-typing-works/) about how swipe keyboard works.\n\n## What to be done\n\n- Finish the tensorflow tutorial. [freeCodeCamp](https://www.youtube.com/watch?v=tPYj3fFJGjk&t=4090s&pp=ygUTdGVuc29yZmxvdyB0dXRvcmlhbA%3D%3D)\n- Integrate babylon.js editor with react-babylon.\n- make an HTML Control for babylon.js.\n- learn [react-babylon tutorial](https://brianzinn.github.io/react-babylonjs/)\n- learn [rust on android](https://google.github.io/comprehensive-rust/)\n- try to make snippets(not emergent).","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/07/22/29th-week-geospatial.md","slug":"2023/07/22/29th-week-geospatial","body":"# 29th week: Google Geo-Spatial\n\n## Google Geo-Spatial\n\nFirstly, I didn't get the permission, this API is not opened for mainland China. I need a abroad VISA card.\n\nThis is [a slideshow](https://www.docswell.com/s/FumiyaHr/56YG27-2023-05-18-221638#p6) to introduce it.\n\nThis is [the official document](https://developers.google.com/ar/develop/geospatial). [This](https://developers.google.com/ar/develop/unity-arf/geospatial/streetscape-geometry) is about using google geo-spatial on unity. It is based on [AR Foundation](https://developers.google.com/ar/develop/unity-arf/getting-started-ar-foundation).\n\nThese are some [samples](https://github.com/google-ar/arcore-unity-extensions/tree/master/Samples~).\n\nThis is an [ARCore official page](https://developers.google.com/ar/geospatialcreator).\n\n[Earth Studio](https://www.google.com/earth/studio/) uses google geo-spatial to build Video assets.\n\nThis is a google's WebXR [tutorial](https://developers.google.com/ar/develop/webxr/hello-webxr), I'll check it out this week.\n\nAlso, here is some webXR [tutorial](https://doc.babylonjs.com/features/featuresDeepDive/webXR/WebXRSelectedFeatures\n) in [babylon.js](https://doc.babylonjs.com/features/featuresDeepDive/webXR/webXRARFeatures).\n\n## use Babylon editor and react-babylon.js\n\nThe Babylon editor uses CANNON as physical engine, before importing, I need to inject it.\n\n``` js\nBabylonFileLoaderConfiguration.LoaderInjectedPhysicsEngine = CANNON;\n```\n\nAnd the asset should be relatively put in the `root_dir`.\n\n```js\nSceneLoader.AppendAsync(`${root_dir}`, \"scene.babylon\", scene);\n```\n\n## OpenFaas\n\nThis is a new world to me, I found an ebook, [Kubernetes 中文指南](https://jimmysong.io/kubernetes-handbook/). I don't have time to read it yet.\n\n## GASP\n\n[GASP](https://greensock.com/gsap/) is an animation library, I heard from [@WawaSensei](https://www.youtube.com/@WawaSensei). He's got some nice shader [tutorials](https://www.youtube.com/watch?v=e2ntx-fyXaE) I want to learn.\n\n## Face tracking on WebXR\n\nCurrently, Face tracking is not supported in WebXR. This is a 3rd party library [mind-AR.js](https://medium.com/web-augmented-reality-development/webar-face-tracking-with-10-lines-of-code-18c5f24a0e38) that supports it.\n\n## Swift on Linux\n\nThis is a page about [swift on linux](http://swift-linux.refi64.com/en/latest/index.html). It seems only [Vapor](https://vapor.codes/) is still alive now (as a web server).\n\n## 3D LUT File\n\nLUT file(look up table) is a file that contains color correction data. It is used in video editing. [Adobe Premiere](https://www.makeuseof.com/adobe-premiere-how-to-export-lut/) can export it.\n\n## Video with depth\n\nThis is a [script](https://github.com/jankais3r/Video-Depthify) in Codelab to make depthify video. I can also use [stable diffusion](https://github.com/thygate/stable-diffusion-webui-depthmap-script) to make one.\n\n## Lottie\n\n[Lottie](https://lottiefiles.com/featured) is a SVG animation tool. Differences between Lottie and Rive is in this [document](https://rive.app/blog/rive-as-a-lottie-alternative). \n\n## React v18\n\nuseSyncExternalStore is a new react hook in v18. It can be used observe an element outside react environment\n\n```js\nlet data = {w: 0, h: 0};\nconst subscribe = snap => {\n    window.addEventListener('resize', snap);\n    () => window.removeEventListener('resize', snap);\n}\n\nconst snapshot = () => {\n    const w = window.innerWidth;\n    const h = window.innerHeight;\n    if (w !== data.w || h !== data.h) {\n        data = {w, h};\n    }\n    return data\n}\nconst Component = () => {\n    const {w, h} = useSyncExternalStore(subscribe, snapshot);\n}\n```\n\nSuspense is updated to support data fetching.\n\n```js\nlet data = null\nlet promise = null\nconst Suspender = () => {\n    if (data === null) {\n        if (promise === null) {\n            promise = fetch('url').then(res => res.json()).then(res => {\n                data = res;\n                promise = null;\n            });\n        }\n        throw promise;\n    }\n    return <div>{data}</div>\n}\n\nconst Component = () => {\n    return (\n        <Suspense fallback={<div>loading</div>}>\n            <Suspender />\n        </Suspense>\n    )\n}\n```\n\n## react-babylon.js\n\nI've finished the examples in [react-babylon.js](https://brianzinn.github.io/react-babylonjs/). I will try webXR next week. Still, there are some stuff I don't understand. Like [pbrMaterial](https://www.youtube.com/watch?v=CRg8P1Af1M0&ab_channel=Babylonjs), reflectionFresnelParameters, arcRotateCamera, and mesh-lookat.\n\n## Next week\n\nI'll try Google's webXR tutorial, and the babylon one.\n\nI'll continue the tensorflow tutorial. And the rust on android one.\n\nI'll try to compare Remix and Next.js.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/07/30/30th-week-shader.md","slug":"2023/07/30/30th-week-shader","body":"# 30th week shader\n\n## CSS in JS is back\n\n[Kuma UI](https://www.kuma-ui.com/) is a compiler time CSS in JS library. It is a better alternative to Tailwind CSS. It can be used with [Panda CSS](https://panda-css.com/)\n\n## NextJS & Remix\n\nCompared NextJS and Remix. Remix is fully server rendered.\n\n## Use Preact with react-babylonjs\n\n[preact-reconciler](https://github.com/CodyJasonBennett/preact-reconciler) is an adapter for Preact to work with react-babylonjs or R3F.\n\n## WebXR\n\n[Mixed Reality Resources](https://github.com/Yonet/MixedRealityResources) collects the datas about XR resources. Can download some library on it.\n\nThis is an XR input [playground](https://playground.babylonjs.com/#X7Y4H8) for BabylonJS.\n\nUsing WebXR on phone is hard. It is only supported on Chrome Canary. It is not working on Safari even opened the experimental features.\n\nTesting the web on mobile need a cable connect. But there is a JS console [Eruda](https://github.com/liriliri/eruda) can help.\n\nAnother choice is to use [Babylon React Native](https://github.com/BabylonJS/BabylonReactNativeSample), which uses React Native as a bridge to use ARcore or ARkit. Sadly Oculus dose not support ARcore. However, it seems Oculus uses React Native on it's [Home Launcher](https://reactnative.dev/blog/2021/08/26/many-platform-vision). And they are working on supporting Vision OS.\n\n[This](https://www.callstack.com/campaigns/download-the-ultimate-guide-to-react-native-optimization) is a book about React Native.\n\n## BabylonJS\n\nTo make an orthographic camera in BabylonJS, can refer to this [link](https://forum.babylonjs.com/t/how-to-use-orthographic-view-in/29733).\n\n[CYOS](https://cyos.babylonjs.com/) is a BabylonJS shader editor.\n\n[BabylonJS Viewer](https://doc.babylonjs.com/features/featuresDeepDive/babylonViewer) uses web component to build a 3D viewer.\n\nCan use [Poly Pizza](https://poly.pizza/) to download mesh models.\n\nCan download free shaders on [ShaderToy](https://www.shadertoy.com/).\n\n## AI generated SVGs\n\nUsing [Craft AI](https://www.recraft.ai/), can make AI generated SVGs for free. [This](https://www.nan.fyi/) is a blog about SVG paths, maintainer is a vercel employee.\n\n## Crash an SVG path on WebGL\n\n[This](https://css-tricks.com/rendering-svg-paths-in-webgl/) is a threeJS example to render SVG path on WebGL with shaders. I am trying to make it work on BabylonJS and learn how to write shaders.\n\n[This](https://www.youtube.com/watch?v=oKbCaj1J6EI&ab_channel=Visionary3D) is a crash course about shaders.\n\nTo make vertex change without shader, can refer to this [link](https://doc.babylonjs.com/features/featuresDeepDive/mesh/creation/custom/updatingVertices).\n\nAbout how to use a node editor can refer to [this](https://doc.babylonjs.com/features/featuresDeepDive/materials/node_material/nodeMaterial)\n\nThis is an [example](https://playground.babylonjs.com/#026IT4#1) to send attribute data to shader using instanceBuffer.\n\nThis is a nice [tutorial](https://www.smashingmagazine.com/2016/11/building-shaders-with-babylon-js/) about how to write shaders in BabylonJS.\n\n[This](https://playground.babylonjs.com/#1OH09K#1672) is a firework effect using shader.\n\n[A fancy Babylon Effect](https://codepen.io/daledesilva/pen/ZEmrrYX) I want to figure out.\n\n## run JS in compiling time\n\nSince React Server Component runs component on server, I was thinking to run a component on compiling time. [This plugin](https://github.com/egoist/vite-plugin-compile-time) can do that.\n\nAlso there is [a plugin](https://github.com/unjs/unplugin) to help build a universal plugin for Vite, Rollup, Webpack and more.\n\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/08/06/31st-Goodbye-WHV-NZ.md","slug":"2023/08/06/31st-goodbye-whv-nz","body":"# 31st week: Goodbye WHV NZ\n\nThis week is my last chance to get a NZ WHV visa of my life. I didn't get it, sad.\n\nI wrote a [page](https://codesandbox.io/p/github/gongbaodd/react-babylonjs-svg-mesh/main?layout=%257B%2522sidebarPanel%2522%253A%2522EXPLORER%2522%252C%2522rootPanelGroup%2522%253A%257B%2522direction%2522%253A%2522horizontal%2522%252C%2522contentType%2522%253A%2522UNKNOWN%2522%252C%2522type%2522%253A%2522PANEL_GROUP%2522%252C%2522id%2522%253A%2522ROOT_LAYOUT%2522%252C%2522panels%2522%253A%255B%257B%2522type%2522%253A%2522PANEL_GROUP%2522%252C%2522contentType%2522%253A%2522UNKNOWN%2522%252C%2522direction%2522%253A%2522vertical%2522%252C%2522id%2522%253A%2522clkxtvnml000h3e6xpknv88gp%2522%252C%2522sizes%2522%253A%255B70%252C30%255D%252C%2522panels%2522%253A%255B%257B%2522type%2522%253A%2522PANEL_GROUP%2522%252C%2522contentType%2522%253A%2522EDITOR%2522%252C%2522direction%2522%253A%2522horizontal%2522%252C%2522id%2522%253A%2522EDITOR%2522%252C%2522panels%2522%253A%255B%257B%2522type%2522%253A%2522PANEL%2522%252C%2522contentType%2522%253A%2522EDITOR%2522%252C%2522id%2522%253A%2522clkxtvnmk000c3e6xuug5xz14%2522%257D%255D%252C%2522sizes%2522%253A%255B100%255D%257D%252C%257B%2522type%2522%253A%2522PANEL_GROUP%2522%252C%2522contentType%2522%253A%2522SHELLS%2522%252C%2522direction%2522%253A%2522horizontal%2522%252C%2522id%2522%253A%2522SHELLS%2522%252C%2522panels%2522%253A%255B%257B%2522type%2522%253A%2522PANEL%2522%252C%2522contentType%2522%253A%2522SHELLS%2522%252C%2522id%2522%253A%2522clkxtvnmk000g3e6xy3qev2y4%2522%257D%255D%252C%2522sizes%2522%253A%255B100%255D%257D%255D%257D%252C%257B%2522type%2522%253A%2522PANEL_GROUP%2522%252C%2522contentType%2522%253A%2522DEVTOOLS%2522%252C%2522direction%2522%253A%2522vertical%2522%252C%2522id%2522%253A%2522DEVTOOLS%2522%252C%2522panels%2522%253A%255B%257B%2522type%2522%253A%2522PANEL%2522%252C%2522contentType%2522%253A%2522DEVTOOLS%2522%252C%2522id%2522%253A%2522clkxtvnmk000e3e6xyi12qp3g%2522%257D%255D%252C%2522sizes%2522%253A%255B100%255D%257D%255D%252C%2522sizes%2522%253A%255B50%252C50%255D%257D%252C%2522tabbedPanels%2522%253A%257B%2522clkxtvnmk000c3e6xuug5xz14%2522%253A%257B%2522id%2522%253A%2522clkxtvnmk000c3e6xuug5xz14%2522%252C%2522activeTabId%2522%253A%2522clkxtycgk01au3e6xpnmhmt17%2522%252C%2522tabs%2522%253A%255B%257B%2522type%2522%253A%2522FILE%2522%252C%2522filepath%2522%253A%2522%252Fsrc%252FComponents%252FCrash.tsx%2522%252C%2522id%2522%253A%2522clkxtycgk01au3e6xpnmhmt17%2522%252C%2522mode%2522%253A%2522temporary%2522%257D%255D%257D%252C%2522clkxtvnmk000e3e6xyi12qp3g%2522%253A%257B%2522id%2522%253A%2522clkxtvnmk000e3e6xyi12qp3g%2522%252C%2522activeTabId%2522%253A%2522clkxtwh2h00y43e6xkxghz19s%2522%252C%2522tabs%2522%253A%255B%257B%2522type%2522%253A%2522TASK_PORT%2522%252C%2522taskId%2522%253A%2522dev%2522%252C%2522port%2522%253A5173%252C%2522id%2522%253A%2522clkxtwh2h00y43e6xkxghz19s%2522%252C%2522mode%2522%253A%2522permanent%2522%252C%2522path%2522%253A%2522%252F%2522%257D%255D%257D%252C%2522clkxtvnmk000g3e6xy3qev2y4%2522%253A%257B%2522id%2522%253A%2522clkxtvnmk000g3e6xy3qev2y4%2522%252C%2522activeTabId%2522%253A%2522clkxtwdyl00ma3e6xcircdgox%2522%252C%2522tabs%2522%253A%255B%257B%2522id%2522%253A%2522clkxtvnmk000f3e6xvjfw6yvv%2522%252C%2522mode%2522%253A%2522permanent%2522%252C%2522type%2522%253A%2522TERMINAL%2522%252C%2522shellId%2522%253A%2522clkxtvnv5000nhgi2h6knbve8%2522%257D%252C%257B%2522type%2522%253A%2522TASK_LOG%2522%252C%2522taskId%2522%253A%2522dev%2522%252C%2522id%2522%253A%2522clkxtwdyl00ma3e6xcircdgox%2522%252C%2522mode%2522%253A%2522permanent%2522%257D%255D%257D%257D%252C%2522showDevtools%2522%253Atrue%252C%2522showShells%2522%253Atrue%252C%2522showSidebar%2522%253Atrue%252C%2522sidebarPanelSize%2522%253A15%257D) as a meme about Twitter changing its logo into X. Which was as a tutorial to learn shader in babylonjs.\n\nraczzalan.webgl-glsl-editor is an extension for vscode to write glsl without a language server.\n\nUsing a shader material is simple, just pass ther vertex and fragments as a parameter.\n\n```jsx\n        <sphere name=\"fireworks\" ref={setSphere}>\n            <shaderMaterial name=\"fireworks-mat\"\n                ref={setMat}\n                shaderPath={{vertexSource, fragmentSource}}\n                options={{\n                    attributes: [\"position\", \"normal\", \"uv\"],\n                    uniforms: [\"worldViewProjection\", \"time\"],\n                    needAlphaBlending: true,\n                }}\n                backFaceCulling={false}\n            />\n        </sphere>\n```\n\nthe attributes and uniforms are the variables that can be used in the shader. There are some varaibles that are automatically passed to the shader, like `worldViewProjection` and `time`. They are documented in [threejs](https://threejs.org/docs/#api/en/materials/ShaderMaterial) and [babylonjs](https://doc.babylonjs.com/features/featuresDeepDive/materials/shaders/introToShaders).\n\nattribute is the data passed before compile and uniforms can be changed during rendering.\n\nThere are two functions to send attributes. `mesh.setVerticesBuffer` and `mesh.registerInstancedBuffer`. The first one is for the data that is the same for every vertex, this is a simple [example](https://www.babylonjs-playground.com/#QCLQFN#39), like the position of the vertex. The second one is for the data that is different for every instance, This is the [example](https://playground.babylonjs.com/#8L50Q3#203).\n\n\n```js\nconst centroidBuffer = new Buffer(engine, centroid, false, 3)\nconst centroidVBuffer = centroidBuffer.createVertexBuffer(\"center\", 0, 3)\nmesh.setVerticesBuffer(centroidVBuffer)\n\nmesh.registerInstancedBuffer(\"direction\", 3)\nmesh.instancedBuffers.direction = directionBuffer\n```\n\nsending uniforms is simple. Like `material.setFloat(\"time\", time)`. Sadly the animation in babylon has not support shader material.\n\nNext week, I will try to learn how to use the node editor with [this video](https://www.youtube.com/watch?v=K0PXzE1hJXg&ab_channel=Babylonjs).","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/08/12/32nd-Autumn-now.md","slug":"2023/08/12/32nd-autumn-now","body":"# The 32nd week: It's autumn now\n\n## IELTS\n\nI started using IELTS premium this week.\n\n## Babylon.js\n\nThis week I found out that react-babylon.js doesn't support tree shaking, moreover, babylon.js is almost 4MB(1MB gzipped), it's almost 4 times bigger than three.js. Well, as a visual engine, size is not a big issue. But I started to check some [R3F examples](https://docs.pmnd.rs/react-three-fiber/getting-started/examples) now.\n\nI tried Babylon.js' node editor. [This](https://nme.babylonjs.com/#7FHE8M#1) is a toon shader inspired by [this article](https://roystan.net/articles/toon-shader/).\n\nRender a HTML to Canvas, it's better to have a height map. Can use [applyDisplacementMap](https://www.babylonjs-playground.com/#WUYDVT#6).\n\n## XR\n\nTikTok has an App EffectHome(橡塑 in China). Snap AR got a lot interesting filters. \n\nARkit supports [hand gesture](https://developer.apple.com/videos/play/wwdc2020/10653/) already. This is [Dilmer's tutorial](https://www.youtube.com/watch?v=toAb_q1R_jY&ab_channel=DilmerValecillos) about hand tracking using AR Foundation. [This](https://www.youtube.com/watch?v=FWyTf3USDCQ&ab_channel=samyam) is a beginner tutorial about AR Foundation.\n\n## Three.js\n\n[This](https://www.youtube.com/watch?v=3jgAcUKTyKw&ab_channel=CJGammon) is a video using both spline and three.js to create a website.\n\n[Triplex](https://triplex.dev/) is an editor for three.js. Kind like babylon inspector.\n\n## Stable Diffusion\n\n[Fantasia 3D](https://github.com/Gorilla-Lab-SCUT/Fantasia3D) and [Dream Fusion](https://www.youtube.com/watch?v=dIgDbBTztUM&ab_channel=NerdyRodent) are tools to build 3D assets.\n\n[Dream shaper](https://www.youtube.com/watch?v=IntRn96C4l4&ab_channel=Technonator) is to build special QR Code.\n\n## CSS\n\n[现代 CSS 你知道多少](https://w3cplus.medium.com/%E7%8E%B0%E4%BB%A3-css-%E4%BD%A0%E7%9F%A5%E9%81%93%E5%A4%9A%E5%B0%91-8f21c3aea806)\n\n## React\n\n[React Graph Library](https://www.react-graph-gallery.com/) uses react and D3 to draw graphs.\n\n[shadcn](https://ui.shadcn.com/) is a UI library based on Radix.\n\n## Favicon\n\n[A blog](https://evilmartians.com/chronicles/how-to-favicon-in-2021-six-files-that-fit-most-needs) about how to add favicon to a website in 2023.\n\n## WSL\n\nI can't call vscode from WSL. Because I configured systemd. [This issue](https://github.com/microsoft/WSL/issues/8952) has the solution.\n\n## ML\n\nHappen to know HuggingFace's new ML framework [candle](https://github.com/huggingface/candle)\n\nGoogle brings visual block and media pipe as tools for tensorflow.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/08/20/33rd-ViewTransition.md","slug":"2023/08/20/33rd-viewtransition","body":"# The 33rd week: View Transition\n\n## WebComponent\n\nlit is a good [web component](https://www.youtube.com/watch?v=2I7uX8m0Ta0&ab_channel=WebDevSimplified) library. To use it in typescript need [decorators](https://lit.dev/docs/components/decorators/#decorators-typescript).\n\n## View Transition\n\nAstro.js supports [view transition](https://developer.mozilla.org/en-US/docs/Web/API/View_Transitions_API). It is a good way to make a block element animate between pages.\n\n## 3D\n\n[This](https://d.design) is a 3D modeling website by Alibaba.\n\n[ogl](https://github.com/oframe/ogl) is a small 3D rendering library.\n\n## Germany \n\n[This](daad.de) website provides information about studying in Germany.\n\n## Thailand\n\n[Duke language school](https://dukelanguage.com/english-calendar/) in Thailand is a good place to learn Thai.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/08/26/34th-week.md","slug":"2023/08/26/34th-week","body":"\n# The 34th week\n\n## public social fund\n\n[This](http://bj.bendibao.com/zffw/2020128/285085.shtm) is how to cash out the money from the public social fund. [This](https://map.beijing.gov.cn/gjj/tag?tagId=60cb3fa7bd15ba1c65342fdd) is the map.\n\n## A HK SIM Card\n\n[clubsim](https://www.clubsim.com.hk/zh/gameeasy)\n\n## A HK bank account\n\nThese youtube videos are helpful:\n\n- https://www.youtube.com/watch?v=ee8H6EpJUF4&ab_channel=Ken%27sFireNote\n- https://www.youtube.com/watch?v=Dwk2ZxkCeKU&ab_channel=Beitong%E5%8C%97%E5%90%8C\n- https://www.youtube.com/watch?v=kqlen7ISaXM&ab_channel=%E7%A5%A5%E5%93%A5%E6%8A%95%E8%B5%84\n- https://www.youtube.com/watch?v=DhliMZLLyUw&t=2s&ab_channel=%E6%95%B0%E5%AD%97%E7%89%A7%E6%B0%91LC\n\ntry to apply in 太子 or 德辅道中\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/09/04/35th-week.md","slug":"2023/09/04/35th-week","body":"\n# The 35th week\n\nkeep everything for IELTS test","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/09/24/38th-week-opencore.md","slug":"2023/09/24/38th-week-opencore","body":"\n# 38th Week - OpenCore\n\n## IELTS\n\nGot a 7 in IELTS test! Hooooray!\n\n## OpenCore\n\nTwo weeks ago, I bought a new laptop, ASUS Pro Art 16. Thus, I decide to sell my old one, which is Dell Inspiron 7391 2in1. Sadly, even as cheap as 2k RMB, it picks no one's interest. So I decide to keep it as a hackintosh machine. And yes, it was sold out in the next day.\n\nMaking a laptop into a hackintosh is not as easy as an ITX. I can not choose the hardware. Gladly, Dell has a good reputation on Linux support. I found a lot configurations on github. However, most of them doesn't work as I expected. So I used almost one week to learn how to configure a opencore config file.\n\n### OCAuxiliaryTool\n\nThis tool is a must-have for hackintosh. Earlier in this year, I have to config opencore with [OpenCore Configurator](https://mackie100projects.altervista.org/download-opencore-configurator/), one of its flaw is that it is a macOS only App. But OCAT is a cross-platform tool, which is very convenient for me.\n\n### Dortania's Guide\n\n[This](https://dortania.github.io/OpenCore-Install-Guide/) is the most important guide for hackintosh. It is very detailed and easy to understand. Beleive me, all the errors I met, they were all finally went to this guide.\n\nHowever, since I'm a Chinese, I also checked [国光](https://apple.sqlsec.com/) and [黑果小兵](https://blog.daliansky.net/) for more information.\n\n### My Config\n\nThis is my [config.plist](https://github.com/gongbaodd/DELL-Inspiron-7391-Hackintosh-EFI), hint it is only available for Ventura. For other versions, you may need to change the Itlwm.\n\n### Hide entries\n\nTo hide some entry, you need to add \".contentVisibility\" to the Boot folder. Check [this](https://www.insanelymac.com/forum/topic/355227-how-to-opencore-087-088-differences/).\n\n","collection":"blog","data":{"type":"post","category":"plan","tag":["hackintosh","opencore","IELTS","OCAuxiliaryTool"]}},{"id":"2023/09/30/39th-week-Apple-Watch.md","slug":"2023/09/30/39th-week-apple-watch","body":"\n# 39th Week - Apple Watch\n\n## Apple Watch\n\nI bought an Apple Watch SE2. Yes, it's been a long time since I used a real smart watch. I used pebble time for a long time. It was still my top 1 smart watch. I want to have a round watch, like Pixel Watch, but it doesn't support iOS. In iOS, the Apple Watch is the only choice. This year, Apple released Watch OS 10, which changed it's user experience. Users can freely switch app view, the notification view and home with a swipe. I like it very much. I have a small wrist, so I choose the 40mm version. Thank god I chose this one, I can't imagine how big an ultra version is.\n\n## Sonoma on VMware\n\nSince I have sold my hackintosh, I have to build a Mac on VMware. I found the mac in VM runs frequently on Nobara OS. I bumped to a kernel problem, fixed following the instruction in the [forum](https://communities.vmware.com/t5/Workstation-2023-Tech-Preview/Linux-Kernel-6-5-rc-vmmon-compile-fails/td-p/2981003). Also a `Could not open /dev/vmmon: No such file or directory.` issue, found solution [here](https://askubuntu.com/questions/1348250/skipping-btf-generation-xxx-due-to-unavailability-of-vmlinux-on-ubuntu-21-04).\n\nAfter Ventura, the Mac in the VM can not connect the network, solution is [here](https://communities.vmware.com/t5/VMware-Fusion-Discussions/macOS-Ventura-guest-has-no-network-connection/td-p/2912933).\n\n## Next week\n\nI will plan my trip to Hong Kong. Finish my CV and plan to Thailand.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/10/07/40th-week-Trip.md","slug":"2023/10/07/40th-week-trip","body":"# 40th Week - Trip\n\nprepared my trip.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/10/20/42nd-week-Hong-Kong.md","slug":"2023/10/20/42nd-week-hong-kong","body":"\n# 42nd Week - Trip to Hong Kong & Macow\n\n## Bankcards\n\nI applied HSBC, BoCHK, ZA Bank, Livi Bank, And Bank and Airstar Bank. I didn't get a card from HSBC. The others are fine.\n\n## Meta Quest 3\n\nI bought Meta quest 3 in WanChai. The new mix reality feature is awesome.\n\n## Macow Museum\n\nLearned to be tolerance from a mile budda sculpture. There is a nice game in the museum.\n\n## Hong Kong Museum of Culture\n\nA show about Jin Yong is fun to watch.\n\n","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/10/29/43rd-week-back-home.md","slug":"2023/10/29/43rd-week-back-home","body":"\n# 43rd Week - Back Home\n\nGot back from Hong Kong, Sold my old Quest 2. My bank card is locked, I will find out why next week. I also need to rebuild my website next week.","collection":"blog","data":{"type":"post","category":"plan"}},{"id":"2023/11/04/44th-week-website.md","slug":"2023/11/04/44th-week-website","body":"\n# Week 44th: still work on the website\n\nGot my HSBC card, it seem a PIN code still on the way.\n\nInstalled several \"mainland China Only\" browsers on Hyper-V, to install [windows XP](https://superuser.com/questions/1230652/get-official-windows-xp-virtual-machine-for-hyper-v) or windows 7 in a virtual machine, it's better to use Hyper-V. For network, just use the physical one.\n\nUsing Chat GPT to format some of my old posts, got some experience on it. Firstly, I want GPT to finnish my whole work, it did not work well. THen I tried to separate it into multiple parts, it worked well.\n\nThis week, Clash for windows was deleted from github.com, then clash core was deleted, too. I used new bing to make two sad blue cat to memorize it.\n\nMy home spinning bike was broken, I fixed it poorly, sad.","collection":"blog","data":{"type":"post","category":"plan","tag":["browser","Hyper-V","GPT","Clash","spinning bike"]}},{"id":"2023/11/05/growgen-rebuild-todos.md","slug":"2023/11/05/growgen-rebuild-todos","body":"\n# GrowGen.xyz Rebuild Todos\n\n- Home Page Profile\n- Home Page Octopus Menu\n- Home Page Tags background\n- Header\n- Footer\n- Blog Page Profile\n- Blog Page List\n- Blog Page Selector\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2023/11/11/45th-week-double-11s.md","slug":"2023/11/11/45th-week-double-11s","body":"\n# Week 45: 2023年双十一\n\n## What I bought\n\nBougt a GaN charger, because I do not have enough type-c charger. \n\n## Astro\n\nTurns out there are a lot strict rules in astro, for instance, [RSS feed rules](https://www.npmjs.com/package/@astrojs/rss#rssfeeditem). The web world is becoming more and more strict. I kind like how it goes. \n\n### Katex on Astro\n\n[This blog](https://ileumas.com/writing/2022/03/astro-math-katex/) shares the config to use katex on astro. The latest version is not correct, should use the correct `remark-math` package for `remark`.\n\n## Remark\n\nBy reading [Awesome Remark](https://github.com/remarkjs/awesome-remark), found some interesting plugins.\n\n\n## Apple Watch & React Native\n\nJust a little research, here is the [link](https://www.coditation.com/blog/guide-101-apple-watch-app-development-and-integration-with-react-native?ssp=1&darkschemeovr=1&setlang=en-US&safesearch=moderate).\n\n## Proxmox\n\nProxmox is a VM that can share the GPU with the host. Sadly, it could only work as a server, meaning that it need at least two machines.\n\n## Favicons\n\n[Real favicon generator](https://realfavicongenerator.net/) packs a zip for all icons work for web and mobile.\n\n## Tailwind\n\nThis is a nice [cheatsheet](https://tailwindcomponents.com/cheatsheet/) for tailwind CSS.\n\n## Share Windows fonts for WSL\n\n[This](https://x410.dev/cookbook/wsl/sharing-windows-fonts-with-wsl/) is a workable solution. Run `sudo fc-cache -r -v` to make it work, sometimes WSL need to restart.\n","collection":"blog","data":{"type":"post","category":"plan","tag":["GaN charger","Astro","Katex","Remark","Apple Watch","Proxmox","Favicons","Tailwind","WSL","Fonts","React Native"]}},{"id":"2023/11/14/too-many-tv-endings-this-week.md","slug":"2023/11/14/too-many-tv-endings-this-week","body":"\n# Too many TV endings this week\n\n## Loki\n\nNo doubt, Loki is the best marvel series during and after COVID. Even though many praise are given to the last episode, I still think it is far from the animation pantheon. Loki will not appear in the future. The writer just give a good ending to the audience most loved character.\n\n## Pantheon\n\nI like the ending. It looks like written by Liu Ci Xin, the writer of The Three Body Theory.\n\n## Gen V\n\nThis is the first season of Gen V. Well, just like The Boys. Many blood scene, like it.\n\n## Quiz Lady\n\nA movie about sisterhood. warm and funny.\n\n## Scavengers Reign\n\nAn animation about human landing on a foreign planet. Great music, still many questions to be answered.","collection":"blog","data":{"type":"post","category":"tv","tag":["loki","pantheon","gen-v","quiz-lady","scavengers-reign"]}}]}