{"posts":[{"id":"2019/04/05/Go-to-Changsha-and-not-eat-Changsha-stinky-tofu,-but-also-look-at-the-coffin-of-Ma-Wangdui.md","slug":"2019/04/05/go-to-changsha-and-not-eat-changsha-stinky-tofu-but-also-look-at-the-coffin-of-ma-wangdui","body":"\n# 去长沙没吃到长沙臭豆腐但也要看看马王堆的棺材\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2019/04/07/Xiangjiang-does-not-have-a-fight-for-a-hundred-stringers,-there-is-a-Han-tomb.md","slug":"2019/04/07/xiangjiang-does-not-have-a-fight-for-a-hundred-stringers-there-is-a-han-tomb","body":"\n# 湘江没有百舸争流，倒有汉墓一座\n\n清明三天假期，本来琢么去桂林的，可惜失策在广西竟然有 5 天假，没想到上班时对比香港人是二等公民，放假了和少数民族自治区比起来，也是二等公民 😂。\n\n深圳北去桂林和长沙都很容易，高铁三小时就到。高铁出了广东，山水就美起来了，可以放下手上的书，戴上耳机（高铁里面有小孩）。看看外面的风景，说实话当时刚进广东（确切说是深圳）的时候，就觉得为什么这里的山水看起来都有点营养不良。\n\n长沙高铁站和全国其它高铁站一样，有两个广场，在东广场乘坐地铁，西广场乘坐公交车。国家近几年的高铁八纵八横活动，真的让很多城市都多了高铁站，可是感觉高铁站缺了些特色，简单说照 n 年前，我会和各种火车站合影，但如今，各地高铁站的不同点可能就是那个名字了吧。\n\n照习惯，我会先乘坐公交，因为高铁站往往离市区比较远，如果坐地铁就错失了欣赏城市风景的机会。不过，长沙和郑州还是有点普通了，若不是中途经过湘江，我竟然看不出长沙这个城市和别的城市的不同。\n\n第一夜，我住在湖南大学这边，横跨湘江的有一座桥，貌似这是唯一的一座能够行人通过的桥，亦或是正值假期，所以桥上人流攒动。过了桥就是长沙的网红景点太平老街，全街都是排队买臭豆腐的，没错，臭味与歌声齐飞。\n\n在往东走不远，是黄兴广场，依然是人头攒动，依然是到处都在卖臭豆腐，在一个就是长沙的网红饮品【茶颜悦色】，看排队的样子也要等好一会儿。黄兴广场后面是坡子街，有一个火神庙，里面供着毛主席。。。没错，因为毛主席在这里吃过臭豆腐，长沙除了臭豆腐，还有小龙虾，龙虾馆也要排队等位很久。这就是我在长沙的第一夜，在各种网红景点被人群挤来挤去。\n\n回去的路上，看到有卖槟榔的，作为一个北方人甚是新鲜，可听说这是一级致癌物还以为被禁售了呢，不过最后我还是没买，网上那些口腔癌变的照片实在恐怖。\n\n## 湖南省博物馆\n\n第二天，虽然我一大早就到了湖南省博，但还是排上了长队，教训啊，倘若我没住在湖南大学那边，去省博起码不需要走那个桥。。。湖南省博对我来说，必须看的，肯定是马王堆汉墓和人面青铜鼎了，另外要能看到湘西赶尸的介绍也不错哈 😄。\n\n排了一个小时的队，我已经是饥肠辘辘，赶紧去顶楼餐厅看看有什么，湖南省博进去之后只能从顶楼向下游览，因为整个建筑是参照马王堆汉墓建造的（可惜不是向下挖出来的，所以刚进来要坐电梯到 4 楼才能向下游览，而且我也没发现楼梯。。。）\n\n博物馆食堂早饭没什么特别的，就不多说了。从食堂坐电梯下一层就是马王堆墓葬展览。湘博的志愿者很多，不知道这和节日是不是有直接关系，再加上场馆内游客很多，观展体验其实不是那么好，好在碰到了个比较博学的讲解，即使环境恶劣也能听得比较认真 😂。\n\n马王堆汉墓，名字源于长沙的马王堆乡，这个汉墓其实和“马王“没有什么关系，这个马王是五代十国时期占据长沙的王，之所以叫做马王堆是因为这个地方本身山水较好，很多王陵在这里。而马王堆汉墓其实是汉初时期长沙王刘发的墓地，仔细算一算，应该是和刘胜是同一时期的人物！可以参考我之前去河北博物館（突然发现那一篇我沒写。。。）。当年的长沙国可占着大概整个湖南省的地方，最早的长沙王还不是刘发，而是帮助刘家守卫百越的...额，谁我忘了...说到百越，其实也不是春秋战国时期的越过，而是在趁秦末期战乱，率军从河北跑到岭南的赵佗将军。这个赵佗可是从秦一世一直熬过了秦朝两个皇帝，直到汉武帝刘彻才去世，熬死了 n 个中原皇帝，最短的年龄记录也有 102 岁，是至今最长寿的王了。\n\n扯得远了，汉初长沙王没有子嗣，于是长沙国君主给了马王堆的墓主人刘发，刘发到了长沙国后思念家乡，经常在西北一处高地去瞻望，那里就是长沙的定王台（长沙第二天我刚好住那里）。汉武帝时期削藩，长沙国自然也在内，但是因为长沙王帮助削闽南王有功，长沙国逃过一难，直到刘发儿子去世后才改长沙国为长沙郡。\n\n回到马王堆汉墓，汉墓保存的异常完整，博物馆里面有当时发掘的照片，藕片汤里面的藕片清晰可见完全没有被腐蚀。所以为什么这个墓保存这么好呢？其实走的地方多了就意识到，基本上西汉初期的墓室保存的都很好，源于文景之治，帝王限制国内奢侈风气，连皇帝的墓葬配置都极其清贫，陪葬的除了近身的物品也就是瓶瓶罐罐，奢侈点的东西都是拿木头或者陶器仿制的，所以盗墓的看到这样的墓室自然就躲开了，因为里面也没什么值钱的东西。\n\n汉墓里有三个墓室，最大的也是最早的是刘发的，其次是女主人的墓室，也就是马王堆女尸，最小的是刘发的儿子的墓。马王堆女主人确实比较苦命，根据计算，刘发在她二十多岁的时候就去世了，而她的儿子也走在她前面。女尸的棺椁覆盖三层，描述汉朝时期人们认为人死到升天的过程，大概和木乃伊的亡灵书类似，整个湘博最壮观的装置就是三层棺椁的投影了。\n\n看完棺椁，下楼就能看到女尸真貌，想看的童鞋还是要在网上先搜一下，绝对比网上恐怖...因为实在很真实。\n\n不多说了，湘博还有一个三湘传奇的展览，比较有趣的就是各种青铜器，比如人面青铜器。其实这花纹只是看起来像人，按照讲解来看，这可能是饕餮。\n\n## 岳麓书院\n\n从湘博出来坐车跨过湘江回到新文化路，距离岳麓书院就不远了，这附近是岳麓山，岳麓书院在岳麓山的脚下。从岳麓山入口到岳麓书院能路过湖南师范大学，也就是太祖的学校，和湖南大学，比较有趣的是湖南大学和湖南师范除了校门有标志，并没有一个明显的墙做分界，走着走着就跨了两所学校。\n\n岳麓书院 50 一张票，入口其实在湖南大学的东方红广场后面，但是我是从出口进入的 😐，网上能够搞到导游词，对于我来说是倒的 🤣。\n","collection":"blog","data":{"type":"post","category":"travel"}},{"id":"2019/04/30/The-feeling-of-staying-in-Kunming-is-the-most-comfortable-days-in-Beijing-in-spring.md","slug":"2019/04/30/the-feeling-of-staying-in-kunming-is-the-most-comfortable-days-in-beijing-in-spring","body":"\n# 待在昆明的感觉就是北京春天最舒服的那几天\n\n## 车上风景\n\n从深圳去昆明是有高铁的，路线是直接穿过广东、广西和贵州到达云南的「几」字形高速铁路。想要看风景的童鞋其实可以放弃了，基本上过了桂林就开始横穿横断山脉的各种山洞。然而桂林山川的确值得一看，火车会在短暂的几分钟时间里穿越桂林独特的山川，此时看着风景臆想一下火车在山峦中穿梭的情景也是不错的体验。\n\n## 昆明南高铁站\n\n昆明南高铁站周围很空，还没什么公交，只能坐地铁，大概一个小时才能到达昆明老城区（昆明火车站附近），我预定的青旅还要再转公交，但其实也可以扫个自行车，我也是这么做的。\n\n青旅距离翠湖公园其实有一点距离，躲在居民楼里面，是标准的赫鲁晓夫楼的样子，换好床铺我就前往附近的小吃街吃点东西。这小吃街也不错，虽然破破烂烂竟然有一家沃尔玛。\n","collection":"blog","data":{"type":"post","category":"travel"}}]}