{"posts":[{"id":"2019/09/14/I-almost-was-not-hot-to-die-in-Ganzhou.md","slug":"2019/09/14/i-almost-was-not-hot-to-die-in-ganzhou","body":"# 我在赣州差点没被热死\n\n![Youtube](https://youtu.be/7AK9mw_UfHo)\n\n![Bilibili](https://www.bilibili.com/video/av82447734)\n\n看看我的计划，这个中秋应该去一趟江西了，想想几年前去黄山距离婺源也就是几步之遥，可惜兴尽而返，没能一赏无尽的油菜花。好在广东距离江西也不远，而且赣州是古代客家人迁徙必经之地，又有宋代城墙和浮桥可以阅古，可惜从深圳到江西的高铁必须绕路广州或者漳州（去往梅州的高铁要十一之后才能通车），只能选择到惠州坐绿皮车前往。\n\n## 惠州\n\n一线城市节假日不要走高速😂，本来计划9点到达惠州的客车活活拖到了11点，到了惠州客运站发现根本叫不到车，老老实实坐了一个小时的公交...简直杯具啊，想想还好是到惠州站，地图搜了一下，惠州南站根本就不在市区里面。\n\n公交经过惠州西湖，喇叭里大声喊道「全国5A景区，惠州西湖车站到了」。\n\n惠州火车站可真是破旧，门口只有几家广东必有的隆江猪脚饭，有两台取票机，排着巨长的队伍。更悲伤的，是过了一会儿一台取票机重启了，巨大的WindowsXP图标在黑色屏幕上面闪烁，朴实的打工仔还在努力地刷着他的身份证。大概半小时，我取到了粉色的车票，然后候车的人脸识别机坏了，这回好一些是Windows7，没想到这些机器用的都是x86的机子而没有选择arm机，可能大部分都是政府采购的二手机？\n\n## 赣州\n\n大概7点钟，终于到了赣州，兴奋的我急忙打开了大众点评，然而基本也没几个推荐，啊~没有互联网的城市啊。搜了一下地图，最近的商圈是一个叫「钓鱼台」的地方，哈哈，乍一看吓了我一跳，还以为是什么政府要员的必经场所，到了之后是一个不算特别繁华的商业街，不知道是不是节日的关系，所谓的商业街也不是很热闹，也可能夜生活不是很丰富八点基本上没多少人了，饥肠辘辘的我吃了买了一份正新鸡排。\n\n要说赣州有什么好吃的？来之前知道这里有一家粉蒸鱼，在钓鱼台的一个拐角，阴森森的还有点吓人，虽然里面也没多少人，可是一份鱼等了我一个多小时，若不是那个鸡排打底，我估计撑不到鱼做好了。\n\n吃饱喝足，去我定好的「大酒店」，其实算是个经济酒店了，客房大姐要我再定一个一百的房间交定金，而且还能用红包。屋里面有一个神奇的共享充电头，扫码能用...酒店位置在浮桥附近，想的是大清早能去浮桥看日出，我想多了，第二天一觉睡到了中午。\n\n既然住在了浮桥附近，我怎么也要爬一下城墙，江西真热啊，37度的高温，分分钟劝退。赣州是一个两江夹着的沙洲，赣州博物馆新馆位于沙洲对岸的新区，然而因为修路，我找不到我要坐的公交车站，只能扫一个共享电动车前往。\n\n赣州市博物馆新馆其实是一栋三层的小楼，展览区域在二楼三楼，基本上两处展览可看，一个是赣州市区的矿物质展览，另一个是客家人迁徙展。里面有一个孙中山的家族族谱，呃，其它就没什么印象了。不过印象深刻的还是它的精品展，本来是我第一个奔着的地方，没想到已经改成冰淇淋店了，巨大的冰淇淋展板和富春山居图真是格格不入。\n\n逛完博物馆，退了房间，大太阳依然在天上悬着，无奈，只好去附近的商场看看，这里有一家669商场，还以为是马爸爸的产业。其实就是个普通的商场，不过有赣州第一家星巴克，最尴尬的就是，这家星巴克门口还摆着毛爷爷的头像😂，我说我喝个咖啡谁在看我呢。\n\n## 古浮桥和城墙\n\n大概下午4点左右，终于凉快一些，虽然也是30+的高温，可不去一趟浮桥，着实可惜些。前面提过，赣州城是两江夹着的沙洲，丰水期，贡水和章水会漫到城墙上，所以城门还有特别的防洪装置。浮桥是多个小船拼接而成，主要利于船舶航运，如果有船舶经过，可以拆开桥让船经过。如果北方敌人进攻，也可以很快毁掉桥进行防守。\n\n下午浮桥边是很多光着膀子的弄潮儿在游泳，有人在桥上散步。桥边的摊贩是非法经营，因为桥两边分属不同区，一旦有城管视察商贩就从桥的一头跑到另一头。\n\n赣州城墙没有西安城墙的宏伟，也没有南京城墙的秀气，但也独具特色，墙一面并没有围栏，所以没看好路说不定能栽下去，墙内是一个未开发好的商业街，20世纪的小洋楼和城墙虽说没那么搭配，倒也没有星巴克看毛爷爷的突兀。\n\n城墙尽头是八镜台，可以远观章水和贡水合流进赣江，章水相较于贡水要浑浊些，所以站在把镜台前面能看到赣江有一个明显的分界。绕开八镜台，再走不久就是郁孤台，我到的时候太晚了，已经不能去，旁边有一个郁孤台广场，里面酒吧的驻唱一言难尽啊。\n\n## 赣州火车站\n\n原路返回深圳的绿皮车只能半夜乘坐，深刻地感到了赣州火车站的抠门，空调开到了33度，哭了。古浮桥和两江合并虽然美，然而温度真心劝退啊。","collection":"blog","data":{"type":"post","category":"life"}}]}