{"posts":[{"id":"2019/09/26/Finally-said-goodbye,-I-often-see-each-other-in-the-future.md","slug":"2019/09/26/finally-said-goodbye-i-often-see-each-other-in-the-future","body":"# 终于告别了，以后常相见\n\n原文因为可见原因发到[知乎](https://www.zhihu.com/question/298719767/answer/839801346)了，虽然我也不用知乎。\n\n![IMG_20190927_093523.jpg](http://ww1.sinaimg.cn/mw690/89d0a2e1gy1g8hgstqeblj20xp0xp7iq.jpg)\n\n![IMG_20190927_091330.jpg](http://ww1.sinaimg.cn/mw690/89d0a2e1gy1g8hguggl1cj22001i0hdt.jpg)\n\n简单介绍一下我吧，我之前在去哪儿(北京)工作，后来和携程合并了也和上海的同事打过交道，后来想从事一些后端的工作，正巧旅游到了深圳就来Aftership工作了。\n\n## 技术\n\n到离职时，我在这家公司从事过一年的node.js后端开发和几个月的前端开发，分开说说。\n\nNode.js后端团队叫做Mocha，为公司开发核心API，因为这家公司最早是做API的toB公司，所以在这方面要求标准(起码比Qunar的更加标准)。\n\n1. 目前团队核心工作是重构旧系统，没有太多技术债务，但也没有多少创新。\n2. 团队没有产品经理，有时候老系统文档丢失，需要和香港的同事沟通，而且有些员工早就已经离职了，往往折腾很久还没写上一行代码。\n3. 产品依赖谷歌和亚马逊全家桶，对比国内的云来说，国内云的确还有差距，但是因为公司的权限管理有问题，往往不会给你足够的权限，但出问题肯定算你身上 。\n4. 公司提供合法的外网访问手段，亲测推特脸书什么都可以上，但是香港相关的新闻网站都是不能访问的 。\n5. API遵循Restful的规范，虽然很标准了，但我个人还是觉得有照猫画虎的感觉 。\n6. 工作流程严格按照Scrum敏捷开发，这一点真的在大陆是找不到的，一年下来感觉有点死板，搞不懂为啥daily standup非安排到早上，毕竟早上9点上班，而且还要听跟我没关系的项目报告。\n7. 项目大多是用JS来写的，好在测试覆盖率能保持在70%以上，目前是推动了typescript，但是刚推不久我就调去前端了 。\n8. 团队比较团结，呆在里面还算比较舒适，但感觉上更多舒适感是自下而上的，领导层并不尊重底层员工，相比于Qunar的结果导向以及对事不对人原则，这家公司做得算是拙劣了。\n9. 没有QA，系统稳定靠的是开发维护的单元测试和集成测试还有开发互测，造成测试环境和灰度环境基本上是用来debug的，不过公司规模尚小还有修正的余地。\n\n前端团队和产品经理以及设计团队合在一个小团队里面，叫做VLT，这个团队处理包括所有toB及toC用户交互相关功能。\n\n1. 目前团队工作主要是提供新的小功能迭代和部分老系统的重构，所以技术债务也不少，创新也不多。\n2. 基本上产品经理和产品是1对n的关系，而产品没有和工程师绑定，所以往往工程师对一个项目做好规划的下一个冲刺就被调到别的项目去了。\n3. 大陆的产品经理拦掉了大部分来自领导层的无理需求 ，可是还有很多不得不做的真是哭笑不得。\n4. 前端基本上React全家桶，样式直接用shopify的Polaris，难得的省心。但是现有项目bug很多，基本上我扫一眼配置就好多bug，然而提出来还要挨批，这大概是我离职的原因了吧 。\n5. 工作流程也是Scrum，但是standup实在9点之前。\n6. 很多前端项目都用上了typescript了，但是测试覆盖率惨不忍睹，里面使用any的地方也很多，做前端的几个月终于逼他们提高了点测试覆盖率，但他们并不清楚我用意是啥 。\n7. 相比于Mocha，这个团队就没那么团结了，甩锅很严重，想推动些什么真的很困难。\n8. 没有QA，部分开发也不做自测，领导层无技术经验，笃信个人，这可能是产品随便看看一堆bug的原因了吧。\n9. 开发没参与到需求设计阶段，导致产品都设计好了，发现有严重错误，最后还是按照错的做。\n\n## 管理\n\n前面提过了，这是我见过践行scrum最好的公司，因此基本上没出现过过度加班的情况。\n\n但是其他问题不少，比如入职和离职的流程不明确，离职申请不知道找谁，最后一天我还开玩笑能不能抱着笔记本跑路。\n\n公司没有文化，虽说口头上有个信任，但是写代码要粘贴运行结果，每个冲刺review要把每个feature看一遍(当然可能因为没有QA)。我曾经遇到过项目都快写完了，因为和领导层预期设计的不一样导致推翻了重做，然后领导层的设计又有一个大bug，导致最后又来了一次重新设计，虽然在最后一天针对这件事儿我收到了道歉，但我肯定是不能接受的 。\n\n人事对BAT员工完全是跪舔，哪怕是被末位淘汰下来的，所以BAT末位淘汰下来的同学们，你们还在等什么！快来！\n\n## 福利\n\n1. 当月25日发工资，9102年了，都要全面小康了，不当月发工资的算违法好么？\n2. 2-6月年终奖，其实香港没有节假日奖金的传统，所以发奖的时候满脸写着不高兴，话说真有6个月的吗，在这儿留个言撒~\n3. 全额工资五险一金，同第一条，不这么做算偷税漏税好么？\n4. 不定期月度奖金，确实不定期，入职1年多发过一次\n5. 带薪病假也是法律规定吧，带薪年假貌似没有达到法律规定，而且按律应该每年增加一天，入职既有的5天年假如果年内离职要扣的哦~\n6. LG 4K显示器是真不错，搭配我的XPS刚刚好，至于MacBook，应该算开发标配了。\n7. 零食的确不断，但是新办公室只能去茶水间吃，每天确实有下午茶，不错的 。\n8. 购买书籍和在线课程报销的确有，想要赶紧去 。\n9. 每年定期体检，这个没有 。\n10. 每年不定期旅游，就去过一次大鹏湾，哎呀~想去玩自己去嘛，非得和同事去。。。\n11. 收费工具嘛，这种东西怎么会从下而上的推动，看看就好啦~\n总结\n\n简单来说，符合以下几点可以考虑这家公司\n\n1. 北方的小伙伴想体验下南方的工作，甚至想交一点南方的朋友。\n2. 想体验一下最标准的scrum工作流程。\n3. BAT被末位淘汰的朋友。\n4. 想体验GCP和AWS，但是不满足于官方的tutorial。\n5. 前端想试一试做后端，后端想试一试做爬虫。\n6. 不差钱，有轻微M倾向且不想加班。\n7. 不期望涨薪，只想在深圳稳定发展。\n\n这个评论发表之后，我收到了各种前同事的响应，有支持的也有疑问的，很遗憾他们没有在网络上发表反馈。虽然为了保证足够客观，已经把很多能激起个人情绪的事情略掉了，为了将来的友谊，我勘误掉了某些可能涉及到个人的指控。\n\n我无法完全保证本文的客观性，仅仅只能以我个人的视角来回答问题，只能说我在尽量避免偏激言论。Aftership在内地还是个起步阶段，各种问题肯定是会有的，在这个公司待过的我当然也不会希望它走下坡路。我更希望它能以一个有则改之无则加勉的心态去接受评价，而不是「老子没错」(其实这样的大厂也不少)。\n\n但愿一年后，会有人在这里反馈，上文的问题已经被改正，我这篇文章也算为公司做了贡献了。","collection":"blog","data":{"type":"post","category":"life"}}]}