{"posts":[{"id":"2019/01/01/8102-9102.md","slug":"2019/01/01/8102-9102","body":"# 8102年的尾巴9102年的开头\n\n看完今年的黑镜跨年，2019年就这么到了，想想大学的时候还在打算我25岁去国外找个洋妞呢，这么来看，我已经完成一半了没错，我25了。\n\n一月，尝试使用了kotlin写安卓应用，我相信现在我也不是特别会写了...这一年发生了太多，flutter基本上成为安卓上的话题了，但是wait for it，忙活了那么多，从jquery到react到RN...感觉这些框架能做的越来越局限，现在我往牛角尖里面钻，有点得不偿失了。\n\n二月，开始用pixiJS写了些游戏，不得不说，写游戏真是件容易沉迷的事情，二月姥姥走了，我也打算离职了。\n\n三月，雅思考试，尝试aframeJS，学习UK。\n\n四月，尝试使用Graphql，话说当时是没有看出来有什么好的（毕竟那时候还没全职后端），现在想想restful的设计的确是处女座了点。\n\n五月，忍了两个月终于提了辞职信，数了数假期，出去玩了一个月，从北京-邯郸-郑州-武汉-宜昌-重庆-成都-西宁-拉萨。为什么不出国呢？哈哈，并不是没钱，当年工作前从大连坐船去山东围着整个渤海走了一圈就是这样玩的，如果去国外，外一没做好攻略这种玩法的体验就大打折扣了，现在回看五月的旅行，都是满满的回忆了。\n\n六月，六月其实是意料之外，其实想五月就离开北京的，可是当时离职的时候一犹豫就续租了房子，哈哈，或许就是命盘里面禄忌都在迁移宫造成的吧。6月学了好多，初探如何拿Python写tensorflow，我的网站也重构了下。初试rust，我明显要多练习啊。\n\n七月，开始了下半年的旅行，主要是因为北京太热了，顺便找一下下一个想去工作的地方。北京-天津-青州-日照-南京-上海-福州-泉州-汕头-深圳，又回了大连呆了几天，可把我热坏了。我把单反给了我爸，说实话，现在有点后悔了，可我会不会再买一台呢...\n\n八月，中旬就入职aftership了，其实至今也在为这个选择感到疑虑，但不得不说从八月到年末，的工作令我大开眼界，完全是现代后端平台的一个概论课，包括serverless，SQS，谷歌的分布式数据库，虽说后端没前端精彩，但也没那么乏味。\n\n九月，十月，十一月，开始探索深圳这个城市，深圳果然是比北京还要红的城市啊。\n\n十二月，广州和香港行，两个说粤语的城市，而且都是到处在修路，算是都没逛完吧，反正很近，这两地我还会常去的。\n\n## 年度装备\n\n我本来想说Anker的投影仪的，可惜它最近表现不好，投屏总断线。所以给酷比魔方的mixPlus了，电磁屏幕，价格划算，带出去轻度使用一天足够，win10的系统，微软爸爸良心系统，可惜是home版。搭配Xodo看从allitebooks里面的书，顺便还能画个画啥的。\n\n## 年度网站\n\n本来想说allitebooks呢，但貌似是盗版网站就不提了，给mixamo吧，是用来做3d人物动画的。\n\n## 年度软件\n\nmagicavoxel，我头像都是拿它做的，不得不夸。\n\n去年是本命年结束的第一年，然而我的运气并没有变好，或者说还有点变坏，去年我算了紫微斗数，紫薇旺疾厄宫，想想还真准，去年基本每个月都感冒一次，有一次甚至是咳血。年底整个精力消沉，找不到各种兴奋点。\n\n## 2019\n\n然而，今年，虽然财帛和官禄平平，但是其它都有兴旺的气息，尤其迁移宫，哈哈，可以多出去玩了。\n\n去年年末有些焦虑了，每天要做的事情太多，导致每天都很忙，今年换个法子，以周的形式审计来看看。\n\n2019，加油！","collection":"blog","data":{"type":"post","category":"life"}},{"id":"2019/01/05/Go-to-Guangzhou-to-see-the-ancient-tomb.md","slug":"2019/01/05/go-to-guangzhou-to-see-the-ancient-tomb","body":"# 到广州看古墓\n\n一直很好奇那些古代墓穴是什么样的，以前听【壁下观】介绍过河南的古墓博物馆可以直接进到古墓里面，于是打算2018年要去一次古墓。然而去洛阳的时候正好赶上停电，没看成。后来听【大内秘谈】提过北京附近就有大葆台汉墓，还是特殊的黄肠题凑，真的跑去探访才发现博物馆已经关闭很久了。\n\n我几乎要打消这个念头了，偏偏上个月来广州玩的时候搜到了南越王汉墓，害怕碰到大葆台一样的事就没有去，元旦一年总结的时候这事儿又被翻出来了，趁着农历年还剩那么几天，先把这事解决了。\n\n## 福田站-广州南站\n\n从深圳南山坐火车可能不是个好主意，我感觉坐了快一个小时的地铁才到达福田火车站。福田火车站是相当大了，建议下了地铁赶紧解决伙食问题，因为在火车站候车室只有一家便利店和周黑鸭，血的教训啊。\n\n从福田站到广州南站快得多，火车从西九龙始发，检票提前十分钟左右，开始还不紧不慢地逐个检票，然后里面喇叭里传过来‘前往广州南的GXXXX次列车已经停止检票’的声音，检票员也不仔细检票了，一群人鱼贯一样冲进站台。\n\n福田站站台很现代化，和很多现代地铁站一样的封闭站台，从在站台上车只留着一道门，站台一边是前往广州南的，另一边是西九龙的，我很好奇，如果不小心上错了车，直接到了西九龙，到时候还能像坐地铁一样坐回来吗？\n\n从福田到广州南要快得多，感半小时就到了。我自诩轨道上逛过大半个中国，什么样的火车站没见过，可是还是被广州南的发达吓到了，高屋建瓴，四通八达，不愧是华南的交通枢纽。\n\n出了广州南站可以坐2号线大概十几站到海珠广场，附近就是繁华的上下九步行街。就地下交通来说，感觉广州可不咋便利，也就十点多，已经有部分列车是末班车了。\n\n我在这里预定了登巴青旅，也不知道是不是因为登巴上海和登巴深圳给我留下了比较好的印象，看到他们还有空床，而且这价格比我预想的少了一半，就预定了。结果呢？一分钱一分货吧，可能登巴广州建的比较早，所以设施也差了些。\n\n大概十一点钟，我也算是饥肠辘辘，除了在福田站全家买了包薯片之外，胃里就没有什么了，想想这广州号称24小时不夜城，怎么晚上也该热热闹闹的吧。但是就我看到的，虽然很多店面还开着但是路上人还是少的。可能是因为春运已经开始了？\n\n## 石室圣心大教堂\n\n晚上回去打开地图，发现石室大教堂就在附近，甚至可能晚上闲逛的时候都路过。一早梳洗完后，我变跑去了。乍一看这个教堂给我一种天津看到的教堂的感觉，急忙翻出夏天在天津拍的照片（完全不一样）。\n\n教堂内还有读圣经的人，外面还有耶稣牧羊雕塑。\n\n## 沙面\n\n沙面岛也在附近，出了大教堂，经过一堆卖海鲜干货的铺子（这些铺子真是大开眼界，里面还有卖鳄鱼肉干的）。沙面曾是英租界，里面有很多老的欧式建筑，这些小楼翻修得不错，尚有老楼的感觉，来之前以为会看到天津意式风情，到了之后倒有些大连未拆迁的高尔基路的味道。\n\n## 西汉南越文王墓\n\n南越王墓在越秀公园附近，光从我的经验，墓地怎么也得是个郊区，气势磅礴，但实景其实满不起眼的，即使墓地在山上，博物馆也被埋在楼林中。想想也有两千年的光景了，那会儿越秀区说不定真是个郊区。\n\n博物馆大概是三栋楼，第一栋应该是临时展，中华文字展，我在很多地方都看过类似的，自然没觉得有什么特殊的。惊喜之处在最后的交互区，可以免费体验雕版印刷，这在中国印刷博物馆可是个收费项目啊！\n\n第二栋，就是墓穴了，当年是在墓室上方发现的墓穴，就没办法从墓道进入了。南越王墓还有15人陪葬，要知道当时的中原已经是人俑陪葬了。\n\n第三栋，陈列馆，一件丝缕玉衣，夫人的玉器装饰等，我竟然看到了五石散，不知道是不是博物馆唬我。\n\n## 又遇尼罗河\n\n来广州的另一事是看埃及展，类似的在南京和成都我也都看过了，但是没见到粤博这么大排场的宣传，到了展厅，我光排队就快1小时了。进了展厅，展品更是被人群堵得水泄不通，故宫珍宝馆的感觉。\n\n## 广州东站-蛇口\n\n搜了下客车能直达蛇口，想不折腾的我干错买了客车票。话说广东客运很方便，在线买了票刷身份证即可，不必取票。好了现在已经坐车1小时了，我先小睡一下。\n","collection":"blog","data":{"type":"post","category":"life"}},{"id":"2019/01/08/Webpack-V3-V4-globalObject-window.md","slug":"2019/01/08/webpack-v3-v4-globalobject-window","body":"# Webpack从v3升级到v4后默认globalObject会变成window\n\n今天小伙伴出于安全考虑把Webpack从v3升级到v4（太可怕了直接一个大版本更新），结果导致我们node上面引用的umd包竟然就挂了，报错内容是 window is undefined.\n\n搜了下Stack Overflow，果然很多人也有这样的问题。从v4开始，webpack默认globalObject为window。\n\n```\nmodule.exports = {\n    ...\n\toutput: {\n\t\t...\n\t\tglobalObject: 'this'\n\t}\n}\n```\n\n如上改动即可\n","collection":"blog","data":{"type":"post","category":"fe"}},{"id":"2019/01/09/curl-k.md","slug":"2019/01/09/curl-k","body":"# curl有一个k参数是可以不校验证书的！\n\n可能是我后知后觉了，curl -k 可以忽略证书认证\n\n> -k, --insecure\n(SSL) This option explicitly allows curl to  perform  \"insecure\"\nSSL connections and transfers. All SSL connections are attempted\nto be made secure by using the CA certificate  bundle  installed\nby  default.  This  makes  all connections considered \"insecure\"\nfail unless -k, --insecure is used.\nSee this online resource for further details:\n http://curl.haxx.se/docs/sslcerts.html\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2019/01/11/outline.md","slug":"2019/01/11/outline","body":"# 解析outline协议\n\n今天是小三节，祝各位小三都能打倒原配，走上人生巅峰（误）。\n\n谷歌的Outline，如何在linux下面使用呢？\n\nOutline是基于ShadowSocket的，协议是```ss://<base64>@<server>:<port>```所以如果你用的是安卓的客户端，直接把协议转成二维码，用ShadowSocks就能扫码使用了。\n\n上面已经能看出来```server```和```server_port```了，那么一个shadowsocks的配置文件，还差```password```和```method```，解译base64部分，便可以得出```<method>:<password>```。\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2019/01/12/Wanderer.md","slug":"2019/01/12/wanderer","body":"\n# 流浪地球\n\n马上流浪地球就要上映了，反正也是篇中篇小说我大致看一下好了。\n\n故事大概说的是太阳即将变成矮星，人类打算搬离太阳系，但是无法创造一个完全的类地生态系统，所以干脆让地球达到逃逸速度逃离太阳的故事。\n\n科幻故事嘛，总会有瑕疵，详情参考知乎[流浪地球：行星发动机理论可行吗？](https://zhuanlan.zhihu.com/p/51496504)。\n\n整个故事还算合情合理的，起码当我拿它当睡前故事看，晚上睡觉还真梦到地球爆炸了。。。\n","collection":"blog","data":{"type":"post","category":"tech"}},{"id":"2019/01/19/windows.md","slug":"2019/01/19/windows","body":"\r\n# Using Windows to develop\r\n\r\nLast year, I started thingking to switch into Windows rapidly. Back to the years I decided to use Linux. Mostly because I want a faster working environment, the old Vista required more memories and CPU usages that I could't afford. Even in Windows8, gnome-shell run much more fluent.\r\n\r\n## Cons in Linux desktops \r\n\r\nSo, why do I want to switch?\r\n\r\nWell, games are not the problem, I quiet like to play supertuxkart, actually.\r\n\r\nHDPI is a hard chalenge, especially on a touch screen. I admire the effort that the Open Source world took, but it's still not good enough.\r\n\r\nInput bar is an important tool for Chinese users. The latest version of GTK-Chromiumn has a bug, that the input bar cannot get the correct place where the input box is (I was using fcitx). However, if you refer to the old commit of this package, you would see it had been fixed in an earlier version, maybe the bug appeared after some UI refactors.\r\n\r\nthe Input bar problem seems a nofix. gladlly you can use KDE desktop. The great advance of Linux, is the mass amount of desktops. I tried a lot desktops in ArchLinux, KDE, gnome, mint (a fork of gnome) and budgie (another fork of gnome), they all have pretty good support for HIDPI.\r\n\r\nWireless screen sharing, I have a projector. share the screen of my phone to the walls makes me comfortable, but I can't share screen in Linux. Intel holds the driver for screen sharing, and it's not open source.\r\n\r\nBIOS update, dell updates BIOS some time, it makes my laptop more stable. But I can only update it in Windows.","collection":"blog","data":{"type":"post","category":"tech"}}]}