{"posts":[{"id":"2019/12/20/Movie-supplement-plan-eating-men-and-women.md","slug":"2019/12/20/movie-supplement-plan-eating-men-and-women","body":"\n# 电影补档计划：饮食男女\n\n![Eat drink man woman](https://img3.doubanio.com/view/photo/l/public/p1910899751.webp)\n\n很工整的故事，好像高分作文，不炫技，最后又有一点于无声处听惊雷的感觉。\n\n老朱是一个没有味觉的大厨，工作的时候会依靠温伯来做帮厨。老朱一人拉扯家中的三个女儿，老大家珍化学系毕业，信仰基督教，在学校做老师；老二家倩最受老朱喜爱，也做得一手好菜，在航空公司做高管；老三，家宁在快餐店做服务员。家里的邻居锦荣，从美国离婚回来，带着女儿珊珊和母亲梁伯母。\n\n每周日一家都会聚在一起吃一顿好菜。一天，家倩宣布自己已经买了新房，马上要搬过去。然而工作上，家倩却要被调到国外，可惜之际，她又发现房子有问题，卖家已经跑路。又一次聚餐，家宁宣布自己怀上了餐厅另一个女服务员的男友的孩子，准备搬走。家珍在学校一直收到捣鬼学生写的情书，恰巧又遇到了学校新来的排球教练。不久也宣布要和排球教练搬走。\n\n温伯猝死，老朱突然意识到自己不能死在厨房，打算退休。一天，家倩遇到医院里在心脏科检查的老朱。意识到可能父亲身体不行，决定不出国陪着父亲。\n\n老朱联系一家人，要宣布事情。一家人都以为要宣布和梁伯母的婚事。没想到老朱打算搬家和锦荣成婚，原来去医院只是去检查。\n\n几年后，锦荣已经怀孕，家倩也从国外回家，又是一个周日，只有老朱应约回家。吃着家倩做的菜，老朱找回了味觉。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/12/20/Movie-supplement-plan-small-shoes.md","slug":"2019/12/20/movie-supplement-plan-small-shoes","body":"\n# 电影补档计划： 小鞋子\n\n![Children in heaven](https://img3.doubanio.com/view/photo/l/public/p2454877181.webp)\n\n实话说这电影要不是因为伊朗，不会有这么高分。\n\n阿里是伊朗一家贫穷乡镇家庭的孩子。帮家里买菜的时候弄丢了妹妹送修的鞋子。阿里不敢让父亲知道，让妹妹穿他的鞋上学，等下课了再跟自己换拖鞋，到了月末父亲发工资了再和父亲要新鞋。\n\n妹妹保守秘密每天放学跑去哥哥那里换鞋。一天妹妹发现自己的鞋穿在另一个女孩脚上。两人跟踪女孩发现女孩的父亲是个盲人，便没有上前理论。\n\n一次妹妹放学丢失了哥哥给的圆珠笔，被女孩捡到，女孩找到妹妹并归还了笔，两人成为朋友。\n\n阿里陪父亲到镇里做园丁兼职，回去的路上阿里表示希望父亲给妹妹买一双新鞋。但是路上父亲的自行车坏了，阿里也不敢乱提要求了。\n\n阿里发现如果参加区域的马拉松比赛获得季军就能搞到一双鞋。阿里获得参赛资格但获得了冠军，与运动鞋失之交臂。\n\n同时父亲买了新鞋往家里走。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/12/20/Movie-supplementary-plan-Avatar.md","slug":"2019/12/20/movie-supplementary-plan-avatar","body":"\n# 电影补档计划： 阿凡达\n\n![avatar](https://img3.doubanio.com/view/photo/l/public/p2180085848.webp)\n\n怎么说呢，一个魔兽世界阻止强拆的故事。\n\n男主是个半身残疾的士兵，有一天被通知自己的孪生兄弟执行任务死亡需要他来顶替。原来一个开发商想要开采一个星球，但是当地人反对。开放商要士兵伪装成该星球人获得他们的信任，并劝他们离开要开采的地方。\n\n男主很快得到了星球人的信任，并慢慢爱上了这个星球。意识到开发商的丑恶之后男主带领星球人反抗并成功。\n","collection":"blog","data":{"type":"post","category":"movie"}},{"id":"2019/12/20/Movie-supplementary-program-save-the-soldier-Renn.md","slug":"2019/12/20/movie-supplementary-program-save-the-soldier-renn","body":"\n# 电影补档计划：拯救大兵雷恩\n\n![Saving private Ryan](https://img3.doubanio.com/view/photo/l/public/p1014542496.webp)\n\n上个时代的高分战争电影了，现在看起来其实有很多点有点想吐槽。\n\n二战期间，雷恩家族兄弟四个三人已经死亡，政府安排召回第四个詹姆斯。然而詹姆斯在诺曼底登陆时与其他伞兵走散，只能安排 8 人小组深入寻找。\n\n路上遇到一家法国人，法国人想让军队保护自家的孩子，没想到遇到德国伏击，一人死亡。\n\n千辛万苦找到一个雷恩，却不是要找的那个，于是他们又开始寻找。找到一片雷达区，突破时遭到攻击，又损失一人。但是他们成功俘虏一名德国人。\n\n出于人道主义他们释放了德国俘虏，兵继续前进。终于找到雷恩，雷恩正在执行一项任务。防止德国炸毁盟军前进的大桥的任务。\n\n雷恩表示必须完成任务才能离开，小队最后决定保护雷恩直到任务结束。小队受到了伏击，伏击他们的则是那名释放的德国人，小队几乎全军覆没，但是他们成功地保护了雷恩。\n\n吐槽时间：电影开头有盟军无情射死投降士兵的画面，最后安排德国俘虏反水是为了这个解脱么？\n","collection":"blog","data":{"type":"post","category":"movie"}}]}